{
  "id": "个",
  "kanjialiveData": null,
  "jishoData": {
    "query": "个",
    "found": true,
    "strokeCount": 3,
    "meaning": "counter for articles, individual",
    "kunyomi": [],
    "onyomi": [
      "カ",
      "コ"
    ],
    "onyomiExamples": [
      {
        "example": "箇",
        "reading": "カ",
        "meaning": "counter used with Sino-Japanese words"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "丨",
      "meaning": "line"
    },
    "parts": [
      "个",
      "｜"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/20010_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/04e2a.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/4e2a.gif",
    "uri": "https://jisho.org/search/%E4%B8%AA%23kanji"
  },
  "hanviet": [
    "cá"
  ],
  "vietnameseMeaning": [
    "cá ① Cái, từng cái một gọi là cá, cùng một nghĩa với chữ cá 箇. ② Cái nhà xép, hai bên tả hữu nhà Minh Ðường ngày xưa gọi là tả hữu cá 左右个. Tự mình (như 個, bộ 亻). ① Như 個 (bộ 亻), 箇 (bộ 竹); ② (văn) Này (đại từ, để chỉ gần, dùng như 此這, 這樣 có thể bổ nghĩa cho danh từ, hoặc làm tân ngữ): 白髮三千丈，緣愁似個長 Tóc bạc ngàn trượng, dường như vì mối sầu mà dài như thế (Lí Bạch: Thu phố ca); 個小兒視瞻異常，勿令宿衛 Đứa trẻ này xem có vẻ khác thường, đừng cho làm quân túc vệ (Cựu Đường thư: Lí Mật liệt truyện); 個身恰似籠中鶴，東望 滄溟叫數聲 Thân này hệt như con hạc trong lồng, nhìn về biển khơi ở hướng đông mà kêu lên mấy tiếng (Cố Huống: Thù Liễu Tướng công); ③ (văn) a. Trợ từ giữa câu (có tác dụng bổ trợ về mặt âm tiết): 老翁真個似童兒，汲水埋盆作小池Ông già thật giống như trẻ con, múc nước chôn chậu làm ao nhỏ (Hàn Dũ: Bồn trì); b. Đặt sau một cụm từ, biểu thị sự đình đốn (để nêu ra ở đoạn sau): 獨自個，立多時，露華濕衣 Một mình, đứng đã lâu, hoa sương làm ướt sũng cả áo (Âu Dương Quýnh: Canh lậu tử); ④ (văn) Nhà chái, nhà sép (ở hai bên tả hữu nhà Minh đường thời xưa): 天子居青陽左個 Thiên tử ở chái bên tả của nhà Thanh dương (Lễ kí: Nguyệt lệnh) (Thanh dương là một trong bốn ngôi nhà của nhà Minh đường)."
  ]
}