{
  "id": "乃",
  "kanjialiveData": null,
  "jishoData": {
    "query": "乃",
    "found": true,
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "1978",
    "strokeCount": 2,
    "meaning": "from, possessive particle, whereupon, accordingly",
    "kunyomi": [
      "の",
      "すなわ.ち",
      "なんじ"
    ],
    "onyomi": [
      "ナイ",
      "ダイ",
      "ノ",
      "アイ"
    ],
    "onyomiExamples": [
      {
        "example": "乃至",
        "reading": "ナイシ",
        "meaning": "from ... to, between ... and, or"
      },
      {
        "example": "乃公",
        "reading": "ダイコウ",
        "meaning": "I, me"
      },
      {
        "example": "乃公出でずんば",
        "reading": "ダイコウイデズンバ",
        "meaning": "what will happen to everyone else if I am not the one who goes?"
      },
      {
        "example": "【ノ】",
        "reading": "indicates possessive, nominalizes verbs and adjectives, substitutes for &quot;ga&quot; in subordinate phrases, indicates a confident conclusion, indicates emotional emphasis, indicates question",
        "meaning": ""
      },
      {
        "example": "乃",
        "reading": "ノ",
        "meaning": "'s, of, belonging to"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "【の】",
        "reading": "indicates possessive, nominalizes verbs and adjectives, substitutes for &quot;ga&quot; in subordinate phrases, indicates a confident conclusion, indicates emotional emphasis, indicates question",
        "meaning": ""
      },
      {
        "example": "乃",
        "reading": "の",
        "meaning": "'s, of, belonging to"
      },
      {
        "example": "即ち",
        "reading": "すなわち",
        "meaning": "that is (to say), namely, i.e., precisely, exactly, just, nothing but, neither more nor less, (and) then"
      }
    ],
    "radical": {
      "symbol": "丿",
      "meaning": "slash"
    },
    "parts": [
      "ノ",
      "一",
      "乃",
      "｜"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/20035_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/04e43.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/4e43.gif",
    "uri": "https://jisho.org/search/%E4%B9%83%23kanji"
  },
  "hanviet": [
    "nải"
  ],
  "vietnameseMeaning": [
    "① Bèn, tiếng nói nối câu trên. ② Tiếng gọi mày tao, như nãi huynh 乃兄 anh mày, nãi đệ 乃第 em mày. ③ Một âm là ái, ai ái lối hát chèo đò. Có chỗ viết là 廼, cũng một nghĩa như chữ 乃. (văn) ① Là: 失敗乃成功之母 Thất bại là mẹ thành công; 呂公女乃呂後也 Con gái Lã công là Lã hậu (Sử kí); 天下乃天下人之天下，非一人之天下也 Thiên hạ là thiên hạ của người trong thiên hạ, chứ không phải thiên hạ của một người (Hán thư); ② Bởi vậy, nên, bèn, rồi, thì: 因山勢高峻，乃在山腰休息片時 Bởi núi cao ngất, nên phải nghỉ chốc lát ở lưng núi; 龐涓自知智窮兵敗，乃自剄 Bàng Quyên tự biết trí cùng binh bại, nên (bèn) lấy dao tự cắt cổ chết (Sử kí); 斷其喉，盡其肉，乃去 Cắn đứt cổ họng nó, ăn hết thịt nó, rồi bỏ đi (Liễu Tôn Nguyên: Cầm chi lư); ③ Mới, thì mới (chỉ kết quả của một hay những điều kiện đã hội đủ): 惟虛心乃能進步 Chỉ có khiêm tốn mới có tiến bộ; 性能多食，一飯至三昇乃飽 Tính (ông ta) có thể ăn nhiều, mỗi bữa ăn phải đến ba thưng (cơm) mới no (Nguỵ thư); 見象牙乃知其大于牛 Có trông thấy ngà voi thì mới biết voi lớn hơn bò (Hoài Nam tử); 知地知天，勝乃可全 Biết rõ địa hình và thiên thời thì mới có thể thắng trọn vẹn được (Tôn tử: Địa hình thiên); 鳴呼！ 士窮乃見節義 Than ôi! Kẻ sĩ có cùng khốn rồi mới thấy được tiết nghĩa (Hàn Dũ); ④ (Nay, bây giờ, đến giờ) mới... (biểu thị một động tác hoặc tình huống sau này mới được thực hiện hoặc xảy ra): 吾求君子久矣，今乃得之 Ta tìm người quân tử đã lâu rồi, nay mới được gặp (Quốc ngữ); 寡人聞夫子 久矣，今乃得見 Quả nhân nghe nói về phu tử đã lâu rồi, nay mới được gặp (Án tử Xuân thu); ⑤ Chỉ, chỉ có: 天下勝者眾矣，而霸者乃五 Người thắng trong thiên hạ rất nhiều, nhưng làm nên nghiệp bá thì chỉ có năm (Lã thị Xuân thu); 及湯之時，諸侯三千。當今之世，南面稱寡者，乃二十四 Đến thời vua Thang, chư hầu có tới ba ngàn. Đời nay, nhìn về hướng nam mà xưng là vua chư hầu, chỉ có hai mươi bốn người (Chiến quốc sách); ⑥ Mới, vừa mới, mới vừa: 鳥乃去矣，後稷呱矣 Con chim mới vừa đi khỏi, thì ông Hậu Tắc đã khóc (Thi Kinh: Đại nhã, Sinh dân); 乃啟其口，匕首已陷于胸矣 Ông ta vừa mới mở miệng ra thì cây chuỷ thủ (dao găm) đã vùi vào tới bụng rồi (Tân thư); 古之王者，太子乃生，因舉以禮 Các bậc đế vương thời xưa, khi mới sinh thái tử thì cử hành nghi lễ (Đại đới lễ kí); ⑦ Lại, lại là, thì ra lại là: 諸將皆喜，人人各自以爲得大將。至拜大將，乃韓信也 Các tướng đều mừng, mọi người đều tự cho là đã có được đại tướng. Đến khi họ đến ra mắt đại tướng, thì ra (người đó) lại là Hàn Tín (Sử kí: Hoài Âm Hầu liệt truyện); 問今是何世，乃不知有漢，無論魏晉 Khi hỏi nay là đời nào, thì lại không biết có đời Hán, và không nói gì đến triều Ngụy, triều Tấn (Đào Uyên Minh: Đào hoa nguyên kí); ⑧ Há, sao lại: 高皇帝之意，乃敢不聽？ Ý của Cao hoàng đế, sao lại dám không nghe? (Hán thư); 則向之所謂士者，乃非士乎？ Thế thì kẻ sĩ đã nói trước đây, há chẳng phải là kẻ sĩ hay sao? (Công Tôn Long tử); ⑨ Lại, mà lại (biểu thị ý ngược lại): 彼能是，而我乃不能是 Ông ta có thể như thế, nhưng tôi (thì) lại không thể thế được (Hàn Dũ: Nguyên huỷ); 不見子允，乃見狡童 Không thấy Tử Sung, lại thấy một đứa trẻ giảo quyệt (Thi Kinh); 別雖一緒，事乃萬族 Cái tình li biệt tuy giống nhau, nhưng lí do li biệt lại có hàng vạn kiểu khác nhau (Giang Văn Thông tập: Biệt phú); ⑩ Còn, mà còn (cho biết sự việc như thế mà còn như thế, huống gì..., dùng như 尚且): 夫政不平也，乃斬伐四國，而況二人乎？ Chính sự bất bình, còn đánh phạt bốn nước (= các nước chư hầu ở bốn phương còn phải bị đánh phạt), huống gì là hai người? (Tân tự); ⑪ Lại, và lại, mà lại, lại còn, mà còn (dùng như các liên từ 又，而且): 非獨政之能，乃其姊者，亦列女也 Không chỉ Nhiếp Chính có tài năng, mà chị của ông ta còn là một liệt nữ nữa (Chiến quốc sách); 此非特無術也，又乃無行 Như thế không chỉ là vô thuật, mà còn vô hạnh nữa (Hàn Phi tử); ⑫ Hay là: 意者朕之政有所失而行有過與？乃天道有不順，地利或不得，人事多失和，鬼神廢不享與？(Nhiều năm mùa màng thất bát...) có phải là do chính sự và việc làm của ta có chỗ sai sót lầm lỗi? Hay là tại đạo trời có chỗ không thuận, địa lợi có chỗ không đạt, nhân sự phần nhiều bất hoà, và quỷ thần bị bỏ phế không cúng tế? (Hán thư: Văn đế kỉ); ⑬ Nếu (biểu thị ý giả thiết): 乃越逐不復，汝則有常刑 Nếu các ngươi rời bỏ cương vị để đuổi theo mà không chịu báo cáo, thì các ngươi sẽ chịu hình phạt thường (Thượng thư: Phí thệ); ⑭ Trợ từ ở đầu câu hoặc giữa câu, giúp cho thanh vận được hài hoà: 乃場乃疆 ，乃積乃倉 Sửa bờ ruộng, chỉnh cương giới, tích lương thực, sửa kho chứa (Thi Kinh: Đại nhã, Công Lưu); ⑮ Của anh, của nhà ngươi, của các ngươi (dùng như đại từ nhân xưng ngôi thứ hai, ở sở hữu cách): 爾其無忘乃父之志 Ngươi hãy chớ quên tâm chí của cha ngươi (Âu Dư"
  ],
  "jlpt": "1",
  "frequency": "1978",
  "grade": "9"
}