{
  "id": "之",
  "kanjialiveData": null,
  "jishoData": {
    "query": "之",
    "found": true,
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "1318",
    "strokeCount": 3,
    "meaning": "of, this",
    "kunyomi": [
      "の",
      "これ",
      "ゆく",
      "この"
    ],
    "onyomi": [
      "シ"
    ],
    "onyomiExamples": [
      {
        "example": "之繞",
        "reading": "シンニョウ",
        "meaning": "kanji \"road\" or \"advance\" radical (radical 162)"
      },
      {
        "example": "之繞を掛ける",
        "reading": "シンニュウヲカケル",
        "meaning": "to exaggerate"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "【の】",
        "reading": "indicates possessive, nominalizes verbs and adjectives, substitutes for &quot;ga&quot; in subordinate phrases, indicates a confident conclusion, indicates emotional emphasis, indicates question",
        "meaning": ""
      },
      {
        "example": "乃",
        "reading": "の",
        "meaning": "'s, of, belonging to"
      },
      {
        "example": "此れ",
        "reading": "これ",
        "meaning": "this, this one, this person, now, this point (in time), here, used to stress the subject of a sentence, I, me"
      },
      {
        "example": "これ等",
        "reading": "これら",
        "meaning": "these"
      }
    ],
    "radical": {
      "symbol": "丿",
      "meaning": "slash"
    },
    "parts": [
      "丶",
      "乙",
      "亠",
      "廴"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/20043_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/04e4b.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/4e4b.gif",
    "uri": "https://jisho.org/search/%E4%B9%8B%23kanji"
  },
  "hanviet": [
    "chi"
  ],
  "vietnameseMeaning": [
    "① Chưng, dùng về lời nói liền nối nhau, như đại học chi đạo 大學之道 chưng đạo đại học. ② Ði, như Ðằng Văn-Công tương chi Sở 滕文公將之楚 Ðằng Văn-Công sắp đi sang nước Sở. ③ Ðến, như chi tử mĩ tha 之死靡他 đến chết chẳng tới ai. ④ Ðấy, là tiếng dùng thay một danh từ nào, như Thang sử nhân vấn chi 湯使人問之 vua Thang khiến người hỏi đấy (hỏi ai? tức là hỏi Cát Bá, chữ chi đây là thay hai chữ Cát Bá). ⑤ Ấy, như chi tử vu quy 之子于歸 người ấy về nhà chồng. ① (văn) Của (đặt giữa định ngữ và thành phần trung tâm, tương đương với 的 trong Hán ngữ hiện đại): 民之父母 Cha mẹ của dân; 鐘鼓之聲 Tiếng chiêng trống; 光榮之家 Gia đình vẻ vang; ② Đặt giữa chủ ngữ và vị ngữ để thủ tiêu tính độc lập của câu: 皮之不存，毛將安傅？ Da không còn thì lông bám vào đâu? (Tả truyện); 人之所不學而能者，其良能也 Người ta sở dĩ không học mà biết, là nhờ có lương năng (Mạnh tử); 天下之無道也久矣 Thiên hạ vô đạo đã lâu lắm rồi (Luận ngữ); 民歸之，猶水之就下 Dân chúng theo về với ông ấy, giống như nước chảy xuống chỗ thấp (Mạnh tử); ③ (văn) Họ, hắn, nó...: 吾愛之重之 Tôi yêu nó, trọng nó; 使吏卒共抱大巫嫗，投之河中 Sai quan quân hè nhau ôm bà đồng, ném bà ta vào giữa sông (Sử kí); ④ Cái đó, điều đó (chỉ sự vật đã nêu ra ở trước, hoặc sắp nêu ra): 學而時習之 Học thì thường ôn lại những điều đã học (Luận ngữ); 道之不明也，我知之矣 Đạo không sáng ra được, ta biết điều đó rồi (Luận ngữ); 寡人聞之：哀樂失時，殃咎必至 Quả nhân nghe nói: Buồn vui không phải lúc thì việc hoạ hoạn ắt phải đến (Tả truyện: Trang công nhị thập nhị niên); 商聞之矣：死生有命，富貴在天 Thương này nghe nói rằng: Sống chết có mạng, giàu sang do trời (Luận ngữ: Nhan Uyên); ⑤ Ở đó, nơi đó (chỉ nơi chốn): 淵深而魚生之，山深而獸往之 Vực có sâu thì cá mới sinh ra ở đó, núi có thẳm thì thú vật mới đến nơi đó (Sử kí); ⑥ Này, kia, ấy (biểu thị sự cận chỉ, đặt trước danh từ): 之子于歸 Cô kia về nhà chồng (Thi Kinh); 之二蟲又何知？ Hai giống trùng ấy lại biết gì? (Trang tử); ⑦ Thì (dùng như 則, 便, 就): 故民無常處，見利之聚，無之去 Cho nên dân không có chỗ ở nhất định, (hễ họ) thấy có lợi thì tụ lại, không có thì bỏ đi (Lã thị Xuân thu); ⑧ Đối với (dùng như 於, 于, 對于): 人之其所親愛而闢焉 Người ta đối với người thân của mình thì vì yêu mà thiên lệch (Lễ kí: Đại học); ⑨ (văn) Khác hơn so với (dùng như 此, 于, 於): 哭顏淵慟者，殊之衆徒，哀痛之甚也 (Khổng tử) khóc Nhan Uyên rất đau thương, vì Nhan Uyên khác hơn những học trò khác của ông, nên ông hết sức thương đau (Luận hoành: Vấn Khổng thiên); ⑩ (văn) Và (dùng như liên từ để nối kết từ hoặc nhóm từ, biểu thị mối quan hệ đẳng lập, tương đương với 與): 惟有司之牧夫 Chỉ có quan hữu ty và mục phu (Thương thư: Lập chính); 皇父之二子死焉 Hoàng Phụ và hai người khác nữa chết ở đó (Tả truyện: Văn công thập nhất niên); 得之不得，曰有命 Được và không được, gọi là có mệnh (Mạnh tử: Vạn Chương thượng); 知遠之近 Biết xa và gần (Lễ kí: Trung dung); ⑪ (văn) Đi, đến: 先生將何之？ Tiên sinh định đi đâu? (Mạnh tử); 沛公引兵之薛 Bái công dẫn quân đi sang đất Tiết (Hán thư); ⑫ Tiếng đệm: 總之 Tóm lại; 久而久之 Qua một thời gian lâu; 知之爲知之 Biết thì cho là biết (Luận ngữ); 頃之，煙炎張天 Trong khoảnh khắc, khói lửa mù trời... (Tư trị thông giám); 則苗沛然興之 Thì lúa non mọc rộ lên (Mạnh tử); 之綱之紀 Có cương có kỉ (Thi Kinh); ⑬ Chỉ phân số: 三分之一 Một phần ba;"
  ],
  "jlpt": "1",
  "frequency": "1318",
  "grade": "9"
}