{
  "id": "乘",
  "kanjialiveData": null,
  "jishoData": {
    "query": "乘",
    "found": true,
    "strokeCount": 10,
    "meaning": "power, multiplication, record, counter for vehicles",
    "kunyomi": [
      "の.る",
      "の.せる"
    ],
    "onyomi": [
      "ジョウ"
    ],
    "onyomiExamples": [],
    "kunyomiExamples": [
      {
        "example": "乗る",
        "reading": "のる",
        "meaning": "to get on (train, plane, bus, ship, etc.), to get in, to board, to take, to embark, to get on (e.g. a footstool), to step on, to jump on, to sit on, to mount, to reach, to go over, to pass, to follow, to stay (on track), to go with (the times, etc.), to take part, to participate, to join, to get into the swing (and sing, dance, etc.), to be deceived, to be taken in, to be carried, to be spread, to be scattered, to stick, to attach, to take, to go on"
      }
    ],
    "radical": {
      "symbol": "丿",
      "meaning": "slash"
    },
    "parts": [
      "ノ",
      "ハ",
      "匕",
      "十",
      "爿",
      "禾"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/20056_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/04e58.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/4e58.gif",
    "uri": "https://jisho.org/search/%E4%B9%98%23kanji"
  },
  "hanviet": [
    "thừa",
    "thặng"
  ],
  "vietnameseMeaning": [
    "① Cưỡi, đóng, như đóng xe vào ngựa gọi là thừa mã 乘馬 nói rộng ra thì phàm cái gì nó ở dưới, nó chở mình, đều gọi là thừa, như thừa chu 乘舟 đi thuyền, thừa phù 乘稃 đi bè, v.v. ② Nhân vì, như thừa hứng nhi lai 乘興而來 nhân hứng mà lại. ③ Tính nhân, như nhân ba ba là chín gọi là thừa. ④ Bực, Phật học chia bực cao bực thấp, như tiểu thừa 小乘 bực tu chỉ tự độ được mình, cũng như cỗ xe nhỏ chỉ chở được mình, đại thừa 大乘 bực tu đã tự độ mình lại độ cho người, như cỗ xe lớn chở được nhiều người, v.v. Nhà Ðường bàn thơ, người nào ý tứ cao kì, gọi là thượng thừa 上乘 cũng bắt chước nghĩa ấy. ⑤ Một âm là thặng. Cỗ xe, xe bốn ngựa kéo gọi là một thặng. Ðời xưa đánh nhau bằng xe, tính thuế ruộng ra lính, cho nên tính số thuế ruộng cũng gọi là thặng, như thiên thặng chi quốc 千乘之國 nước có số nghìn cỗ xe, bách thặng chi gia 百乘之家 nhà có trăm cỗ xe. ⑥ Bốn, như sách Mạnh tử nói phát thặng thỉ nhi hậu phản 發乘失而後反 bắn bốn tên rồi sau trở lại. ⑦ Sách vở, những sách ghi chép mọi việc gọi là thặng, như Tấn chi thặng 晉之乘 sách chép việc nước Tấn, gia phả cũng gọi là gia thặng 家乘, v.v. ① Đi, đáp, ngồi, cưỡi (ngựa...): 乘船 Đi tàu biển; 乘飛機 Đáp máy bay; 乘汽車 Ngồi ô tô; 良馬難乘，然可以任重致遠 Ngựa tốt khó cưỡi, nhưng có thể gánh nặng đi xa được (Mặc tử); ② Lên: 俱乘高臺 Cùng lên đài cao (Liệt tử); 亟其乘屋 Mau lên lợp lại mái nhà (Thi Kinh); ③ Ức hiếp: 周人乘黎 Người Chu ức hiếp dân (Thượng thư); 三國必起而乘 我 Ba nước ắt phải nổi lên mà ức hiếp nước ta (Tuân tử); ④ Đuổi theo: 吏士喜，大呼乘之 Quan quân mừng rỡ, hô to rượt đuổi theo họ (Hán thư: Trần Thang truyện); ⑤ Đánh thắng: 天下兵乘之 Quân của thiên hạ đã đánh thắng họ (Lã thị Xuân thu); ⑥ Giữ, phòng thủ: 興關内卒乘塞 Sai quân lính trong cửa ải ra phòng thủ vùng biên giới (Sử kí); ⑦ Tính toán: 乘其財用出入 Tính toán (tình trạng) thu chi tiền bạc của cải của họ (Chu lễ); 爲人臣者，乘事有功則賞 Kẻ làm thần dân, tính toán việc làm có công thì thưởng (Hàn Phi tử: Nạn nhất); ⑧ Nhân lúc, thừa lúc: 乘着有空兒 Nhân lúc rỗi rãi; 將士乘勝，進攻其城 Các tướng sĩ thừa thắng, tiến công vào thành của ông ta (Tam quốc chí); 可以乘虛直牴其城 Có thể nhân lúc quân địch sơ hở không phòng bị, đánh thẳng vào thành (Tư trị thông giám); ⑨ Bực (trong giáo lí nhà Phật): 小乘 Tiểu thừa (bực tu chỉ tự độ cho mình); 大乘 Đại thừa (bực tu vừa tự độ cho mình, vừa độ cho người); ⑩ (toán) Nhân: 五乘二等於十 5 nhân với 2 là 10; 頭乘尾除 Đầu nhân đuôi chia (Tam quốc chí); ⑪ (Họ) Thừa. Xem 乘 . ① Cỗ xe (quân sự) bốn ngựa thời cổ: 千乘 之國 Nước có nghìn cỗ xe (ý nói binh mã rất nhiều); 車六七百乘 Xe sáu, bảy trăm cỗ (Sử kí); ② Bốn: 發乘矢而後反 Bắn bốn mũi tên rồi quay trở lại (Mạnh tử); ③ Sử sách: 史乘 Sách sử; 晉之乘 Sách sử chép việc nước Tấn; 家乘 Gia phả (sách chép việc trong gia tộc); ④ Đơn vị hộ khẩu ruộng đất thời xưa (9 phu là một tỉnh, 64 tỉnh là một thặng): 燕王因以三乘養之 Vua nước Yên nhân đấy lấy (bổng lộc của) ba thặng phụng dưỡng ông ấy (Hàn Phi tử: Ngoại trữ thuyết tả thượng). Xem 乘 ."
  ],
  "grade": "10"
}