{
  "id": "亂",
  "kanjialiveData": null,
  "jishoData": {
    "query": "亂",
    "found": true,
    "strokeCount": 13,
    "meaning": "war, disorder, riot, disturb",
    "kunyomi": [
      "みだ.れる",
      "みだ.る",
      "みだ.す",
      "みだ.れ",
      "おさ.める",
      "わた.る"
    ],
    "onyomi": [
      "ラン",
      "ロン"
    ],
    "onyomiExamples": [
      {
        "example": "乱暴",
        "reading": "ランボウ",
        "meaning": "violence, assault, rowdiness, wildness, running riot, rough (handling, language, etc.), reckless, careless, coarse, rude, unreasonable (e.g. demand), wild (e.g. argument), rape, sexual assault"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "乛",
      "forms": [
        "乙",
        "⺄",
        "乚"
      ],
      "meaning": "second"
    },
    "parts": [
      "乙",
      "冂",
      "厶",
      "爪"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/20098_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/04e82.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/4e82.gif",
    "uri": "https://jisho.org/search/%E4%BA%82%23kanji"
  },
  "hanviet": [
    "loạn"
  ],
  "vietnameseMeaning": [
    "① Loạn, bối rối không yên gọi là loạn, như loạn thế 亂世. ② Giặc giã, quân lính đánh giết bừa bãi gọi là loạn. ③ Rối rít, như loạn ti 亂絲 tơ rối. ④ Tối tăm, như tinh thần mậu loạn 精神瞀亂 tinh thần tối tăm mê mẩn. ⑤ Phá hoại, như hoại pháp loạn kỉ 壞法亂紀 phá hoại phép luật. ⑥ Dâm tà, như trong họ chim chuột lẫn nhau gọi là loạn dâm 亂婬. ⑦ Trị yên, như Võ-vương hữu loạn thần thập nhân 武王有亂臣十人 vua Võ-vương có mười người bầy tôi trị loạn. ⑧ Chữ dùng cho dứt câu ca nhạc, như quan thư chi loạn 關雎之亂 cuối thơ quan thư. Tục thường viết là 乱. ① Mất trật tự, lộn xộn, rối, rối rít, ồn ào, xôn xao: 這裡太亂 Ở đây ồn ào quá; 人聲馬聲亂成一片 Tiếng người tiếng ngựa rối inh cả lên; 這篇稿子改得太亂了，要重抄一下 Bài văn chữa lộn xộn quá, phải chép lại mới được; ② Chiến tranh, loạn, loạn lạc: 變亂 Biến loạn: 叛亂 Phiến loạn; ③ Gây rắc rối, làm lộn xộn: 擾亂 Quấy rối; 惑亂 Gây rối loạn; 以假亂真 Đánh tráo; ④ Rối bời, bối rối, rối trí: 心煩意亂 Tâm tư rối bời; ⑤ Bậy, bừa, ẩu, càn, lung tung: 亂喫 Ăn bậy; 亂跑 Chạy bừa; 亂出主意 Chủ trương lung tung; 亂說亂動 Nói bậy làm càn; ⑥ Loạn (dâm): 淫亂 Loạn dâm."
  ]
}