{
  "id": "于",
  "kanjialiveData": null,
  "jishoData": {
    "query": "于",
    "found": true,
    "strokeCount": 3,
    "meaning": "going, from",
    "kunyomi": [
      "ここに",
      "ああ",
      "おいて",
      "に",
      "より",
      "を"
    ],
    "onyomi": [
      "ウ",
      "ク"
    ],
    "onyomiExamples": [
      {
        "example": "単于",
        "reading": "ゼンウ",
        "meaning": "Chanyu (supreme leader of the Xiongnu people)"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "二",
      "meaning": "two"
    },
    "parts": [
      "亅",
      "二"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/20110_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/04e8e.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/4e8e.gif",
    "uri": "https://jisho.org/search/%E4%BA%8E%23kanji"
  },
  "hanviet": [
    "vu"
  ],
  "vietnameseMeaning": [
    "① Ði, như vu quy 于歸 con gái đi lấy chồng. ② Ði lấy, như trú nhĩ vu mao 晝爾于茅 sớm đi lấy cỏ tranh. ③ Chưng, dùng làm lời trợ ngữ, như chí vu kì hạ 至于岐下 đến chưng dưới núi Kì. ④ So, như vu Thang hữu quang 于湯有光 so với vua Thang có ý sáng sủa hơn. ⑤ Nhởn nhơ, lờ mờ, như kì giác dã vu vu 其覺也于于 thửa biết vậy lờ mờ. ⑥ Một âm là hu, tiếng tán thán, như hu ta lân hề 于嗟麟兮 chao ơi con lân kia! ① Tại, ở, vào, từ, đến (chỉ về nơi chốn, thời gian): 生于1818年 sinh (vào) năm 1818; 聞名于世界 Nổi tiếng (ở) khắp thế giới; 魚躍于淵 Cá nhảy ở vực (Thi Kinh); 龐涓死于此樹下 Bàng Quyên chết ở dưới cây này (Sử kí); 盤庚遷于殷 Vua Bàn Canh dời đô về đất Ân (Thượng thư); 召莊公于鄭而立之 Vời Trang công từ nước Trịnh về mà lập lên ngôi (Tả truyện); 自我不見于今三年 Từ lúc ta không gặp, đến nay đã ba năm (Thi Kinh); 二世，三世至于萬世 Đời thứ hai, đời thứ ba, cho đến muôn đời (Sử kí); ② Nhờ ở, do ở (chỉ nguyên nhân, dùng như 由 于): 業精于勤荒于嬉 Sự nghiệp học vấn tinh thâm do ở sự cần mẫn, bị bỏ phế do ở chỗ ham vui (Hàn Dũ: Tiến học giải). 【于是】vu thị (lt) Do vậy, thế là. Cg. 于是乎 ; ③ Đối với, với, về: 有益于社會 Có ích đối với xã hội; 三公成有功于民 Cả ba người đều có công với dân (Sử kí); 于禪學有所得 Có sở đắc về thiền học (Tục di quái chí); 故不明于敵之政不能加也 Cho nên không hiểu rõ về tình hình chính trị của kẻ địch thì không thể dụng binh được (Quản tử); ④ Cho, thuộc về: 勿委過于人 Đừng đổ lỗi cho kẻ khác; 景公有愛女，請嫁于晏子 Vua Tề Cảnh công có một ái nữ, mong gả cho Án tử (Án tử Xuân thu); ⑤ (Với ý so sánh) hơn: 重于泰山Nặng hơn núi Thái Sơn; 烈于猛火 Cháy dữ hơn lửa mạnh (Thượng thư); 貌狀頗類于獸 Hình dạng hơi giống với loài thú (Sưu thần kí); 陳骨長大，異于今人 Linh cốt của Trần Hi Di dài và lớn, khác với (khác hơn) người đời nay (Tục di quái chí); ⑥ Bởi, bị, được (Với ý bị động): 強國敗于弱國 Nước mạnh bị nước yếu đánh thua; 初，王姚嬖于莊公 Lúc đầu, nàng Vương Diêu được vua Trang công sủng ái (Tả truyện); 有間，晏子見疑于景公 Một thời gian sau, Án tử bị Cảnh công nghi ngờ (Án tử Xuân thu); 憂心悄悄，慍于群小 Lòng lo nằng nặng, vì bị bọn tiểu nhân oán hận (Thi Kinh); ⑦ Trợ từ làm đầu ngữ cho động từ (thường dùng trong Thi Kinh, đặt giữa câu, không dịch): 黃鳥于飛 Chim hoàng điểu bay (Thi Kinh: Chu Nam, Cát đàm); 君子于伇 Chàng đi hành dịch (Thi Kinh: Vương phong, Quân tử vu dịch). 【于歸】vu quy (văn) (Con gái) về nhà chồng: 之子于 歸 Cô kia về nhà chồng (Thi Kinh); ⑧ Trợ từ dùng ở giữa câu để đảo vị trí của tân ngữ ra phía trước (dùng như 是): 赫赫南仲，玁狁于襄 Nam Trọng hiển hách, đánh phạt Hiểm Doãn (Thi Kinh: Tiểu nhã, Xuất xa); ⑨ Trợ từ ở đầu hoặc giữa câu, để cho câu được hài hoà cân xứng (không dịch): 于疆于理，至于南海 Trị lí cương giới tu chỉnh đất đai, cho đến Nam Hải (Thi Kinh: Đại nhã, Giang Hán); ⑩ Trợ từ giữa câu, dùng để thư hoãn ngữ khí (không dịch): 惟命不于常 Mệnh trời không thể thường có (Tả truyện: Thành công thập lục niên); ⑪ Trợ từ đặt cuối câu hỏi: 然則先生聖于？ Thế thì tiên sinh có thánh minh không? (Lã thị Xuân thu: Thẩm ứng lãm, Trọng ngôn); ⑫ Và (liên từ, nối kết từ với nhóm từ, biểu thị mối quan hệ đẳng lập, dùng như 與 hoặc 而): 不克敬于和，則無我怨 (Nếu dân của các ngươi lại) không kính cẩn và thuận hoà, thì đừng trách ta (Thượng thư: Đa phương); 告汝德之說于罰之行 Bảo cho ngươi biết về đạo thực thi đức hoá và về cách dùng hình phạt (Thượng thư: Khang cáo); ⑬ Lấy (động từ): 晝爾于茅，宵爾索綯 Ban ngày đi lấy tranh, ban đêm bện thành dây (Thi Kinh: Bân phong, Thất nguyệt); ⑭ (Họ) Vu. Xem 於 ."
  ]
}