{
  "id": "云",
  "kanjialiveData": null,
  "jishoData": {
    "query": "云",
    "found": true,
    "strokeCount": 4,
    "meaning": "say",
    "kunyomi": [
      "い.う",
      "ここに"
    ],
    "onyomi": [
      "ウン"
    ],
    "onyomiExamples": [
      {
        "example": "云々",
        "reading": "ウンヌン",
        "meaning": "and so on, and so forth, et cetera, and such, and the like, comment, criticism"
      },
      {
        "example": "云為",
        "reading": "ウンイ",
        "meaning": "sayings and doings, words and deeds"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "言う",
        "reading": "いう",
        "meaning": "to say, to utter, to declare, to name, to call, to go (e.g. \"the alarm went ping\"), to make a noise"
      }
    ],
    "radical": {
      "symbol": "二",
      "meaning": "two"
    },
    "parts": [
      "一",
      "二",
      "厶"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/20113_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/04e91.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/4e91.gif",
    "uri": "https://jisho.org/search/%E4%BA%91%23kanji"
  },
  "hanviet": [
    "vân"
  ],
  "vietnameseMeaning": [
    "vân ① Rằng, như ngữ vân 語云 lời quê nói rằng. ② Vân vân v.v. lời kể các sự còn dài, chỉ kể một hai cái làm mẫu, như làng tôi có dệt vải, vóc, nhiễu, v.v. ③ Nhung nhúc, như vạn vật vân vân 萬物云云 muôn vật nhung nhúc. (văn) Nói: 人云亦云 Người ta nói sao, bào hao nói vậy; 子夏云何？ Tử Hạ nói thế nào? (Luận ngữ); ② Có: 其云益乎？ Như thế có ích không? (Tuân tử: Pháp hành); ③ Là, nói là (dùng như 是): 雖云匹夫，霸王可也 Tuy là kẻ thất phu (bình dân), nhưng cũng có thể xưng bá xưng vương (Hậu Hán thư); ④ Xoay chuyển: 晉不鄰矣，其誰云之！ Nước Tấn không là nước láng giềng thân thiện, thì ai xoay chuyển việc đó! (Tả truyện: Tương công nhị thập lục niên); ⑤ Như thế, như thế như thế, vân vân: 子之言雲，又焉用盟 Ông nói như thế, thì cần gì phải liên minh (Tả truyện). 【云云】vân vân a. Vân vân, như thế như thế: 他來信說最近讀了很多新書，很有收獲云云 Anh ấy viết thư về nói, dạo này đọc nhiều sách mới, thu hoạch rất nhiều v.v; 上曰：吾慾云云 Nhà vua nói: Ta muốn như thế như thế (Hán thư); b. (văn) Nhung nhúc: 夫物雲云云各歸其根 Kìa muôn vật nhung nhúc, mỗi vật đều trở về với gốc của mình (Lão tử); ⑥ Trợ từ ở đầu, giữa hoặc cuối câu (để tạo sự hài hoà cân xứng về ngữ khí, không dịch): 云何籲矣！ Buồn lo biết bao! (Thi Kinh); 日雲莫矣 Mặt trời đã lặn rồi (Tả truyện); 余登箕山，其上蓋有許由冢云 Ta lên núi Cơ, trên ấy dường như có mộ của Hứa Do (Sử kí); 聞其言，不見其人雲 Chỉ nghe tiếng nói, không trông thấy người (Sử kí). 【云胡】vân hồ (văn) Sao, vì sao (đặt trước vị ngữ để hỏi nguyên nhân): 既見君子，云胡不喜？ Đã trông thấy người quân tử, thì sao không vui mừng? (Thi Kinh); 有酒在尊，可以怡情，云胡不飲？ Có rượu trong chén, có thể khuây tình, vì sao không uống? (Thành Ý Bá văn tập). Như 雲"
  ],
  "grade": "9"
}