{
  "id": "仍",
  "kanjialiveData": null,
  "jishoData": {
    "query": "仍",
    "found": true,
    "strokeCount": 4,
    "meaning": "therefore, consequently",
    "kunyomi": [
      "よ.って",
      "しきりに",
      "なお",
      "よる"
    ],
    "onyomi": [
      "ジョウ",
      "ニョウ"
    ],
    "onyomiExamples": [
      {
        "example": "仍孫",
        "reading": "ジョウソン",
        "meaning": "seventh-generation descendant, great-great-great-great-great-grandchild"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "因って",
        "reading": "よって",
        "meaning": "therefore, consequently, accordingly, for that reason"
      }
    ],
    "radical": {
      "symbol": "人",
      "forms": [
        "亻"
      ],
      "meaning": "man, human"
    },
    "parts": [
      "ノ",
      "乃",
      "化"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/20173_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/04ecd.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/4ecd.gif",
    "uri": "https://jisho.org/search/%E4%BB%8D%23kanji"
  },
  "hanviet": [
    "nhưng"
  ],
  "vietnameseMeaning": [
    "① Như cũ, vẫn, như nhưng cựu 仍舊 như cũ. ② Luôn luôn, như cơ cận nhưng trăn 飢饉仍臻 kém đói luôn mãi. ① (pht) Vẫn, cứ, như cũ: 仍須努力 Vẫn phải cố gắng; 仍不動 Vẫn nằm yên bất động; 今大將軍仍復克獲 Nay đại tướng quân vẫn cứ đạt được thắng lợi liên tục (Hán thư). 【仍舊】 nhưng cựu (pht) Vẫn, cứ như thế, cứ như cũ: 意志仍舊那樣堅強 Ý chí vẫn bền vững như thường; 【仍然】 nhưng nhiên (pht) Vẫn: 這些規定仍然有效 Những quy định đó vẫn còn hiệu lực; ② (văn) (Vẫn) chiếu theo: 仍舊貫 Chiếu theo tập quán cũ (Luận ngữ); ③ (văn) Nên, rồi, vì thế mà (dùng trước động từ vị ngữ của đoạn câu sau, biểu thị một động tác được thực hiện tiếp theo một tình huống đã nêu ở phía trước): 及聞祖思死, 慟哭, 仍得病 Đến khi nghe Tổ Tư chết thì gào khóc thảm thiết, vì thế mà bị bệnh (rồi mang bệnh) (Nam sử); ④ (văn) Nhiều lần, liên tiếp: 晉仍無道而鮮胄, 其將失之矣 Tấn Lệ công nhiều lần làm việc vô đạo, lại thiếu đời sau nối dõi, chắc là sẽ mất ngôi (Quốc ngữ: Chu ngữ hạ); 災異婁降, 飢饉臻 Những việc tai hoạ và dị thường nhiều lần giáng xuống, nạn đói kém liên tiếp xảy ra (Hán thư: Cốc Vĩnh truyện); ⑤ (văn) Lại, lại còn, rồi lại: 風扉掩不定, 水鳥去仍回 Gió thổi cánh cửa không đóng lại được, con chim nước bay đi rồi lại trở về (Đỗ Phủ: Vũ)."
  ]
}