{
  "id": "侯",
  "kanjialiveData": null,
  "jishoData": {
    "query": "侯",
    "found": true,
    "taughtIn": "junior high",
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "2363",
    "strokeCount": 9,
    "meaning": "marquis, lord, daimyo",
    "kunyomi": [],
    "onyomi": [
      "コウ"
    ],
    "onyomiExamples": [
      {
        "example": "侯",
        "reading": "コウ",
        "meaning": "marquis, second highest rank of the five ranks of nobility, daimyo"
      },
      {
        "example": "候補",
        "reading": "コウホ",
        "meaning": "candidate, contender, prospect, pick, choice, list, candidacy, candidature, nomination"
      },
      {
        "example": "王侯",
        "reading": "オウコウ",
        "meaning": "the king and his feudal lords"
      },
      {
        "example": "仙台侯",
        "reading": "センダイコウ",
        "meaning": "Lord of Sendai"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "人",
      "forms": [
        "亻"
      ],
      "meaning": "man, human"
    },
    "parts": [
      "ユ",
      "乞",
      "化",
      "矢"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/20399_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/04faf.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/4faf.gif",
    "uri": "https://jisho.org/search/%E4%BE%AF%23kanji"
  },
  "hanviet": [
    "hầu",
    "hậu"
  ],
  "vietnameseMeaning": [
    "hậu ① Tước hầu. Các nhà đế vương đặt ra năm tước để phong cho bầy tôi, tước hầu là tước thứ hai trong năm tước. Ðời phong kiến, thiên tử phong họ hàng công thần ra làm vua các xứ, gọi là vua chư hầu, đời sau nhân thế, mượn làm tiếng gọi các quan sang, như quân hầu 君侯, ấp hầu 邑侯, v.v. ② Bui, dùng làm lời phát ngữ như chữ duy 唯. ③ Cái đích bắn, tấm vải căng dài mười thước, trong vẽ cái đích cho kẻ thi bắn, gọi là hầu, có khi viết là 矦. ① (cũ) Hầu (chủ của một nước thời xưa), tước hầu (thời phong kiến): 諸侯 Chư hầu; 封侯 Phong tước hầu; ② (văn) Cái đích để bắn tên (dùng cho người thi bắn thời xưa); ③ (văn) Ông, anh (đại từ nhân xưng ngôi thứ hai, dùng như 君 (bộ 口), để xưng hô giữa các sĩ đại phu thời xưa): 李侯有佳句 Anh Lý có làm được những câu thơ hay (Đỗ Phủ); ④ (văn) Sao, vì sao (dùng như 何 (bộ 亻) để hỏi về nguyên nhân): 君乎君乎，侯不邁哉？ Vua ơi vua ơi, vì sao không làm lễ phong thiện (tế núi sông)? (Sử kí: Tư Mã Tương Như liệt truyện); ⑤ (văn) Gì, nào (đặt trước danh từ): 法無限，則庶人田侯田，處侯宅？ Nếu pháp độ không rõ ràng thì nhân dân biết cày ruộng nào, ở nhà nào? (Pháp ngôn: Tiên tri); ⑥ (văn) Vì vậy mà, vậy nên, bèn: 上帝既命，侯于周服 Thượng đế đã ban mệnh xuống, (thì) nhà Ân Thương bèn quy phục nước Chu (Thi Kinh: Đại nhã, Văn vương); ⑦ (văn) Trợ từ ở đầu câu (dùng như 惟 (bộ 忄), 唯 (bộ 口), không dịch): 侯誰在矣？ Còn có ai ngồi trong bữa tiệc? (Thi Kinh: Tiểu nhã, Lục nguyệt); ⑧ (Họ) Hầu. Xem 侯 . ① (văn) Đẹp: 洵直且侯 Thật ngay thẳng mà lại đẹp nữa (Thi Kinh: Trịnh phong, Cao cừu); ② Tên huyện: 閩侯 Mân Hậu (ở tỉnh Phúc Kiến Trung Quốc). Xem 侯 ."
  ],
  "jlpt": "1",
  "frequency": "2363",
  "grade": "8"
}