{
  "id": "傳",
  "kanjialiveData": null,
  "jishoData": {
    "query": "傳",
    "found": true,
    "strokeCount": 13,
    "meaning": "summon, propagate, transmit",
    "kunyomi": [
      "つた.わる",
      "つた.える",
      "つた.う",
      "つて"
    ],
    "onyomi": [
      "テン",
      "デン"
    ],
    "onyomiExamples": [
      {
        "example": "伝承",
        "reading": "デンショウ",
        "meaning": "handing down (information), legend, tradition, folklore, transmission"
      },
      {
        "example": "伝播",
        "reading": "デンパ",
        "meaning": "transmission, propagation, spread, circulation, diffusion, dissemination"
      },
      {
        "example": "先哲像伝",
        "reading": "センテツゾウデン",
        "meaning": "pictures of ancient wise men (name of a book)"
      },
      {
        "example": "先哲像伝",
        "reading": "センテツゾウデン",
        "meaning": "Pictures of Ancient Wise Men"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "人",
      "forms": [
        "亻"
      ],
      "meaning": "man, human"
    },
    "parts": [
      "化",
      "十",
      "厶",
      "寸",
      "田"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/20659_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/050b3.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/50b3.gif",
    "uri": "https://jisho.org/search/%E5%82%B3%23kanji"
  },
  "hanviet": [
    "truyền"
  ],
  "vietnameseMeaning": [
    "① Truyền. Ðem của người này mà trao cho kẻ kia là truyền, như truyền vị 傳位 truyền ngôi, truyền đạo 傳道 truyền đạo, v.v. ② Sai người bảo, như truyền kiến 傳見 truyền cho vào yết kiến. ③ Một âm là truyện. Dạy bảo, như Xuân Thu Tả thị truyện 春秋左氏傳 họ Tả giải nghĩa kinh Xuân Thu để dạy bảo người. ④ Truyện kí, như Liệt nữ truyện 列女傳 truyện các gái hiền. ⑤ Một âm nữa là truyến, nhà trạm. Nhà để đưa kẻ đi, đón kẻ lại cũng gọi là truyến. Truyền (bá): 頻傳 Truyền tới dồn dập; 傳消息 Truyền tin; ② Truyền lại, trao cho: 傳球 Truyền bóng; 傳藝 Truyền nghề; ③ (luật) Gọi, đòi: 傳證人 Gọi người làm chứng; 傳見 Gọi vào yết kiến; ④ Dẫn: 傳熱 Dẫn nhiệt, truyền nhiệt; ⑤ Lây, truyền nhiễm: 這種病傳人 Bệnh này hay lây (truyền nhiễm); ⑥ Truyền thần, truyền cảm: 傳神之筆 Cây bút truyền thần; ⑦ Truyền (lại cho): 家傳祕方 Môn thuốc gia truyền; ⑧ (văn) Con dấu để làm tin, bằng chứng: 詐刻傳出關歸家 Khắc giả con dấu làm tin ra khỏi cửa ải về nhà (Hán thư: Ninh Thành truyện). Xem 傳 . ① Truyện (tác phẩm văn học, tiểu thuyết): 《水滸傳》Truyện Thuỷ hử; ② Truyện (sách giải thích kinh văn): 經傳 Kinh truyện; ③ Truyện kí, tiểu sử: 興道大王傳 Tiểu sử Hưng Đạo Đại Vương; 自傳 Tiểu sử, tự truyện; ④ (văn) Nhà trạm, nhà khách: 作義舍，如今之亭傳 Lập nhà khách miễn phí, giống như nhà trạm thời nay (Tam quốc chí); ⑤ (văn) Xe trạm (loại xe ngựa thời xưa dùng để truyền đạt mệnh lệnh): 遽傳不用 Không dùng xe trạm (Hàn Phi tử: Dụ lão); ⑥ (văn) Xe chở người cho phủ quan (thời xưa). Xem 傳 ."
  ],
  "grade": "10"
}