{
  "id": "其",
  "kanjialiveData": null,
  "jishoData": {
    "query": "其",
    "found": true,
    "newspaperFrequencyRank": "1930",
    "strokeCount": 8,
    "meaning": "that",
    "kunyomi": [
      "それ",
      "その"
    ],
    "onyomi": [
      "キ",
      "ギ",
      "ゴ"
    ],
    "onyomiExamples": [],
    "kunyomiExamples": [
      {
        "example": "其れ",
        "reading": "それ",
        "meaning": "that, it, then, that point (in time), that time, there, you"
      },
      {
        "example": "【それから】",
        "reading": "and then, after that",
        "meaning": ""
      },
      {
        "example": "其の",
        "reading": "その",
        "meaning": "that, the, part (as in \"part two\"), um ..., er ..., uh ..."
      },
      {
        "example": "その上",
        "reading": "そのうえ",
        "meaning": "in addition, furthermore, above (which), on top of (which)"
      }
    ],
    "radical": {
      "symbol": "八",
      "meaning": "eight"
    },
    "parts": [
      "ハ",
      "一",
      "甘"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/20854_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/05176.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/5176.gif",
    "uri": "https://jisho.org/search/%E5%85%B6%23kanji"
  },
  "hanviet": [
    "kì"
  ],
  "vietnameseMeaning": [
    "cơ, ki kì ① Thửa, lời nói chỉ vào chỗ nào, như kì nhân kì sự 其人其事 người ấy sự ấy. ② Một âm là kí, như bỉ kí chi tử 彼其之子 con người như thế kia. ③ Lại một âm là ki, lời nói đưa đẩy, như dạ như hà ki 夜如何其 đêm thế nào kia, đêm thế nào ư! (văn) Trợ từ cuối câu (vô nghĩa): 夜如何其？ Đêm thế nào rồi? (Thi Kinh: Tiểu nhã, Đình liệu). ① Người ấy, họ, nó, chúng (ngôi thứ ba): 不能任其搗亂 Không thể để mặc chúng quấy rối; 親之慾其貴也 Thân mến em thì muốn cho em (cho nó) được sang trọng (Mạnh tử); 鳥，吾知其能飛 Loài chim, ta biết nó biết bay (Sử kí); ② Của người ấy, của họ, của nó, của chúng: 周雖舊邦，其命維新 Nhà Chu tuy là nước cũ, nhưng mệnh của nó là mệnh mới (Thi Kinh); 回也，其心三月不違仁 Nhan Hồi, lòng của ông ta đến ba tháng cũng không trái với đức nhân; 樂，聽其音而知其俗 Nhạc, nghe âm của nó thì biết được tục của nó (Hoài Nam tử); ③ Đó, ấy, cái đó, cái ấy, việc đó: 今慾舉大事，將非其人不可 Nay muốn làm việc lớn, nếu không có người đó thì không thể được (Sử kí); 其時 Khi ấy, lúc ấy; 其後有了進步 Sau đó có sự tiến bộ; 促其早日實現 Thúc đẩy việc đó thực hiện cho sớm; ④ (văn) Của mình: 勿敗其志 Đừng làm hỏng chí mình; 各安其分 Mỗi người yên với số phận của mình; ⑤ (văn) Trong số đó (biểu thị sự liệt kê): 其一能鳴，其一不能鳴 Một con biết kêu, một con không biết kêu (Trang tử: Sơn mộc); ⑥ (văn) Nếu (biểu thị ý giả thiết): 其無知，悲不幾時 Nếu chết rồi mà không biết thì đau thương chẳng bao lâu (Hàn Dũ: Tế Thập Nhị lang văn); ⑦ (văn) Hay là (biểu thị ý chọn lựa): 秦誠愛趙乎？其實憎齊乎？ Tần thật yêu nước Triệu, hay là ghét nước Tề? (Sử kí); 丘也眩與，其信然與？ Ông Khổng Khâu bị hoa mắt rồi chăng, hay là thật như thế? (Trang tử); ⑧ (văn) Sẽ (biểu thị một tình huống sẽ xảy ra): 以殘年餘力，曾不能毀山之一毛，其如土石何？ Với sức tàn của ông, một cọng cỏ trên núi còn không huỷ đi được, thì đất đá kia sẽ dọn như thế nào? (Liệt tử: Thang vấn); 今殷其淪喪 Nay nhà Ân sẽ bị diệt vong (Thượng thư: Vi tử); ⑨ (văn) Há, làm sao (biểu thị ý phản vấn): 慾加之罪，其無辭乎？ Muốn đổ tội cho người, há chẳng có lời lẽ gì sao? (Tả truyện: Hi công thập niên); ⑩ (văn) Đại khái, có lẽ, e rằng (biểu thị ý suy trắc, ước đoán): 爲政者，其韓子乎？ Người nắm việc chính trị có lẽ là Hàn Khởi chăng? (Tả truyện: Tương công tam thập nhất niên); 若小人者，其不幸歟！ Như kẻ tiểu nhân tôi đây, có lẽ là (e là) điều bất hạnh ư! (Lưu Vũ Tích: Thượng Đỗ Tư đồ thư); ⑪ (văn) Hãy, mong hãy (biểu thị ý khuyến lệnh): 君其勿復言！ Mong ông hãy đừng nói nữa (Sử kí); 王參軍，人倫之表，汝其師之！ Vương Tham quân là người tiêu biểu cho đạo đức nhân luân, ngươi hãy coi ông ấy là thầy mình (Thế thuyết tân ngữ); 張儀曰：王其爲臣約車並幣，臣請試之！ Trương Nghi nói: Đại vương hãy vì tôi mà chuẩn bị xe cộ, bạc tiền, tôi xin thử tính việc đó cho đại vương! (Chiến quốc sách); ⑫ (văn) Còn, mà còn (thường đi chung với liên từ 況 biểu thị ý tăng tiến, hoặc phó từ 胡 biểu thị ý phản vấn): 覽椒蘭其若茲兮，又況揭車與江離！ Xem Tiêu Lan mà còn như thế, huống gì Yết Xa và Giang Li (Khuất Nguyên: Li tao); 天其弗識，人胡能覺？ Trời còn không biết, thì người làm sao cảm thấy được (Liệt tử: Dụng mệnh); ⑬ (văn) Trợ từ đầu câu (vô nghĩa): 其如是，孰能禦之？ Như thế, thì ai có thể chế ngự nó được? (Mạnh tử: Lương Huệ vương thượng); ⑭ (văn) Trợ từ giữa câu (vô nghĩa): 鳳縹縹其高逝兮 Con phượng đã nhẹ nhàng bay lên cao hề... (Hán thư: Giả Nghị truyện); 北風其涼 Ngọn gió bấc mát mẻ (Thi Kinh: Bội phong, Bắc phong); ⑮【其實】kì thực Thực ra, kì thực: 其實情況不是那樣 Thực ra tình hình không phải như thế; 這個問題似乎很難解決，其實并不難 Vấn đề này hình như rất khó giải quyết, kì thực chẳng khó gì cả."
  ],
  "frequency": "1930",
  "grade": "9"
}