{
  "id": "奔",
  "kanjialiveData": null,
  "jishoData": {
    "query": "奔",
    "found": true,
    "taughtIn": "junior high",
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "1884",
    "strokeCount": 8,
    "meaning": "run, bustle",
    "kunyomi": [
      "はし.る"
    ],
    "onyomi": [
      "ホン"
    ],
    "onyomiExamples": [
      {
        "example": "奔放",
        "reading": "ホンポウ",
        "meaning": "wild, uninhibited, extravagant, rampant"
      },
      {
        "example": "奔走",
        "reading": "ホンソウ",
        "meaning": "running about, making every effort (to do), busying oneself (with), being busily engaged (in), good offices, efforts"
      },
      {
        "example": "狂奔",
        "reading": "キョウホン",
        "meaning": "rushing around, running wild"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "走る",
        "reading": "はしる",
        "meaning": "to run, to run (of a vehicle), to drive, to travel, to move, to sail, to rush (to), to dash, to race, to retreat, to flee, to defect (to), to run away, to abscond, to elope, to flash (of lightning), to streak, to shoot (through; e.g. of pain), to run (through), to flare, to flit (e.g. across one's face), to spread quickly (of news, shock, etc.), to go (e.g. bad, to extremes), to become, to turn, to take to (e.g. crime), to get carried away by (e.g. one's emotions), to get involved in, to get wrapped up in, to run (through; of a road, street, etc.), to extend (e.g. of a mountain range), to stretch, to lie"
      }
    ],
    "radical": {
      "symbol": "大",
      "meaning": "big, very"
    },
    "parts": [
      "ノ",
      "一",
      "十",
      "大",
      "廾"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/22868_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/05954.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/5954.gif",
    "uri": "https://jisho.org/search/%E5%A5%94%23kanji"
  },
  "hanviet": [
    "bôn"
  ],
  "vietnameseMeaning": [
    "bôn ① Chạy vội. ② Làm việc hăm hở sợ thua người gọi là bôn xu 奔趨. ③ Ðánh trận thua chạy gọi là bôn. ④ Cưới xin không đủ lễ gọi là bôn. ① Đi vội, chạy, chạy trốn: 狂奔 Chạy bán sống bán chết; 飛奔 Chạy nhanh như bay; 東奔西跑 Chạy ngược chạy xuôi, chạy lăng xăng; ② (văn) Ngựa chạy nhanh; ③ (văn) (Con gái) bỏ theo trai (không làm lễ cưới): 文君夜亡奔相如 Trác Văn Quân ban đêm bỏ nhà trốn theo Tương Như (Sử kí); ④ (Họ) Bôn. Xem 奔 . ① Chạy về, tiến về, lao đến, cần đâu... có đó: 直奔工地 Tiến thẳng về công trường; 林沖就…直奔廟裡來 Lâm Xung bèn... chạy thẳng về phía ngôi miếu (Thuỷ hử truyện); ② Kiếm, chạy (vạy): 你們還缺什麼材料？我去奔 Các anh còn cần những vật liệu gì? Để tôi chạy cho; ③ Tuổi đã gần..., tuổi đã sắp...: 他是奔六十的人了 Ông ấy tuổi đã gần 60 rồi; 雖是我們年輕，…也奔四十歲的人了 Tụi tôi tuy trẻ, ... cũng gần bốn mươi tuổi rồi (Hồng lâu mộng). Xem 奔 ."
  ],
  "jlpt": "1",
  "frequency": "1884",
  "grade": "8"
}