{
  "id": "如",
  "kanjialiveData": null,
  "jishoData": {
    "query": "如",
    "found": true,
    "taughtIn": "junior high",
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "1704",
    "strokeCount": 6,
    "meaning": "likeness, like, such as, as if, better, best, equal",
    "kunyomi": [
      "ごと.し"
    ],
    "onyomi": [
      "ジョ",
      "ニョ"
    ],
    "onyomiExamples": [
      {
        "example": "如月",
        "reading": "キサラギ",
        "meaning": "second month of the lunar calendar, February"
      },
      {
        "example": "如雨露",
        "reading": "ジョウロ",
        "meaning": "watering can, watering pot, sprinkling can"
      },
      {
        "example": "躍如",
        "reading": "ヤクジョ",
        "meaning": "vivid, lifelike, graphic"
      },
      {
        "example": "鞠躬如",
        "reading": "キッキュウジョ",
        "meaning": "deferential, humble, reverent, respectful"
      },
      {
        "example": "如",
        "reading": "ニョ",
        "meaning": "tathata (the ultimate nature of all things)"
      },
      {
        "example": "如実",
        "reading": "ニョジツ",
        "meaning": "reality, actuality, actual conditions, true situation, faithful representation, vivid depiction, ultimate reality, absolute truth"
      },
      {
        "example": "一如",
        "reading": "イチニョ",
        "meaning": "oneness"
      },
      {
        "example": "形影一如",
        "reading": "ケイエイイチニョ",
        "meaning": "being inseparable as a form and its shadow, a person's deed mirrors the good or evil of his mind, husband and wife being never apart"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "如し",
        "reading": "ごとし",
        "meaning": "like, as if, the same as"
      }
    ],
    "radical": {
      "symbol": "女",
      "meaning": "woman, female"
    },
    "parts": [
      "口",
      "女"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/22914_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/05982.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/5982.gif",
    "uri": "https://jisho.org/search/%E5%A6%82%23kanji"
  },
  "hanviet": [
    "như"
  ],
  "vietnameseMeaning": [
    "① Bằng, cùng. Dùng để so sánh, như ái nhân như kỉ 愛人如己 yêu người như yêu mình. ② Dùng để hình dung, như tuân tuân như dã 恂恂如也 lù lù như thế vậy. ③ Lời nói ví thử, như như hữu dụng ngã giả 如有用我也 bằng có dùng ta. ④ Nài sao, như Khuông nhân kì như dư hà 匡人其如予何 người nước Khuông họ làm gì ta được ư! ⑤ Ði, như như Tề 如薺 đi sang nước Tề. ⑥ Nguyên như thế, trong kinh Phật cho rằng vẫn còn nguyên chân tính không nhiễm trần ai là như. ① Theo, theo đúng: 如期完成 Hoàn thành đúng kì hạn; 必如約 Phải theo đúng như đã giao ước; ② Như, giống như: 愛人如己 Thương người như thể thương thân; 堅強如鋼 Bền vững như thép. 【如…比】như ... tỉ (văn) Giống như: 一旦臨小利害，僅如毛髮比 Một khi gặp phải điều lợi hại nhỏ, thì chỉ giống như cọng lông sợi tóc mà thôi (Hàn Dũ: Liễu Tử Hậu mộ chí minh);【如此】như thử Như thế, như vậy: 如此勇敢 Gan dạ như thế; 當然如此 Tất nhiên là như vậy; 【如何】như hà a. Thế nào, ra sao: 近況如何 Tình hình gần đây ra sao; b. Vì sao, tại sao, cớ sao: 如何逆虜來侵犯？ Cớ sao bọn giặc đến xâm phạm? (Lí Thường Kiệt); 【如…何】như ... hà (văn) Làm sao đối với..., làm thế nào đối với...: 其如土石何？ Làm thế nào đối với đống đất đá kia? (Liệt tử: Thang vấn);【如 今】như kim (văn) Hiện nay: 如今人方爲刀俎，我爲魚肉 Nay người ta đang là dao là thớt, còn tôi là cá là thịt (Sử kí); 【如…然】như...nhiên (văn) Giống như: 人之視己，如見其肺肝然 Người ta trông mình như trông thấy gan phồi (Lễ kí);【如同】như đồng Như là, như thế, cũng như, giống như: 他如同啞巴一樣老不吭聲 Anh ta một câu cũng không nói như người câm vậy; 【如許】như hứa (văn) Như thế, đến thế (thường đặt trước hoặc sau hình dung từ để biểu thị mức độ): 郎君別後瘐如許，無乃從前作詩苦？ Lang quân sau ngày xa cách ốm o đến thế, có lẽ trước đây làm thơ khổ? (Tát Đô Thứ: Tương phùng hành tặng biệt cựu hữu Trị Tướng quân); 【如…焉】như ... yên (văn) Giống như (như 如…然 ): 君子之過也，如日月之食焉 Người quân tử phạm lỗi, cũng giống như nhật thực nguyệt thực (Luận ngữ); 【如之何】như chi hà (văn) Biết làm thế nào?: 吾慾攻虞，則郭救之，如之何？ Ta muốn đánh nước Ngu thì nước Quách sẽ cứu, biết làm thế nào? (Công Dương truyện); ③ Bằng: 我不如他 Tôi không bằng anh ấy; 自以爲不如 Tự cho là kém hơn (Chiến quốc sách); ④ (văn) Đến, đi, đi đến, sang, qua, đi qua (dùng như 之, nghĩa ⑪): 如廁 Đi nhà xí; 權將如吳 Tôn Quyền định qua nước Ngô (Tam quốc chí); 使使如秦受地 Sai sứ qua Tần nhận đất (Sử kí); ⑤ Nếu: 如不同意，可提意見 Nếu không đồng ý thì có thể nêu ý kiến; 如知其非義，斯速已矣，何待來年 Nếu biết đó là việc làm phi nghĩa, thì phải thôi ngay, sao phải đợi tới sang năm (Mạnh tử).【如果】như quả Nếu, nếu mà, nếu như, ví bằng: 如果有時間，我一定來 Nếu có thời gian nhất định tôi sẽ đến: 如果早知道一天，就來得及了 Nếu mà biết trước một hôm thì kịp đấy; 【如或】như hoặc (văn) Như 如使 ; 【如令】như lịnh (văn) Như 如使;【如其】như kì Nếu, nếu như, giá mà: 你如其不信，可以親自去問 Nếu anh không tin thì tự đi hỏi; 【如若】như nhược Giá mà, nếu như; 【如使】như sử (văn) Nếu, nếu như: 如使仁而不報，奚爲修善立名乎？ Nếu như lòng nhân mà không được báo đáp, thì người ta tu thân lập danh để làm gì? (Lưu Tuấn: Biện mệnh luận); 【如有】như hữu (văn) Như 如使; ⑥ (văn) Và: 公如大夫入 Công và đại phu bước vào (Nghi lễ); ⑦ (văn) Hoặc là, hay là: 方六七十，如五六十 Đất vuông sáu, bảy chục dặm, hay là năm, sáu chục dặm (Luận ngữ: Tiên tiến); ⑧ (văn) Theo, chiếu theo: 如實論之，殆虛言也 Nói theo thực tế, e là chuyện không có thật (Luận hoành); ⑨ (văn) Thì: 見利如前，乘便而起 Thấy có lợi thì tiến tới, thừa dịp tốt mà khởi binh (Diêm thiết luận); ⑩ (văn) Hình như, dường như: 丞相如有 驕主色 Thừa tướng hình như có vẻ kiêu ngạo đối với vua (Sử kí); ⑪ (văn) Nên, phải: 寡人如就見者也 Quả nhân vốn phải đến gặp ông (Mạnh tử: Công Tôn Sửu hạ); ⑫ Đặt sau từ chỉ trạng thái, để chỉ “một cách” (dùng như 然): 突如其來 Đến một cách đột ngột; 恂恂如也 Có vẻ tin cẩn thật thà; 天下晏如也 Thiên hạ yên yên ổn ổn (Sử kí)."
  ],
  "jlpt": "1",
  "frequency": "1704",
  "grade": "8"
}