{
  "id": "實",
  "kanjialiveData": null,
  "jishoData": {
    "query": "實",
    "found": true,
    "strokeCount": 14,
    "meaning": "truth, reality",
    "kunyomi": [
      "み",
      "みの.る",
      "まこと.に",
      "みの.り",
      "みち.る"
    ],
    "onyomi": [
      "ジツ",
      "シツ"
    ],
    "onyomiExamples": [
      {
        "example": "実に",
        "reading": "ジツニ",
        "meaning": "indeed, really, absolutely, truly, actually, very, quite"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "実に",
        "reading": "じつに",
        "meaning": "indeed, really, absolutely, truly, actually, very, quite"
      }
    ],
    "radical": {
      "symbol": "宀",
      "meaning": "roof"
    },
    "parts": [
      "ハ",
      "一",
      "宀",
      "田",
      "目",
      "貝"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/23526_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/05be6.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/5be6.gif",
    "uri": "https://jisho.org/search/%E5%AF%A6%23kanji"
  },
  "hanviet": [
    "thực"
  ],
  "vietnameseMeaning": [
    "① Giàu, đầy ních, như thân gia ân thật 身家殷實 mình nhà giàu có. ② Thật, cái gì thực có gọi là thật. Như thật tại 實在 thật còn, thật tình 實情 tình thật, v.v. ③ Chứng thực, như dĩ thật ngô ngôn 以實吾言 lấy chứng thực lời ta nói, nghĩa là tỏ rõ được lời mình nói không phải là ngoa. Vì thế nên có cái cớ gì để vin lấy mà nói gọi là khẩu thật 口實. ④ Sự tích, như nêu sự tích thực ra gọi là sự thật 事實. ⑥ Các phẩm vật. Trong sân nhà bầy la liệt các đồ gọi là đình thật 庭實, các đồ binh khí trong dinh quân gọi là quân thật 軍實. ① Đặc, đầy: 虛實 Hư thực, không và có, giả và thật; 實心的鐵球 Quả sắt đặc ruột (lõi đặc); 實足年齡 Tuổi thật; 殷實 Giàu có đầy đủ; ② Thực, thật, thật thà, thật là: 實心實意 Thật lòng thật dạ; 實話實說 Lời thực nói thẳng; 實在好 Thật là tốt; 老實人說老實話 Người thật nói thẳng; 我實不德 Ta thật không đó đức. 【實在】thực tại a. Thật, thật sự, thật là, thật tình: 這事我實在一點不知道 Việc này thật tôi không biết tí gì; b. Trên thực tế, thực ra (thật ra): 他說是 懂了，實在并不懂 Nó nói đã hiểu rồi, nhưng thực tế (thật ra) chả hiểu gì cả; ③ (văn) Chứng thực: 以實吾言 Để chứng thực lời tôi nói; ④ Sự thật, việc thật; ⑤ Quả, trái: 開花結實 Khai hoa kết quả; ⑥ (văn) Các phẩm vật, đồ đạc bày ra: 庭實 Đồ đạc bày la liệt trong sân nhà; 軍實 Binh khí trong dinh quân; ⑦ (văn) Xin, mong (biểu thị sự sai khiến hoặc khuyến cáo): 敢布腹心，君實圖之！Mạo muội nói điều nghĩ trong lòng, xin ngài tính cho (Tả truyện: Tuyên công thập nhị niên); ⑧ (văn) Trợ từ, đặt giữa tân ngữ ở trước với động từ ở sau, để đảo tân ngữ ra trước động từ: 鬼神非人實親，惟德是依 Quỷ thần chẳng phải thân gần với người nào, chỉ dựa theo đức hạnh (mà quyết định thân hay sơ) (Tả truyện: Hi công ngũ niên) (chữ 人 là tân ngữ, đưa ra trước động từ 親)."
  ],
  "grade": "10"
}