{
  "id": "將",
  "kanjialiveData": null,
  "jishoData": {
    "query": "將",
    "found": true,
    "strokeCount": 11,
    "meaning": "commander, general, admiral",
    "kunyomi": [
      "まさ.に",
      "はた",
      "ひきい.る",
      "もって"
    ],
    "onyomi": [
      "ショウ",
      "ソウ"
    ],
    "onyomiExamples": [
      {
        "example": "将校",
        "reading": "ショウコウ",
        "meaning": "commissioned officer"
      },
      {
        "example": "将来",
        "reading": "ショウライ",
        "meaning": "future, (future) prospects, bringing (from abroad, another region, etc.), bringing about, giving rise to, causing, incurring"
      },
      {
        "example": "王将",
        "reading": "オウショウ",
        "meaning": "king (of the senior player), Ōshō (one of the eight major titles in professional shogi)"
      },
      {
        "example": "玉将",
        "reading": "ギョクショウ",
        "meaning": "king (of the junior player)"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "寸",
      "meaning": "thumb, inch"
    },
    "parts": [
      "夕",
      "寸",
      "爿"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/23559_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/05c07.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/5c07.gif",
    "uri": "https://jisho.org/search/%E5%B0%87%23kanji"
  },
  "hanviet": [
    "tướng"
  ],
  "vietnameseMeaning": [
    "tương, tướng thương ① Sắp, sẽ, rồi mới. Như tương lai 將來 thời gian sắp tới, sau này. ② Cẩu thả, làm việc cẩu thả gọi là tương tựu 將就. ③ Nuôi, như bất hoàng tương phụ 不遑將父 chẳng rồi nuôi cha. Nay cũng gọi sự nghỉ ngơi là tương tức 將息. ④ Ðưa, như bách lạng tương chi 百兩將之 trăm cỗ xe đưa tiễn đấy. ⑤ Cầm, như tương tương nhi chí 相將而至 cùng cầm tay mà đến, nghĩa là cùng nhau cầm tay mà đều đi đến. ⑥ Tiến, như nhật tựu nguyệt tương 日就月將 ngày tới tháng tiến. ⑦ Bên. ⑧ Mạnh. ⑨ Dài. ⑩ Theo. ⑪ Một âm là thương. Xin. ⑫ Thương thương 將將 tiếng êm đềm, dáng nghiêm chỉnh. ⑬ Lại một âm là tướng. Ông tướng, như đại tướng 大將, tướng sĩ 將士, v.v. ⑭ Coi tất cả, như tướng trung quân 將中軍 cầm quyền thống xuất cả trung quân. ① Sắp, sẽ, ắt sẽ: 天將明 Trời sắp sáng; 公將戰 Công sắp đánh (Tả truyện); 大刑將至 Hình phạt tàn khốc ắt sẽ đến (Tả truyện). 【將近】tương cận Ngót, gần: 本村居民將近一百人 Dân làng ta ngót 100 người; 從這裡到他家將近十公里 Từ đây đến nhà anh ấy ngót 10 cây số; 【將要】tương yếu Sắp, sẽ: 他將要來北京 Anh ấy sắp đến Bắc Kinh; 他們不久將要畢業了 Không bao lâu nữa anh ấy sẽ tốt nghiệp; ② Vừa vặn: 將夠一個人吃 Vừa đủ một người ăn; 將一尺 Vừa vặn một thước; ③ Đem, mang, lấy: 將書拿來 Mang sách lại đây; 將功贖罪 Lấy công chuộc tội; 遂將三五少年輩，登高遠望形神開 Bèn mang theo năm ba đứa trẻ, lên cao nhìn ra xa tươi cười hớn hở (Lí Bạch); ④ Giới từ, thường dùng để đưa tân ngữ lên trước động từ, dùng như 把 : 將他請來 Mời anh ấy lại đây; 將門關上 Đóng cửa lại; 將計劃進行到底 Tiến hành kế hoạch đến cùng; 蘇秦始將連橫說秦惠王 Tô Tần lúc đầu đem chủ trương liên hoành thuyết phục Tần Huệ vương (Chiến quốc sách); ⑤ Chiếu (cờ tướng); ⑥ Khích, kháy: 只要拿話一將他，他就會干 Chỉ khích hắn một câu là hắn sẽ làm ngay; ⑦ (văn) Cẩu thả: 將就 Làm việc cẩu thả; ⑧ (văn) Nuôi: 不遑將父 Chẳng rỗi nuôi cha (Thi Kinh); ⑨ (văn) Đưa: 百輛將之 Trăm cỗ xe đưa tiễn nàng (Thi Kinh); ⑩ (văn) Cầm, đỡ: 將將而至 Cùng cầm tay nhau mà đến; ⑪ (văn) Tiến dần: 日就月將 Ngày tới tháng tiến (Thi Kinh); ⑫ (văn) Bên: 在渭之將 Ở bên sông Vị (Thi Kinh: Đại nhã, Hoàng hĩ); ⑬ (văn) Nhận: 將命于朝 Nhận mệnh tại triều (Nghi lễ); ⑭ (văn) Làm: 將事不敬 Làm việc không cung kính (Tả truyện); ⑮ (văn) Định, muốn: 君將哀而生之乎？ Ông muốn thương mà cứu sống tôi chăng? (Liễu Tôn Nguyên: Bổ xà giả thuyết); 將慾取天下而爲之 Định đem thiên hạ ra mà xoay xở sắp đặt lại (Lão tử); ⑯ (văn) Lớn, mạnh mẽ: 方將 Đang lớn mạnh lên; ⑰ (văn) 哀余命之不弗將 Thương cho mệnh ta chẳng được dài (Sở từ: Ai thời mệnh); ⑱ (văn) Chỉ: 將在德矣 Chỉ tại ở đức mà thôi (Tả truyện); ⑲ (văn) Mà là: 非以明民，將以愚之 Không để làm cho dân sáng ra, mà để làm cho dân ngu đi (Lão tử); ⑳ (văn) Còn, há, làm sao (để làm tăng ý phản vấn): 我退而楚還，我將何求？ Quân ta lui, quân Sở trở về, thì ta còn cầu gì nữa? (Tả truyện: Hi công nhị thập bát niên); 將非厚誣者乎？ Há chẳng phải là vu cáo và hãm hại quá nhiều ư? (Sử thông); ㉑ (văn) Chắc có lẽ, e rằng (biểu thị ý suy đoán): 今晉公子有三祚焉，天將啟之 Nay Tấn Công tử có ba điều phúc, có lẽ trời sẽ để cho ông ta hưng thịnh (Quốc ngữ); ㉒ (văn) Gần tới (về số lượng): 將五十里也 Gần năm mươi dặm (Mạnh tử); ㉓ (văn) Với: 眉將柳而爭綠 Lông mày tranh màu xanh với liễu (Dữu Tín: Xuân phú); ㉔ (văn) Thì, thế thì: 譬如群獸，一個負矣，將百群皆奔 Tỉ như bầy thú, một con bị trúng tên, thì trăm bầy đều trốn chạy (Quốc ngữ: Ngô ngữ); ㉕ (văn) Hoặc là, hay là (biểu thị sự chọn lựa): 先生將悖乎？將以爲楚國妖祥乎？ Tiên sinh lẩm cẩm quá ư? Hay cho đó là điềm gở của nước Sở? (Chiến quốc sách); ㉖ (văn) Nếu (biểu thị ý giả thiết): 令尹將必來辱，爲惠已甚 Lệnh doãn nếu thế nào cũng đến nhà tôi thì thật ân huệ cho tôi lắm (Tả truyện); ㉗ (văn) Trợ từ giữa câu (không dịch): 若生女者，輒持將去 Nếu sinh con gái, thì liền vứt bỏ đi ngay (Nhan thị gia huấn: Trì gia); ㉘ (Họ) Tương. Xem 將 . ① Tướng: 上將 Thượng tướng; 將領 Tướng lĩnh; ② Mang quân đi, chỉ huy: 將兵 Chỉ huy binh lính, cầm binh; ③ (văn) Vừa: 將恐將懼 Vừa lo vừa sợ (Thi Kinh: Tiểu nhã, Cốc phong); ④ (văn) Và, cùng: 暫伴月將影 Tạm làm bạn với trăng cùng bóng (Lí Bạch: Nguyệt hạ độc chước). Xem 將 . (văn) Mong, xin: 將子無怒 Xin anh đừng giận (Thi Kinh: Vệ phong, Manh)."
  ],
  "grade": "10"
}