{
  "id": "尸",
  "kanjialiveData": null,
  "jishoData": {
    "query": "尸",
    "found": true,
    "strokeCount": 3,
    "meaning": "corpse, remains, flag radical (no. 44)",
    "kunyomi": [
      "かたしろ"
    ],
    "onyomi": [
      "シ"
    ],
    "onyomiExamples": [
      {
        "example": "屍",
        "reading": "シカバネ",
        "meaning": "corpse, kanji \"corpse\" radical"
      },
      {
        "example": "尸位",
        "reading": "シイ",
        "meaning": "neglecting the duties of an office while taking pay"
      },
      {
        "example": "三尸",
        "reading": "サンシ",
        "meaning": "the three worms (in Taoism), worms that inhabit the human gut and, on the eve of the 57th day of the sexagenary cycle, ascend to heaven during one's sleep to report on one's wrongdoings"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "尸",
      "meaning": "corpse"
    },
    "parts": [
      "尸"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/23608_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/05c38.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/5c38.gif",
    "uri": "https://jisho.org/search/%E5%B0%B8%23kanji"
  },
  "hanviet": [
    "thi",
    "thây"
  ],
  "vietnameseMeaning": [
    "① Thần thi, ngày xưa cúng tế, dùng một đứa bé lên ngồi trên ngai để cho thần nương vào đấy gọi là thi, đời sau mới dùng tranh ảnh thay vào. ② Thây, người chết chưa chôn gọi là thi, kẻ sống mà không có tinh thần, tục mỉa là kẻ hành thi tẩu nhục 行尸走肉 thịt chạy thây đi. ③ Chủ, như kinh Thi nói thùy kì thi chi, hữu Tề quý nữ 誰其尸之有薺季女 ai thửa chủ việc cơm canh, có con gái út nước Tề. ④ Bầy, như Tả truyện chép Sở Vũ vương Kinh thi 楚武王荆尸 vua Sở Vũ-vương nước Sở dàn quân ở đất Kinh. ⑤ Ngồi không, không có ích gì cho cái ngôi chức của mình gọi là thi, như thi vị 尸位 ngôi hão, thi quan 尸官, quan thừa, v.v. ① Xác chết, thây (người chết), thi hài: 驗尸 Khám nghiệm xác chết; 行尸走肉 Xác thịt (cái xác) không hồn, giá áo túi cơm; ② (cũ) Thần thi (đứa bé thay mặt thần trong lúc cúng tế thời cổ); ③ (văn) Chủ (trông coi, phụ trách): 誰其尸之 Ai chủ việc đó (việc cơm canh) (Thi Kinh); ④ (văn) Bày ra, dàn ra: 楚武王荊尸 Vũ Vương nước Sở dàn quân ở đất Kinh (Tả truyện); ⑤ (văn) Như cái thây ma, hão, ngồi không, bù nhìn: 尸位 Ngôi vị hão; 尸官 Quan thừa."
  ]
}