{
  "id": "屬",
  "kanjialiveData": null,
  "jishoData": {
    "query": "屬",
    "found": true,
    "strokeCount": 21,
    "meaning": "genus, subordinate official, belong, affiliated",
    "kunyomi": [
      "さかん",
      "つく",
      "やから"
    ],
    "onyomi": [
      "ゾク",
      "ショク"
    ],
    "onyomiExamples": [
      {
        "example": "ヨモギ属",
        "reading": "ヨモギゾク",
        "meaning": "Artemisia (genus of plants containing mugworts, wormwoods, etc.)"
      },
      {
        "example": "卑属",
        "reading": "ヒゾク",
        "meaning": "lineal descendants"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "尸",
      "meaning": "corpse"
    },
    "parts": [
      "勹",
      "尸",
      "虫",
      "買"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/23660_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/05c6c.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/5c6c.gif",
    "uri": "https://jisho.org/search/%E5%B1%AC%23kanji"
  },
  "hanviet": [
    "thuộc"
  ],
  "vietnameseMeaning": [
    "① Liền, nối. Như quan cái tương chúc 冠蓋相屬 dù mũ cùng liền nối. ② Phó thác, dặn người làm giúp sự gì gọi là chúc. Tục dùng như chữ chúc 囑. ③ Ðầy đủ, như chúc yếm 屬厭 thoả thích lòng muốn. ④ Bám dính, như phụ chúc 附屬 phụ thuộc vào khoa nào. ⑤ Chuyên chú vào cái gì cũng gọi là chúc, như chúc ý 屬意 chú ý, chúc mục 屬目 chú mục, v.v. ⑥ Tổn tuất (thương giúp). ⑦ Một âm là thuộc. Thuộc về một dòng, như thân thuộc 親屬 kẻ thân thuộc, liêu thuộc 僚屬 kẻ làm việc cùng một toà. ⑧ Loài, lũ, bực. Như nhược thuộc 若屬 lũ ấy. ⑨ Chắp vá, như thuộc văn 屬文 chắp nối văn tự. ⑩ Vừa gặp, như hạ thần bất hạnh, thuộc đương nhung hàng 下臣不幸屬當戎行 kẻ hạ thần chẳng may, vừa phải ra hàng trận. Tục quen viết là 属. ⑪ Lại một âm là chú. Rót ra. ① Gia đình, thân thích: 家屬 Người nhà, thân thuộc, thân thích; 軍屬 Gia đình bộ đội; 烈屬 Gia đình liệt sĩ; ② Loại, loài, lũ, bọn: 金屬 Kim loại; 若屬 Bọn bây; 而養游俠私劍之屬 Mà nuôi dưỡng những loại du hiệp và võ sĩ riêng trong nhà (Hàn Phi tử); ③ Thuộc về: 直屬機關 Cơ quan trực thuộc; ④ Thuộc về của, của: 這本書屬你 Quyển sách này của anh; ⑤ Tuổi..., cầm tinh: 我是屬鼠的 Tôi tuổi Tí; 醜年生的人屬牛 Người tuổi sửu cầm tinh con trâu; ⑥ (văn) Vừa mới: 天下屬安定，何故反乎？ Thiên hạ vừa yên, sao lại làm phản? (Sử kí); ⑦ (văn) Chắp vá: 屬文 Chắp vá văn chương. Xem 屬 ① Gắn liền, liền, nối: 冠蓋相屬 Dù và mũ nối liền nhau; 前後相屬 Trước và sau gắn liền với nhau; ② Chuyên chú vào, chăm chú.【屬意】chúc ý Hướng vào, chăm chú vào, chú ý (người nào); ③ Phó thác, dặn dò (làm giúp việc gì) (dùng như 囑, bộ 口); ④ Đầy đủ: 囑厭 Thoả thích lòng muốn; ⑤ Tổn tuất, thương giúp. Xem 屬 ."
  ]
}