{
  "id": "已",
  "kanjialiveData": null,
  "jishoData": {
    "query": "已",
    "found": true,
    "newspaperFrequencyRank": "2140",
    "strokeCount": 3,
    "meaning": "stop, halt, previously, already, long ago",
    "kunyomi": [
      "や.む",
      "すで.に",
      "のみ",
      "はなはだ"
    ],
    "onyomi": [
      "イ"
    ],
    "onyomiExamples": [
      {
        "example": "以降",
        "reading": "イコウ",
        "meaning": "on and after, from ... onward, since"
      },
      {
        "example": "以下",
        "reading": "イカ",
        "meaning": "not exceeding ..., not more than ..., ... and under, ... and below, ... or fewer, below (a standard, level, etc.), under, beneath, less than, the following, the below-mentioned, the rest, followed by ..., including ..., ... and other (employees, officials, etc.)"
      },
      {
        "example": "生滅滅已",
        "reading": "ショウメツメツイ",
        "meaning": "going beyond life and death and entering Nirvana"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "止む",
        "reading": "やむ",
        "meaning": "to cease, to stop, to be over"
      },
      {
        "example": "やむを得ない",
        "reading": "やむをえない",
        "meaning": "cannot be helped, unavoidable"
      },
      {
        "example": "既に",
        "reading": "すでに",
        "meaning": "already, previously, before, undeniably, unmistakably, in the first place"
      }
    ],
    "radical": {
      "symbol": "己",
      "forms": [
        "巳",
        "已",
        "㔾"
      ],
      "meaning": "oneself"
    },
    "parts": [
      "已"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/24050_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/05df2.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/5df2.gif",
    "uri": "https://jisho.org/search/%E5%B7%B2%23kanji"
  },
  "hanviet": [
    "dĩ"
  ],
  "vietnameseMeaning": [
    "① Thôi, như nghiêu nghiêu bất dĩ 蹺蹺不已 nhai nhải chẳng thôi, nghĩa là cứ nói dai mãi. ② Bỏ, bãi quan, gọi tắt là dĩ. ③ Quá, như bất vi dĩ thậm 不為已甚 chẳng là quá lắm ư? ④ Lời nói sự đã qua, như dĩ nhiên 已然 đã rồi, dĩ nhi 已而 đã mà, v.v. ⑤ Lời nói hết, như mạt do dã dĩ 末由也已 chẳng biết noi đâu nữa vậy thôi. ⑥ Ngày xưa hay dùng như chữ dĩ 以. ① Đã, rồi: 爲時已晚 Đã muộn rồi; 舟已行矣 Thuyền đã đi rồi (Lã thị Xuân thu). 【已經】dĩ kinh Đã, rồi: 已經勝利 Đã thắng lợi; 這樣已經不錯了 Như thế đã khá lắm rồi; ② Ngừng, ngớt, thôi: 爭論不已 Tranh luận không ngừng (ngớt); ③ (văn) Quá, lắm, rất: 不爲已甚 Không là quá đáng; 昊天已威 Trời rất uy nghiêm (Thi Kinh); ④ (văn) Rồi, chẳng bao lâu: 韓王成無軍功，項王不使之國，與俱至彭城，廢以爲侯，已又殺之 Hàn Vương Thành không có quân công, Hạng Vương không để cho ông ta trở về nước mình, (mà) cùng đi với ông ta tới Bành Thành, truất xuống tước hầu, rồi lại giết đi (Sử kí: Hạng Vũ bản kỉ); ⑤ (văn) (thán) Ờ: 已！予惟小子，不敢替上帝命 Ờ! Ta là con của Văn Vương, đâu dám bỏ lệnh của vua trời (Thượng thư: Đại cáo); ⑥ (văn) Như 以 nghĩa ㉓: 准北，常山已南 Hoài Bắc, Thường Sơn trở về phía Nam (Sử kí); 已上 Trở lên; ⑦ (văn) Trợ từ cuối câu (biểu thị nghi vấn hoặc cảm thán): 公定予往已 Ngài ở lại, tôi về đi thôi (Thượng thư); 若是，則汝何爲驚已？ Như thế thì tại sao ông sợ hãi? (Trang tử); ⑧ (văn) Trợ từ, dùng chung với 也，矣 thành 也已，已矣, biểu thị ý xác định hoặc cảm thán. 【已矣】dĩ hĩ (văn) Thôi vậy (biểu thị ý xác định): 賜也，始可與言詩已矣 Chỉ có trò Tứ (Tử Cống) mới có thể cùng ta nói chuyện về Thi (Kinh Thi) thôi vậy (Luận ngữ). Xem 也已."
  ],
  "frequency": "2140",
  "grade": "9"
}