{
  "id": "帖",
  "kanjialiveData": null,
  "jishoData": {
    "query": "帖",
    "found": true,
    "newspaperFrequencyRank": "2208",
    "strokeCount": 8,
    "meaning": "quire (of paper), bundle of seaweed, counter for screens, notebook",
    "kunyomi": [
      "かきもの"
    ],
    "onyomi": [
      "チョウ",
      "ジョウ"
    ],
    "onyomiExamples": [
      {
        "example": "帖合",
        "reading": "チョウアイ",
        "meaning": "type of commission system in the book industry in Japan"
      },
      {
        "example": "捕物帳",
        "reading": "トリモノチョウ",
        "meaning": "detective story (esp. one from the Edo period featuring thief-takers), detective's memoirs, thief taker's memoirs"
      },
      {
        "example": "写生帖",
        "reading": "シャセイチョウ",
        "meaning": "sketchbook"
      },
      {
        "example": "帖",
        "reading": "ジョウ",
        "meaning": "folding book, counter for units of paper and nori (48 pages of Mino paper; 20 pages of hanshi; 10 sheets of nori), counter for folding books, folding screens, shields, etc., counter for pairs (of curtains), counter for tatami mats"
      },
      {
        "example": "法帖",
        "reading": "ホウジョウ",
        "meaning": "copybook printed from the works of old masters of calligraphy"
      },
      {
        "example": "画帖",
        "reading": "ガジョウ",
        "meaning": "picture album"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "巾",
      "meaning": "turban, scarf"
    },
    "parts": [
      "卜",
      "口",
      "巾"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/24086_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/05e16.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/5e16.gif",
    "uri": "https://jisho.org/search/%E5%B8%96%23kanji"
  },
  "hanviet": [
    "thiếp"
  ],
  "vietnameseMeaning": [
    "① Lấy lụa viết chữ vào lụa. Ðời xưa chưa có giấy, phải viết vào lụa gọi là thiếp. Ðời sau viết vào giấy cũng gọi là thiếp, như xuân thiếp 春帖 câu đối tết, phủ thiếp 府帖 dấu hiệu làm tin trong quan tràng, giản thiếp 柬帖 cái danh thiếp, nê kim thiếp tử 泥金帖子 cái đơn hàng hay nhãn hiệu xoa kim nhũ, v.v. ② Cái thiếp khắc chữ vào đá gọi là bia, rập lấy chữ ở bia ra gọi là thiếp. Những bản chữ của cổ nhân hay xin các người chữ tốt viết cho để tập gọi là thiếp. ③ Ðời Ðường, Tống cứ trong cả bài văn trích ra mấy câu để thi học trò gọi là thiếp, cho nên những văn thơ để dùng vào thi cử gọi là thí thiếp 試帖. ④ Yên định, như thoả thiếp 妥帖, xong xuôi cả, phục tòng cũng gọi là thiếp phục 帖服 nghĩa là chịu theo mệnh lệnh cả. ① Thoả đáng: 妥帖 Ổn thoả; ② Ngoan ngoãn, nghe theo: 帖伏 Cúi đầu nghe theo, ngoan ngoãn vâng theo; 帖服 Quy phục, thuận phục, thuận theo; 俯首帖耳 Ngoan ngoãn thuận phục, cúi đầu nghe theo; ③ (Họ) Thiếp. Xem 帖 , . ① Mảnh giấy (hoặc lụa) nhỏ có viết chữ: 字帖兒 Mảnh giấy ghi những lời vắn tắt; ② Thiếp (mời), giấy (mời): 請帖 Giấy mời, thiếp mời; 憑帖入場 Xin mang theo giấy mời; ③ Thang: 一葯 Một thang thuốc; ④ Đoạn văn trích để làm bài thi (thời xưa): 試帖 Văn thơ dùng trong việc thi cử. Xem 帖 , . Bản phỏng dùng để tập viết chữ: 字帖 Bản viết phỏng. Xem 貼 , ."
  ],
  "frequency": "2208",
  "grade": "9"
}