{
  "id": "帶",
  "kanjialiveData": null,
  "jishoData": {
    "query": "帶",
    "found": true,
    "strokeCount": 11,
    "meaning": "belt, girdle, band, strap, zone",
    "kunyomi": [
      "お.びる",
      "おび"
    ],
    "onyomi": [
      "タイ"
    ],
    "onyomiExamples": [],
    "kunyomiExamples": [
      {
        "example": "帯",
        "reading": "おび",
        "meaning": "obi (kimono sash), obi (strip of paper looped around a book, CD, etc. containing information about the product), band, belt, strip, cingulum, radio or television program broadcast in the same time slot on all or most days"
      }
    ],
    "radical": {
      "symbol": "巾",
      "meaning": "turban, scarf"
    },
    "parts": [
      "一",
      "儿",
      "冖",
      "凵",
      "巾"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/24118_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/05e36.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/5e36.gif",
    "uri": "https://jisho.org/search/%E5%B8%B6%23kanji"
  },
  "hanviet": [
    "đai"
  ],
  "vietnameseMeaning": [
    "đái, đới ① Giải áo, cái đai. ② Ðeo, như đái đao 帶刀 đeo dao, đái kiếm 帶劍 đeo gươm, v.v. ③ Mang theo, như đái lĩnh 帶領, huề đái 擕帶 đều nghĩa mang dắt theo cả. ④ Giải đất, tiếng dùng để chia khí hậu quả đất, như ôn đái 溫帶 giải đất ấm, hàn đái 寒帶 giải đất rét, v.v. ① Dây, dải áo, đai, thắt lưng, băng: 皮帶 Dây da, dây curoa; 腰帶 Thắt lưng; 錄音帶 Băng ghi âm; ② Săm, lốp, săm lốp: 内帶 Săm; 外帶 Lốp; 自行車帶 Săm lốp xe đạp; ③ Dải đất, vùng, miền, xứ, đới: 熱帶 Xứ nóng, nhiệt đới; 北極帶 Miền Bắc cực; 我們這一帶主要是生產棉花 Vùng chúng tôi đây chủ yếu là sản xuất bông; ④ Bệnh khí hư. 【帶下】đới hạ (y) Bệnh khí hư; ⑤ Đeo, đèo, quàng, thắt, khoác, mang theo, đem theo: 帶劍 Đeo gươm, mang gươm; 騎自行車不要帶人 Đi xe đạp không nên đèo người; 帶紅領巾 Quàng khăn đỏ; 每位旅客可帶二十公斤行李 Mỗi hành khách có thể mang theo 20 kilôgam hành lí; 我沒有帶錢 Tôi không có đem tiền theo; ⑥ Mua hộ, (tiện tay) đóng (cửa) hộ, nhắn tin, gởi lời: 你上街請給我帶一份報紙 Anh ra phố thì mua hộ cho tôi tờ báo; 請把門帶上 (Tiện tay) xin đóng cửa hộ; 給家裡帶個口信 Nhắn tin về nhà; ⑦ Có vẻ, có mang theo, có kèm, vừa... vừa...: 面帶笑容 Mặt (có vẻ) tươi cười; 帶有時代的特色 Có mang những điểm đặc sắc của thời đại; ⑧ Kèm thêm, kèm theo: 玉米地裡帶着種點黃豆 Trong ruộng ngô (bắp) trồng kèm thêm một ít đậu nành; 這茶杯是帶蓋子的 Cốc này có (kèm theo) nắp; 他連說帶笑地走進來 Anh ấy vừa nói vừa cười bước vào; ⑨ Dìu dắt, dạy bảo, hướng dẫn, đưa (đường), cầm, kèm, kèm cặp: 老師傅帶徒弟 Thợ cả kèm cặp người học nghề; 你帶我們走吧 Anh đưa chúng tôi đi; 帶兵 Cầm quân; ⑩ Nuôi (dạy), trông nom, săn sóc: 帶孩子 Nuôi con, trông nom con; 他是這位大娘帶大的 Nó được bà cụ này nuôi dạy đến lớn."
  ],
  "grade": "10"
}