{
  "id": "從",
  "kanjialiveData": null,
  "jishoData": {
    "query": "從",
    "found": true,
    "strokeCount": 11,
    "meaning": "from, by, since, whence, through",
    "kunyomi": [
      "したが.う",
      "したが.える",
      "より"
    ],
    "onyomi": [
      "ジュウ",
      "ショウ",
      "ジュ"
    ],
    "onyomiExamples": [
      {
        "example": "従来農法",
        "reading": "ジュウライノウホウ",
        "meaning": "traditional farming"
      },
      {
        "example": "従来農法",
        "reading": "ジュウライノウホウ",
        "meaning": "traditional farming"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "従う",
        "reading": "したがう",
        "meaning": "to obey (an order, law, etc.), to abide by (a rule, custom, etc.), to follow, to observe, to conform to, to yield to, to follow (a person), to accompany, to go with, to go alongside (e.g. a river), to follow (e.g. a sign), to serve (as), to engage in (work)"
      }
    ],
    "radical": {
      "symbol": "彳",
      "meaning": "step"
    },
    "parts": [
      "人",
      "彳",
      "疋"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/24478_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/05f9e.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/5f9e.gif",
    "uri": "https://jisho.org/search/%E5%BE%9E%23kanji"
  },
  "hanviet": [
    "tòng"
  ],
  "vietnameseMeaning": [
    "① Theo. Như tòng nhất nhi chung 從一而終 theo một bề đến chết. ② Từ đâu ra. Như tòng hà thuyết khởi 從何說 起 từ đâu mà nói lên? ③ Nghe theo. Như tòng gián như lưu 從諫如流 nghe lời can như nước chảy. ④ Tới, đặt mình vào đấy gọi là tòng. Như tòng chánh 從政 làm việc chánh trị. ⑤ Một âm là tụng. Theo hầu. Như thị tụng 視從 theo hầu, bộc tụng 僕從 kẻ hầu. ⑥ Thứ. Bực kém hàng chí thân gọi là tụng. Như chú bác gọi là tụng phụ 從父, cháu đối với chú bác gọi là tụng tử 從子, anh em cùng một ông bà gọi là tụng huynh đệ 從兄弟, anh em chú bác hai đời gọi là tái tụng 再從, ba đời gọi là tam tụng 三從. ⑦ Về hình luật có thủ phạm 首犯, tụng phạm 從犯. Kẻ chủ mưu gọi là thủ phạm, kẻ a dua gọi là tụng phạm. ⑧ Về quan chế cũng chia ra chánh với tụng, chức tụng cũng như chức phó. ⑨ Lại một âm là thung. Như thung dong 從容 thong thả dẽ dàng. ⑩ Lại một âm nữa là túng. Cũng như chữ túng 縱. ⑪ Lại một âm là tung. Cùng nghĩa với chữ tung 縱. Ðông tây gọi là hành 衡, nam bắc gọi là tung 從. 【從容】thung dung ① Thung dung, ung dung, thong dong, điềm đạm, khoan thai, từ tốn, ôn tồn: 鯈魚出遊從容，是魚樂也 Cá du lội ra chơi thong thả, đó là niềm vui của cá (Trang tử); 從容撤退 Ung dung rút lui; 舉止從容 Cử chỉ khoan thai; 從容地談話 Nói năng ôn tồn; ② Rộng rãi, dư dật, dễ chịu: 生活從容 Cuộc sống dễ chịu; 手頭從容 Tiền nong rộng rãi; 時間很從容 Còn nhiều thì giờ lắm. Xem 從 . ① Theo, đi theo: 從父赴京 Theo cha về Kinh; 擇善而從 Chọn người tốt mà theo; 從一而終 Theo một bề cho đến chết; ② Tuân theo, nghe theo: 服從領導 Phục tùng lãnh đạo; 力不從心 Lực bất tòng tâm, sức chẳng theo lòng; 從諫如流 Nghe lời can như nước chảy; ③ Tham gia, làm: 從政 Làm việc chính trị; 從軍 Tòng quân, tham gia quân đội, đi bộ đội; 從公 Làm việc công; 從事 Làm...; ④ Theo cách (đặt trước một tính từ chỉ nguyên tắc): 從速解決 Giải quyết nhanh chóng; 批評從嚴，處理從寬 Phê bình nghiêm khắc, xét xử khoan hồng; ⑤ Người đi theo, tùy tùng; 隨從人員 Những người đi theo, nhân viên tùy tùng; 僕從 Tay sai; ⑥ (Bà con) họ: 從兄 Anh họ; 從叔 Chú họ; ⑦ Thứ yếu, phụ (thuộc), phó: 主從 Chủ yếu và thứ yếu, cái chính và cái phụ; 從屬地位 Địa vị phụ thuộc; 從父 Chú bác (kém thân hơn cha); 從子 Cháu của chú bác (kém thân hơn con ruột); 從兄弟 Anh em cùng ông bà (kém thân hơn anh em ruột); 再從 Anh em chú bác hai đời; 三從 Anh em chú bác ba đời; 從犯 Kẻ a dua phạm tội; ⑧ (gt) Từ: 從家裡到學校 Từ nhà đến trường; 從東往西 Từ đông sang tây; 我從上海來 Tôi từ Thượng Hải đến; 從無到有 Từ không đến có; 從此以後 Từ nay về sau; 從工作中吸取經驗教訓 Từ trong công tác rút lấy bài học kinh nghiệm.【從此】tòng thử Từ rày, từ đó: 從此以後 Từ rày trở đi, từ đó về sau; 從此戎衣屬武臣 Áo nhung trao quan vũ từ đây (Chinh phụ ngâm khúc); ⑨ (gt) Qua: 小火輪每天兩次從這裡駛過 Chiếc tàu mỗi ngày hai lần chạy qua chỗ này; 從門縫裡往外看 Nhìn qua khe cửa; ⑩ (pht) Trước nay, từ trước đến nay: 從沒有聽說過 Trước nay chưa hề nghe qua; 這個廠從不生產次品 Xưởng này từ trước đến nay chưa từng sản xuất sản phẩm kém chất lượng; 從未有過 Từ trước đến nay chưa hề có. 【從而】tòng nhi a. Rồi lại: 使自得之，又從而振德之 Làm cho họ đều đạt đúng cái của họ, rồi lại nâng cao phẩm đức của họ (Mạnh tử); b. Do đó, vì vậy, vì thế, nhân đó mà: 湯，武存，則天下從而治 Vua Thang vua Vũ còn thì thiên hạ nhân đó mà được trị (Tuân tử: Vinh nhục);【從來】 tòng lai Từ trước đến nay, từ trước đến giờ: 他從來不失信 Từ trước đến nay, anh ấy không bao giờ thất tín (sai hẹn); 【從是】 tòng thị (văn) Từ đó (như 從此 ): 從是以後不敢復言爲河伯娶婦 Từ đó về sau không dám nói chuyện lấy vợ cho Hà Bá nữa (Sử kí); 【從新】tòng tân (Làm) lại: 從新規定 Đặt lại, quy định lại; ⑪ (Họ) Tòng, Tùng. Xem 從 ."
  ],
  "grade": "10"
}