{
  "id": "微",
  "kanjialiveData": null,
  "jishoData": {
    "query": "微",
    "found": true,
    "taughtIn": "junior high",
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "1108",
    "strokeCount": 13,
    "meaning": "delicate, minuteness, insignificance",
    "kunyomi": [
      "かす.か"
    ],
    "onyomi": [
      "ビ"
    ],
    "onyomiExamples": [
      {
        "example": "微",
        "reading": "ビ",
        "meaning": "minuteness, one millionth"
      },
      {
        "example": "微細",
        "reading": "ビサイ",
        "meaning": "minute, fine, detailed, subtle"
      },
      {
        "example": "細微",
        "reading": "サイビ",
        "meaning": "minute, meager, meagre, mean"
      },
      {
        "example": "翠微",
        "reading": "スイビ",
        "meaning": "approx. 80% of the way up a mountainside, view of a light green mountain, mountain that appears green from afar"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "微か",
        "reading": "かすか",
        "meaning": "faint, dim, weak, slight, vague, indistinct, hazy, poor, wretched, meagre, meager, scanty"
      }
    ],
    "radical": {
      "symbol": "彳",
      "meaning": "step"
    },
    "parts": [
      "乞",
      "山",
      "彳",
      "攵"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/24494_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/05fae.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/5fae.gif",
    "uri": "https://jisho.org/search/%E5%BE%AE%23kanji"
  },
  "hanviet": [
    "vi"
  ],
  "vietnameseMeaning": [
    "① Mầu nhiệm. Như tinh vi 精微, vi diệu 微妙 nghĩa là tinh tế mầu nhiệm không thể nghĩ bàn được. ② Nhỏ, như vi tội 微罪 tội nhỏ, vi lễ 微禮 lễ mọn. ③ Suy. Như thức vi 式微 suy quá. ④ Ẩn, dấu không cho người biết gọi là vi, như vi phục 微服 đổi lốt áo xấu không cho ai biết mình, vi hành 微行 đi lẻn, v.v. ⑤ Chẳng phải, không. Như vi Quản Trọng ngô kì bỉ phát tả nhẫm hĩ 微管仲吾其彼髮左衽矣 không ông Quản Trọng ta tất bị búi tóc mặc áo trái vạt vậy. ① Nhỏ, bé, nhẹ, mọn, vi: 細微 Nhỏ bé, nhỏ nhắn; 微風 Gió nhẹ; 微罪 Tội nhỏ; 微禮 Lễ mọn; 顯微鏡 Kính hiển vi; 微乎其微 Bé tí ti, ít ỏi; ② Vi diệu, mầu nhiệm tinh tế: 精微 Tinh vi; 微妙 Vi diệu, tinh tế mầu nhiệm; ③ Giấu không cho biết, ẩn, bí mật: 微服 Mặc đồ xấu để không ai biết mình; 微行 Đi lén; 嘗以中山之謀微告趙王 Từng đem mưu kế của vua Trung Sơn bí mật báo cho Triệu vương biết (Hàn Phi tử); ④ (văn) Suy kém, suy vi: 式微 Suy quá rồi (Thi Kinh); ⑤ (văn) Chẳng phải, không, nếu không có: 微與之期 Không hẹn đánh với quân địch (Tôn tử binh pháp: Cửu địa); 雖讀禮傳，微愛屬文 Tuy đã đọc qua phần truyện của kinh Lễ, song vẫn không thích làm văn (Nhan thị gia huấn: Tự trí); 微管仲吾其被髮左衽矣 Nếu không có ông Quản Trọng thì bọn ta đã phải bị búi tóc và mặc áo trái vạt (như mọi rợ) rồi (Luận ngữ); ⑥ Ít, khá, nhẹ, hơi: 微感不適 Thấy trong người hơi khó chịu; 肅弟秉正，字文正，涉獵書史，微有兄風 Em của Vương Túc là Vương Bỉnh, tự là Văn Chính, rành rẽ việc kinh sử, hơi có phong độ của anh (Nguỵ thư: Vương Đương Túc truyện); 以小杖微打之 Dùng gậy nhỏ đánh nhẹ một cái (Tề dân yếu thuật); ⑦ Sút, sụt xuống: 衰微 Suy sụp; ⑧ Micrô, một phần triệu: 微米 Micrômet ( ); 微秒 Micrô giây."
  ],
  "jlpt": "1",
  "frequency": "1108",
  "grade": "8"
}