{
  "id": "惡",
  "kanjialiveData": null,
  "jishoData": {
    "query": "惡",
    "found": true,
    "strokeCount": 12,
    "meaning": "bad, evil",
    "kunyomi": [
      "わる.い",
      "あ.し",
      "にく.い",
      "ああ",
      "いずくに",
      "いずくんぞ",
      "にく.む"
    ],
    "onyomi": [
      "アク",
      "オ"
    ],
    "onyomiExamples": [
      {
        "example": "悪",
        "reading": "アク",
        "meaning": "evil, wickedness, (role of) the villain (in theatre, etc.), the bad guy"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "悪い",
        "reading": "わるい",
        "meaning": "bad, poor, undesirable, poor (quality), inferior, insufficient, evil, sinful, ugly, not beautiful, at fault, to blame, in the wrong, bad (at doing something), unprofitable, unbeneficial, sorry, (my) bad, unforgivable"
      }
    ],
    "radical": {
      "symbol": "心",
      "forms": [
        "忄",
        "⺗"
      ],
      "meaning": "heart"
    },
    "parts": [
      "一",
      "二",
      "心"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/24801_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/060e1.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/60e1.gif",
    "uri": "https://jisho.org/search/%E6%83%A1%23kanji"
  },
  "hanviet": [
    "ác"
  ],
  "vietnameseMeaning": [
    "ác ô ố ① Ác. ② Xấu. Như ác tướng 惡相 tướng xấu, ác thanh 惡聲 tiếng xấu, v.v. ③ Một âm là ố. Ghét. Khả ố 可惡 đáng ghét. ④ Xấu hổ. Như tu ố chi tâm 羞惡之心 chưng lòng hổ thẹn. ⑤ Một âm là ô. Sao thế? Ồ, như ô thị hà ngôn dã 惡是何言也 ồ, thế là lời nói gì vậy? 【噁心】ố tâm ① Buồn nôn; ② Sinh ra chán ghét. Xem 惡 , . ① Tội ác, tội lỗi: 無惡不作 Không chừa một tội ác nào; 罪大惡極 Tộc ác tày trời; ② Ác, dữ: 惡霸 Ác bá; 一場惡戰 Một trận ác chiến; ③ Xấu: 惡習 Tật xấu; 惡聲 Tiếng xấu; 惡意 Ý xấu; 惡勢力 Thế lực xấu. Xem 惡 , . (văn) ① Ở đâu, nơi nào? (đại từ nghi vấn): 路惡在？ Đường ở nơi nào? (Mạnh tử); ② Từ đâu, ở chỗ nào? (thường dùng 惡乎): 且王攻楚，將惡出兵？ Vả lại nếu nhà vua đánh Sở thì định xuất binh từ đâu? (Sử kí); 學惡乎始，惡乎終？ Sự học bắt đầu từ chỗ nào, chấm dứt chỗ nào? (Tuân tử); ③ Làm sao? (đại từ biểu thị sự phản vấn): 爾幼，惡識國？ Ngươi còn nhỏ, làm sao hiểu được việc nước? (Tả truyện); 子不能治子之身，惡能治國政？ Ông không lo được cho thân ông, làm sao lo được việc nước? (Mặc tử); ④ Ô, ồ! (thán từ): 惡，言是何言也！ Ồ, ấy là nói thế nào! (Mạnh tử). Ghét, căm ghét: 可惡 Đáng ghét; 深惡痛絕 Ghét cay ghét đắng. Xem 惡 , ."
  ],
  "grade": "10"
}