{
  "id": "應",
  "kanjialiveData": null,
  "jishoData": {
    "query": "應",
    "found": true,
    "strokeCount": 17,
    "meaning": "answer, yes, OK, reply, accept",
    "kunyomi": [
      "あた.る",
      "まさに",
      "こた.える"
    ],
    "onyomi": [
      "オウ",
      "ヨウ"
    ],
    "onyomiExamples": [
      {
        "example": "応需",
        "reading": "オウジュ",
        "meaning": "responding to a demand, answering a request"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "心",
      "forms": [
        "忄",
        "⺗"
      ],
      "meaning": "heart"
    },
    "parts": [
      "化",
      "广",
      "心",
      "隹"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/25033_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/061c9.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/61c9.gif",
    "uri": "https://jisho.org/search/%E6%87%89%23kanji"
  },
  "hanviet": [
    "ứng"
  ],
  "vietnameseMeaning": [
    "ứng ① Ðáp, như ứng đối 應對 đáp thưa. ② Ứng theo, như ta đập mạnh một cái thì nghe bên ngoài có tiếng vang ứng theo, gọi là hưởng ứng 響應, làm thiện được phúc, làm ác phải vạ gọi là báo ứng 報應, vì lòng thành cầu mà được như nguyện gọi là cảm ứng 感應, v.v. ③ Cái trống con. ④ Một thứ âm nhạc ngày xưa, dài 6 thước 5 tấc. ⑤ Một âm là ưng. Nên thế. ⑥ Nên, lời nói lường tính trước, như ưng tu 應須 nên phải, chỉ ưng 紙應 chỉ nên, v.v. ① Thưa, đáp lại (lời gọi): 喊他不應 Gọi mãi hắn không thưa; ② Nên, cần, phải: 應盡的義務 Nghĩa vụ phải làm tròn; 應死之罪 Tội phải chết; 發現錯誤應立即糾正 Phát hiện sai lầm nên uốn nắn ngay; ③ Nhận lời, đồng ý: 這事是我應下來的，由我負責吧！ Việc đó do tôi nhận làm, tôi xin chịu trách nhiệm vậy!; ④ (Một loại) nhạc khí thời xưa (trong có cây dùi, gõ lên để hoà nhạc); ⑤ Cái trống con: 應田縣鼓 Trống nhỏ trống lớn đều là trống treo (Thi Kinh: Chu tụng, Hữu cổ); ⑥ Nước Ưng (một nước thời cổ, ở phía đông huyện Lỗ Sơn, tỉnh Hà Nam, Trung Quốc ngày nay); ⑦ (Họ) Ưng. Xem 應 . ① Đáp, đáp ứng, đồng ý làm theo, cho: 以應急需 Để đáp ứng những nhu cầu cần thiết; 有求必應 Hễ cầu xin là cho; ② Ứng (phó), đối phó: 隨機應變 Tùy cơ ứng biến; 吾將何以應敵 Ta sẽ làm sao đối phó với địch (Hàn Phi tử); ③ (Thích, phản) ứng, ứng theo: 要適應這一環境 Phải thích ứng với hoàn cảnh này; 化學反應 Phản ứng hoá học; ④ Tương ứng, (tùy) theo: 應弦而倒 Ngã theo cây đàn (Thế thuyết tân ngữ); ⑤ Ứng hoạ, hoạ theo; ⑥ Hưởng ứng: 殺之以應陳涉 Giết ông ta để hưởng ứng cuộc khởi nghĩa của Trần Thiệp (Sử kí); ⑦ Ứng nghiệm, đúng với: 今果應此言 Nay quả ứng nghiệm với (đúng với) lời nói đó (Tam quốc diễn nghĩa); ⑧ Căn cứ theo, dựa theo. Xem 應 ."
  ],
  "grade": "10"
}