{
  "id": "按",
  "kanjialiveData": null,
  "jishoData": {
    "query": "按",
    "found": true,
    "strokeCount": 9,
    "meaning": "hold, consider, investigate",
    "kunyomi": [
      "おさ.える",
      "しら.べる"
    ],
    "onyomi": [
      "アン"
    ],
    "onyomiExamples": [
      {
        "example": "塩梅",
        "reading": "アンバイ",
        "meaning": "seasoning, flavour, flavor, taste, condition, state, situation, (state of) health, physical condition, arrangement, assignment, adjustment, handling, dealing with"
      },
      {
        "example": "案じる",
        "reading": "アンジル",
        "meaning": "to be anxious (about), to be concerned (about), to worry (about), to fear, to think out (e.g. a plan), to work out, to devise, to consider, to ponder, to investigate, to stroke, to rub, to pat, to grasp (the hilt of one's sword)"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "手",
      "forms": [
        "扌龵"
      ],
      "meaning": "hand"
    },
    "parts": [
      "女",
      "宀",
      "扎"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/25353_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/06309.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/6309.gif",
    "uri": "https://jisho.org/search/%E6%8C%89%23kanji"
  },
  "hanviet": [
    "án"
  ],
  "vietnameseMeaning": [
    "① Ðè xuống. ② Cứ, bằng cứ cái này để làm chứng cái kia gọi là án. ③ Vỗ, như án kiếm 按劍 vỗ gươm, án bí 按轡 cầm dây cương, v.v. ④ Xét nghiệm, xưa có quan tuần án 巡按 nghĩa là chức quan đi tuần các nơi để xét xem các quan cai trị dân làm sao. ⑤ Lần lượt tới, như án hộ phái đinh 按戶派丁 cứ tính số nhà mà lần lượt sai phái các xuất đinh. ⑥ Dừng lại. ⑦ Vạch ra mà hặc tội. ① Đè xuống, ấn, bấm: 按電鈴 Bấm chuông; ② Bắt: 按脈 Bắt mạch; ③ Dừng lại, gác lại: 按下此事先不表 Tạm gác việc đó lại khoan nói đến; ④ Làm theo, chiếu theo: 按人數算 Tính theo số người. 【按理】án lí Lẽ ra, đáng lẽ, đáng lí, đúng lí ra; 【按照】án chiếu Theo, chiếu theo, thể theo, làm theo: 按照預定的計劃完成任務 Hoàn thành nhiệm vụ theo kế hoạch dự định; ⑤ (văn) Vỗ: 按劍 Vỗ gươm; ⑥ (văn) Tra xét: 巡按 Chức quan chuyên đi tra xét việc làm của các quan lại; ⑦ (văn) Vạch ra để hạch tội; ⑧ Lời chú, lời phê: 編者按 Lời toà soạn (LTS)."
  ],
  "grade": "9"
}