{
  "id": "撥",
  "kanjialiveData": null,
  "jishoData": {
    "query": "撥",
    "found": true,
    "strokeCount": 15,
    "meaning": "brush up, reject, exclude, eliminate, bone plectrum",
    "kunyomi": [
      "は.ねる",
      "おさ.める"
    ],
    "onyomi": [
      "ハツ",
      "バチ"
    ],
    "onyomiExamples": [
      {
        "example": "撥音",
        "reading": "ハツオン",
        "meaning": "syllabic nasal (in Japanese)"
      },
      {
        "example": "撥音便",
        "reading": "ハツオンビン",
        "meaning": "nasal sound change (generation of the mora 'n', primarily from verb stems ending in 'i')"
      },
      {
        "example": "撥",
        "reading": "バチ",
        "meaning": "plectrum (for a shamisen, biwa, etc.), pick, drumstick (for taiko), mallet (for a gong), beater"
      },
      {
        "example": "撥音",
        "reading": "バチオト",
        "meaning": "sound made by a plectrum"
      },
      {
        "example": "目撥",
        "reading": "メバチ",
        "meaning": "bigeye tuna (edible fish, Thunnus obesus)"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "撥ねる",
        "reading": "はねる",
        "meaning": "to hit (e.g. with a car), to knock down, to reject, to eliminate, to exclude, to get rid of, to refuse (e.g. a request), to deny, to turn down, to flip, to splash, to splatter, to take (a percentage), to stick up (e.g. of hair), to curl up (e.g. of a moustache), to sweep up (the end of a brush stroke), to pronounce as a syllabic nasal"
      }
    ],
    "radical": {
      "symbol": "手",
      "forms": [
        "扌龵"
      ],
      "meaning": "hand"
    },
    "parts": [
      "二",
      "儿",
      "扎",
      "癶"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/25765_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/064a5.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/64a5.gif",
    "uri": "https://jisho.org/search/%E6%92%A5%23kanji"
  },
  "vietnameseMeaning": [
    "① Trừ sạch, đánh tan, như bát khai vân vụ 撥開雲霧 trừ sạch mây mù. ② Chuyển, xoay lại, như bát loạn phản chánh 撥亂反正 dẹp loạn chuyển lại chánh. ③ Phát ra, như chi bát 支撥 chi phát ra. ④ Khêu, bới, như khiêu bát 挑撥 khiêu gợi, bát thuyền 撥船 bơi thuyền, v.v. ⑤ Gảy đàn. ⑥ Cái móng tay giả để gảy đàn. ⑦ Cung lật trái lại. ⑧ Tốc lên. ① Khêu, cạy, nạy, quay, vặn, nhể, lể: 撥燈 Khêu (bấc) đèn; 撥門 Cạy cửa, nạy cửa; 撥電話 Quay điện thoại; 撥鐘 Vặn kim đồng hồ; 拿針把手上的刺撥出來 Lấy kim nhể (lễ) cái gai trên tay ra; ② Bỏ ra, đưa ra, rút ra, chỉ ra, phát cho, cấp cho.【撥款】 bát khoản a. Chi một khoản tiền, bỏ ra một số tiền, cấp kinh phí, chi ngân sách, chuẩn chi: 撥款委員會 Ủy ban chuẩn chi; b. Khoản tiền chi, ngân sách chi, kinh phí: 軍事撥款 Ngân sách quân sự; 預算的支出部分是國家的撥款 Phần chi của ngân sách là khoản chi của nhà nước; ③ Quay, quay hướng, xoay lại, chuyển lại, xoay chuyển: 撥轉馬頭 Quay đầu ngựa lại, quay ngựa; 撥亂反正 Chuyển loạn thành chánh; ④ (văn) Trừ sạch, đánh tan: 撥開雲霧 Trừ sạch mây mù; ⑤ (văn) Gảy đàn; ⑥ (văn) Tốc lên; ⑦ (văn) Miếng gảy đàn, phím đàn, miếng khảy (thường làm bằng móng tay giả); ⑧ Tốp, toán, đám, nhóm, đợt: 分成兩撥兒進入會場 Chia làm hai tốp đi vào hội trường."
  ],
  "hanviet": [
    "bát"
  ]
}