{
  "id": "數",
  "kanjialiveData": null,
  "jishoData": {
    "query": "數",
    "found": true,
    "strokeCount": 15,
    "meaning": "number, strength, fate, law, figures",
    "kunyomi": [
      "かず",
      "かぞ.える",
      "しばしば",
      "せ.める",
      "わずらわ.しい"
    ],
    "onyomi": [
      "スウ",
      "ス",
      "サク",
      "ソク",
      "シュ"
    ],
    "onyomiExamples": [
      {
        "example": "数度",
        "reading": "スウド",
        "meaning": "several times, a few times, several degrees, a few degrees"
      },
      {
        "example": "数度",
        "reading": "スウド",
        "meaning": "several times, a few times, several degrees, a few degrees"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "攴",
      "forms": [
        "攵"
      ],
      "meaning": "rap"
    },
    "parts": [
      "一",
      "乞",
      "口",
      "女",
      "攵",
      "｜"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/25976_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/06578.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/6578.gif",
    "uri": "https://jisho.org/search/%E6%95%B8%23kanji"
  },
  "hanviet": [
    "số"
  ],
  "vietnameseMeaning": [
    "sổ số sác ① Ðếm, đếm số vật xem là bao nhiêu gọi là sổ. ② Trách mắng kẻ có tội. ③ Kể, cân nhắc, như sổ điển vong tổ 數典忘祖 kể điển tích quên cả chức sự của tổ, bất túc sổ 不足數 không đủ kể. ④ Lời tính phỏng, như sổ nhật 數日 vài ba ngày, sổ khẩu 數口 vài ba miệng, v.v. ⑤ Một âm là số. Số mục, như cơ số 奇數 số lẻ, ngẫu số 偶數 số chẵn, v.v. ⑥ Thuật số, môn toán học dùng chân số để luận về tính chất và quan hệ của số. ⑦ Số mệnh, số kiếp. ⑧ Lại một âm là sác. Luôn luôn, như mạch sác 脉數 mạch chạy mau, sác kiến 數見 thấy luôn. ⑧ Một âm nữa là xúc. Nhỏ, đan mau. (văn) Nhặt: 數罟不入洿池Lưới nhặt không vào ao lớn (Mạnh tử: Lương Huệ vương thượng). Xem 數 , , . ① Đếm: 數不清 Đếm không xuể; ② Chỉ sự hơn: 我家就數他身子好 Nhà tôi chỉ có nó là khỏe hơn cả; ③ Kể: 不足數 Không đáng kể; ④ Kể tội, quở mắng: 數說 Quở trách, mắng. Xem 數 , , . ① Số: 人數太多 Số người nhiều quá; 奇數 Số lẻ; 偶數 Số chẵn; ② Mấy, vài: 數次 Mấy lần; 數日 Vài ngày; ③ Thuật số; ④ Toán thuật (một trong 6 môn học cơ bản thời xưa — gọi là lục nghệ); ⑤ (văn) Phép tắc, quy luật; ⑥ (văn) Vận mạng, số mạng; ⑦ (văn) Tài nghệ: 今夫弈之爲數，小數也 Nay đánh cờ là một tài nghệ, nhưng nó chỉ là một tài nghệ nhỏ thôi (Mạnh tử: Cáo tử thượng); ⑧ (văn) Lí lẽ: 以新旅與習故爭，其數不勝也 Đem khách mới cho tranh với bạn quen cũ, về lí lẽ thì sẽ không thắng được (Hàn Phi tử: Cô phẫn). Xem 數 , , . Nhiều lần, luôn luôn, thường: 幾死者數矣 Suýt chết đã mấy lần rồi (Liễu Tôn Nguyên: Bộ xà giả thuyết); 是時地數震裂，衆火頻降 Khi ấy đất thường động vỡ, nhiều trận hoả tai giáng xuống (Hậu Hán thư). 【數見不鮮】sác kiến bất tiên Thường gặp chẳng mới mẻ gì (không có gì lạ). Xem 數 , , ."
  ]
}