{
  "id": "斷",
  "kanjialiveData": null,
  "jishoData": {
    "query": "斷",
    "found": true,
    "strokeCount": 18,
    "meaning": "sever, cut off, interrupt",
    "kunyomi": [
      "た.つ",
      "ことわ.る",
      "さだ.める"
    ],
    "onyomi": [
      "ダン"
    ],
    "onyomiExamples": [
      {
        "example": "断簡",
        "reading": "ダンカン",
        "meaning": "fragment of a historical document, scrap of an old manuscript, piece of an antique record"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "断つ",
        "reading": "たつ",
        "meaning": "to sever, to cut off, to suppress, to eradicate, to exterminate, to abstain (from), to give up"
      }
    ],
    "radical": {
      "symbol": "斤",
      "meaning": "axe"
    },
    "parts": [
      "幺",
      "斤",
      "｜"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/26039_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/065b7.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/65b7.gif",
    "uri": "https://jisho.org/search/%E6%96%B7%23kanji"
  },
  "vietnameseMeaning": [
    "đoán, đoạn ① Chặt đứt, chặt đứt làm hai mảnh gọi là đoạn. Hai bên không ưa nhau nữa cũng gọi là đoạn, như ân đoạn nghĩa tuyệt 恩斷義絕 hết ơn dứt nghĩa. ② Kiêng bỏ. ③ Một âm là đoán. Quyết đoán, như đoán ngục 斷獄 xử đoán ngục tù, chẩn đoán 診斷 xem mạch đoán căn bệnh, v.v. ④ Ðoán đoán 斷斷 thành thật, tả cái dáng chí thành chuyên nhất. ① Đứt: 砍斷 Chặt đứt; 繩子斷了 Sợi dây đứt rồi; ② Cắt, cắt đứt, bỏ, không có: 斷電 Cắt điện; 斷奶 Bỏ bú, cai sữa; 斷了關系 Cắt đứt quan hệ; 音訊斷了 Không có tin tức gì nữa, bặt tin; ③ Cai, bỏ: 斷煙 Cai thuốc; ④ Phán đoán, xử đoán, nhận định: 斷語 Lời phán đoán, lời nhận định, lời quyết đoán; 診斷 Chẩn đoán; ⑤ (văn) Tuyệt đối, hoàn toàn: 斷無此理 Không thể như thế được. 【斷斷】đoán đoán Tuyệt đối, bất luận thế nào: 變了質的食物斷斷吃不得 Thức ăn bị ôi thiu thì tuyệt đối không được ăn; 倉庫裡都是易燃物品，斷斷不能抽煙 Trong kho toàn là hàng dễ cháy, tuyệt đối không được hút thuốc; 【斷然】 đoán nhiên Tuyệt nhiên: 我們斷然不能承認 Chúng tôi tuyệt nhiên không thể thừa nhận."
  ],
  "hanviet": [
    "đoạn",
    "đoán"
  ]
}