{
  "id": "施",
  "kanjialiveData": null,
  "jishoData": {
    "query": "施",
    "found": true,
    "taughtIn": "junior high",
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "323",
    "strokeCount": 9,
    "meaning": "give, bestow, perform, alms",
    "kunyomi": [
      "ほどこ.す"
    ],
    "onyomi": [
      "シ",
      "セ"
    ],
    "onyomiExamples": [
      {
        "example": "施工",
        "reading": "セコウ",
        "meaning": "construction, constructing, carrying out, work, formation, workmanship, execution"
      },
      {
        "example": "施行",
        "reading": "シコウ",
        "meaning": "putting in force (a law), putting into operation, putting into effect, enforcement, carrying out (a plan, policy, etc.), execution"
      },
      {
        "example": "施行",
        "reading": "シコウ",
        "meaning": "putting in force (a law), putting into operation, putting into effect, enforcement, carrying out (a plan, policy, etc.), execution"
      },
      {
        "example": "施工",
        "reading": "セコウ",
        "meaning": "construction, constructing, carrying out, work, formation, workmanship, execution"
      },
      {
        "example": "布施",
        "reading": "フセ",
        "meaning": "alms-giving, charity, offerings (usu. money) to a priest (for reading sutras, etc.)"
      },
      {
        "example": "仕着せ",
        "reading": "シキセ",
        "meaning": "servant's clothes provided by an employer, livery"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "施す",
        "reading": "ほどこす",
        "meaning": "to give (time, money, goods), to donate, to do, to perform, to conduct, to apply (processing, makeup, etc.), to add (e.g. ornamentation, annotation), to sow, to seed, to scatter (e.g. fertilizer), to sprinkle, to spread far and wide"
      }
    ],
    "radical": {
      "symbol": "方",
      "meaning": "square"
    },
    "parts": [
      "ノ",
      "一",
      "乞",
      "也",
      "方"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/26045_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/065bd.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/65bd.gif",
    "uri": "https://jisho.org/search/%E6%96%BD%23kanji"
  },
  "hanviet": [
    "thi"
  ],
  "vietnameseMeaning": [
    "① Bày ra, đặt ra, đem dùng ra cho người hay vật gọi là thí, như thi thuật 施術 làm thuật cho kẻ nào, thi trị 施治 làm phép chữa cho kẻ nào, thi ân 施恩 ra ơn cho kẻ nào, thi phấn 施粉 đánh phấn, thi lễ 施禮 làm lễ chào, v.v. ② Bêu xác. ④ Một âm là thí. Giúp, cho, nhu bác thí 博施 rộng giúp mọi người, thí dữ 施與 cho giúp. ⑤ Lại một âm là dị. Dài, lâu dài. ⑥ Lại một âm nữa là thỉ. Ði ngoẹo, đi tắt, theo hút. ⑦ Thay đổi. ⑧ Bỏ. ① Thực hành, thi hành: 施工 Thi công, làm, xây dựng; 無計可施 Không còn cách nào nữa; ② Dùng, thêm: 施肥 Bón phân; ③ (văn) Làm cho, gây cho: 己所不慾，物施於人 Điều gì mình không muốn thì đừng làm cho kẻ khác (Luận ngữ); ④ (văn) Thiết lập, đặt để, đặt ra: 立法施度 Đặt ra luật lệ chế độ; 施八尺屏風 Đặt tấm bình phong cao tám thước; ⑤ (văn) Rải rác: 雲行雨施 Mây nhẹ bay mưa rải rác (Chu Dịch); ⑥ Bêu xác trước mọi người: 秦人殺冀苪而施之 Người nước Tần giết Kí Bính rồi bêu xác ông ta (Quốc ngữ); ⑦ Bố thí, cho; ⑧ (văn) Cây thước to: 其施七尺 Cây thước to của ông (Quản Trọng) dài đến bảy thước (Quản tử); ⑨ (văn) Ân huệ: 未報秦施 Chưa đáp lại ân huệ của Tần (Tả truyện: Hi công tam thập tam niên); ⑩ (Họ) Thi. (văn) Bỏ bê, ruồng bỏ (dùng như 弛, bộ 弓): 君子不施其親 Người quân tử không bỏ bê thân tộc mình (Luận ngữ). (văn) Đi xiên, đi ngoẹo, đi tắt (dùng như 迤, bộ 辶): 蚤起，施從良人之所之 Sáng sớm thức dậy, đi tắt theo người chồng đến chỗ mà anh ta đi đến (Mạnh tử). (văn) 葛之覃兮，施于中谷 Dây sắn tốt tươi kia hề, bò lan đến giữa hang (Thi Kinh)."
  ],
  "jlpt": "1",
  "frequency": "323",
  "grade": "8"
}