{
  "id": "是",
  "kanjialiveData": null,
  "jishoData": {
    "query": "是",
    "found": true,
    "taughtIn": "junior high",
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "1045",
    "strokeCount": 9,
    "meaning": "just so, this, right, justice",
    "kunyomi": [
      "これ",
      "この",
      "ここ"
    ],
    "onyomi": [
      "ゼ",
      "シ"
    ],
    "onyomiExamples": [
      {
        "example": "是",
        "reading": "ゼ",
        "meaning": "righteousness, justice, right"
      },
      {
        "example": "是正",
        "reading": "ゼセイ",
        "meaning": "correction, revision, redressing, rectifying"
      },
      {
        "example": "国是",
        "reading": "コクゼ",
        "meaning": "national policy"
      },
      {
        "example": "党是",
        "reading": "トウゼ",
        "meaning": "party platform, party principles"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "此れ",
        "reading": "これ",
        "meaning": "this, this one, this person, now, this point (in time), here, used to stress the subject of a sentence, I, me"
      },
      {
        "example": "此れから",
        "reading": "これから",
        "meaning": "from now on, after this, in the future, in future, from here, from this point"
      },
      {
        "example": "此処",
        "reading": "ここ",
        "meaning": "here, this place, this point, here, now, these past ... (e.g. three years), these last ..., the next ... (e.g. few days), these next ..."
      },
      {
        "example": "此処に",
        "reading": "ここに",
        "meaning": "now, here, at this juncture"
      }
    ],
    "radical": {
      "symbol": "日",
      "meaning": "sun, day"
    },
    "parts": [
      "日",
      "疋"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/26159_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/0662f.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/662f.gif",
    "uri": "https://jisho.org/search/%E6%98%AF%23kanji"
  },
  "hanviet": [
    "thị"
  ],
  "vietnameseMeaning": [
    "① Phải, điều gì ai cũng công nhận là phải gọi là thị. Cái phương châm của chánh trị gọi là quốc thị 國是. ② Ấy thế, lời nói chỉ định như như thị 如是 như thế. ① Là, đó là: 他是工人 Anh ấy là công nhân; 不知爲不知，是知也 Không biết thì cho là không biết, đó là biết vậy (Luận ngữ); 余是所嫁婦人之父也 Tôi là cha của người đàn bà gả chồng kia (Vương Sung: Luận hoành).【是凡】thị phàm Như 凡 nghĩa ③;【是否】thị phủ Có phải... hay không: 是否符合實際 Có sát thực tế hay không;【是也】thị dã (văn) Đó là, là như thế vậy: 取之而燕民悅，則取之。古之人有行之者，武王是也 Đánh lấy nước Yên mà dân nước Yên vui vẻ, thì đánh lấy. Người xưa đã có người làm thế rồi, đó là Võ vương vậy (Võ vương là như thế vậy) (Mạnh tử); 終而復始，日月是也 Dứt hết rồi trở lại như lúc đầu, mặt trời mặt trăng là như thế vậy (Tôn tử binh pháp);【是以】 thị dĩ (văn) Lấy đó, vì vậy, vì thế: 吾是以憂，子賀我，何故？ Tôi lấy đó làm lo (vì thế đâm lo), ông lại mừng tôi, vì sao thế? (Tả truyện) ② Có: 滿身是汗 Trên mình đẫm mồ hôi, mồ hôi nhễ nhãi; ③ Đó, đấy, ấy: 東西舊是舊，可 是還能用 Đồ có cũ thật đấy, nhưng còn dùng được; ④ Thích hợp, đúng: 來的是時候 Đến đúng lúc; 放的是地方 Đặt đúng chỗ; ⑤ Bất cứ, phàm, hễ: 是集體的事，大家都應關心 Hễ là việc chung, mọi người đều phải quan tâm; ⑥ Đấy (dùng cho câu hỏi): 你坐輪船還是坐火車？ Anh ngồi tàu thuỷ hay đi tàu hoả đấy?; ⑦ Dùng làm tiếng đệm: 是誰告訴你的？ Ai cho anh biết đấy?; 他是不知道 Anh ấy không hiểu thật đấy; 天氣是冷 Trời rét thật; ⑧ Đúng, phải, hợp lí: 實事求是 Thực sự cầu thị; 他說的是 Anh ấy nói đúng; ⑨ Cái đó, cái ấy, việc đó, việc ấy, người đó, người ấy, đó, đấy, ấy, thế: 如是 Như thế; 是日天氣晴朗 Ngày đó trời nắng tốt; 吾祖死于是，吾父死于是 Ông tôi chết vì việc đó, cha tôi cũng chết vì việc đó (việc bắt rắn) (Liễu Tôn Nguyên: Bộ xà giả thuyết); 是知津矣 Người đó đã biết chỗ bến đò rồi (Luận ngữ); 是乃仁術也 Đó là cách thi hành điều nhân vậy (Mạnh tử); 是吾劍之所從墮 Đây là nơi cây gươm của ta rơi xuống (Lã thị Xuân thu); 昭公南征而不復，寡人是問 Chiêu công đi tuần hành ở phương nam không trở về, quả nhân muốn hỏi về việc đó (Tả truyện). Xem 是也 ở trên; ⑩ (văn) Như thế: 是心足以王矣 Tấm lòng như thế là đủ để xưng vương với thiên hạ rồi (Mạnh tử); ⑪ (văn) Trợ từ giữa câu để đảo trí tân ngữ ra phía trước động từ: 余唯利是視 Ta chỉ chú trọng đến điều lợi (Tả truyện) (thay vì: 余唯視利)."
  ],
  "jlpt": "1",
  "frequency": "1045",
  "grade": "8"
}