{
  "id": "沒",
  "kanjialiveData": null,
  "jishoData": {
    "query": "沒",
    "found": true,
    "strokeCount": 7,
    "meaning": "not, have not, none, to drown, sink",
    "kunyomi": [
      "おぼ.れる",
      "しず.む",
      "ない"
    ],
    "onyomi": [
      "ボツ",
      "モツ"
    ],
    "onyomiExamples": [
      {
        "example": "没落",
        "reading": "ボツラク",
        "meaning": "ruin, fall, collapse, downfall, bankruptcy"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "水",
      "forms": [
        "氵",
        "氺"
      ],
      "meaning": "water"
    },
    "parts": [
      "力",
      "又",
      "汁"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/27794_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/06c92.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/6c92.gif",
    "uri": "https://jisho.org/search/%E6%B2%92%23kanji"
  },
  "hanviet": [
    "mốt",
    "một"
  ],
  "vietnameseMeaning": [
    "một ① Chìm đắm, bị nước tràn ngập gọi là một. ② Chết, mất rồi, có khi viết là 歿. ③ Hết, như một thế 沒世 hết đời. ④ Không có, chế người không biết chữ gọi là một tự bi 沒字碑 ý nói trong lòng không có một chữ nào. ⑤ Mất tích, như mai một 埋沒 vùi mất, dẫn một 泯沒 tan mất, v.v. ⑥ Lấy hết, tịch kí hết cơ nghiệp về nhà nước gọi là tịch một 籍沒, nuốt sống hết của cải người ta gửi mình gọi là càn một 乾沒, v.v. ⑦ Ẩn mất, núp mình, chợt thấy chợt mất. ⑧ Quá, hơn. Không, không có. 【沒有】 một hữu ① Không có: 沒有票 Không có vé; 沒有理由 Không có lí do; 屋裡沒有人 Trong nhà không có người; ② Chả ai, đều không: 沒有誰同意這樣做 Chả ai đồng ý làm như thế; 沒有哪說過這樣的話 Không có ai nói như vậy; ③ Không bằng: 你沒有他高 Cậu không cao bằng anh ấy; ④ Không đầy: 剛來沒有三天就走 Mới đến không đầy ba hôm đã đi rồi; ⑤ Còn chưa: 他沒有回來 Anh ấy còn chưa về; 天還沒有黑呢 Trời còn chưa tối. Xem 沒 . ① Chìm, lặn: 沒入水中 Chìm xuống dưới nước; 太陽將沒不沒的時候，水面泛起了一片紅光 Khi mặt trời sắp lặn, mặt nước gợn lên màu đỏ rực; 日沒月沒，車聲不絕 Ác lặn trăng tà, tiếp xe không dứt (Miên Thẩm: Thương Sơn thi tập); ② Ngập: 雪深深膝 Tuyết ngập đến gối; 草沒入腰 Cỏ ngập đến lưng; 水深沒頂 Nước sâu ngập quá đầu; ③ Ẩn, mất: 出沒 Ẩn hiện; ④ Tịch thu: 沒收 Tịch thu; ⑤ Chung thân, cả đời, suốt đời: 世沒難忘 Nhớ suốt đời; ⑥ Chết. Như 歿 . Xem 沒 ."
  ]
}