{
  "id": "爭",
  "kanjialiveData": null,
  "jishoData": {
    "query": "爭",
    "found": true,
    "strokeCount": 8,
    "meaning": "to dispute, fight, contend, strive",
    "kunyomi": [
      "あらそ.う",
      "いか.でか"
    ],
    "onyomi": [
      "ソウ"
    ],
    "onyomiExamples": [],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "爪",
      "forms": [
        "爫"
      ],
      "meaning": "claw"
    },
    "parts": [
      "ヨ",
      "亅",
      "爪"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/29229_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/0722d.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/722d.gif",
    "uri": "https://jisho.org/search/%E7%88%AD%23kanji"
  },
  "hanviet": [
    "tranh"
  ],
  "vietnameseMeaning": [
    "① Trang giành, cãi cọ. Phàm tranh hơn người hay cố lấy của người đều gọi là tranh. ② Thế nào? Dùng làm trợ từ. ③ Một âm là tránh. Can ngăn. ① Tranh, giành, đua nhau: 爭座位 Tranh chỗ ngồi; 爭光 Giành vẻ vang; 是時富豪爭匿財 Lúc đó những nhà giàu đua nhau giấu của (Hán thư); ② Tranh cãi, tranh chấp: 爭得面紅耳赤 Tranh cãi nhau đến đỏ mặt tía tai; ③ (đph) Thiếu, hụt: 總數還爭多少 Tổng số còn thiếu bao nhiêu?; ④ Sao, làm sao, sao lại: 爭不 Sao không, sao lại không; 爭知 Sao biết, sao lại biết; 爭知江山客，不是故鄉來？ Sao biết khách giang sơn, chẳng phải là người từ quê hương đến? (Thôi Đồ: Lỗ thanh). 【爭奈】 tranh nại (văn) Như 爭奈;【爭奈】tranh nại (văn) Không làm sao được, biết làm sao, biết làm thế nào được, đành chịu: 南園桃李雖堪羡，爭奈春殘又寂寥？ Vườn nam đào lí tuy ưa thích, xuân tàn vắng vẻ biết làm sao? (Thôi Đồ: Giản tùng); 爭奈世人多聚散？ Người đời tan hợp biết làm sao? (Án Thù: Ngư gia ngạo); 【爭奈何】tranh nại hà (văn) Biết làm thế nào: 慈雲普潤無邊際，枯樹無花爭奈何？ Mây lành thấm khắp không bờ bến, cây héo không hoa biết thế nào? (Tổ đường tập);【爭似】tranh tự (văn) Sao bằng: 城中桃李須臾盡，爭似垂楊無限時？ Trong thành đào lí trong chốc lát đã rụng hết, sao bằng cây liễu rũ cứ sống hoài? (Lưu Vũ Tích: Dương liễu chi từ). Can ngăn, khuyên bảo, khuyên răn: 以數諫爭不合，去 Vì can ngăn nhiền lần không được, nên bỏ đi (Hậu Hán thư: Vương Sung truyện). Như 諍 (bộ 言)."
  ],
  "grade": "10"
}