{
  "id": "爲",
  "kanjialiveData": null,
  "jishoData": {
    "query": "爲",
    "found": true,
    "strokeCount": 12,
    "meaning": "change, be of use, reach to, do, try, practice, cost, serve as",
    "kunyomi": [
      "ため",
      "な.る",
      "な.す",
      "す.る",
      "たり",
      "つく.る",
      "なり"
    ],
    "onyomi": [
      "イ"
    ],
    "onyomiExamples": [
      {
        "example": "為政",
        "reading": "イセイ",
        "meaning": "governing, administering"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "為",
        "reading": "ため",
        "meaning": "good, advantage, benefit, welfare, sake, purpose, objective, aim, consequence, result, effect, affecting, regarding, concerning"
      },
      {
        "example": "為に",
        "reading": "ために",
        "meaning": "for, for the sake of, to one's advantage, in favor of, in favour of, on behalf of, because of, as a result of"
      },
      {
        "example": "為す",
        "reading": "なす",
        "meaning": "to do, to commit, to carry out, to bring about"
      }
    ],
    "radical": {
      "symbol": "爪",
      "forms": [
        "爫"
      ],
      "meaning": "claw"
    },
    "parts": [
      "尸",
      "杰",
      "爪"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/29234_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/07232.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/7232.gif",
    "uri": "https://jisho.org/search/%E7%88%B2%23kanji"
  },
  "hanviet": [
    "vay"
  ],
  "vietnameseMeaning": [
    "vị ① Làm, như hành vi 行爲. ② Gây nên, làm nên. ③ Trị, như vi quốc 爲國 trị nước. ④ Dùng làm ngữ từ, như tuy đa diệc hề dĩ vi 雖多亦奚以爲 dầu nhiều có làm gì. ⑤ Một âm là vị. Như vị kỉ 爲已 vì mình, hữu sở vị nhi vị 有所爲而爲 có vì cái gì mà làm, v.v. ⑥ Giúp, như Luận ngữ nói: phu tử bất vị dã 夫子不爲也 nhà thầy chẳng giúp vậy. Cũng viết là vi 為. ① Làm: 事在人爲 Muôn sự do người làm nên; 敢爲 Dám làm; ② Là, làm: 選他爲代表 Bầu anh ấy làm đại biểu; 能者爲師 Người giỏi là thầy. 【爲當】vi đương (văn) Hoặc là, hay là; 【爲復】vi phục (văn) Hay là: 君家少室西，爲復少室東？ Nhà ông ở phía tây núi Thiếu Thất, hay ở phía đông núi Thiếu Thất? (Vương Hữu Thừa tập); ③ (văn) Chế ra, làm ra; ④ (văn) Trị, trị lí; ⑤ (văn) Đặt ra, đưa ra; ⑥ (văn) Ca hát, biểu diễn (bài nhạc); ⑦ (văn) Nghiên cứu; ⑧ (văn) Viết, sáng tác, làm ra (sách vở...); ⑨ (văn) Cho là; ⑩ (văn) Gọi là; ⑪ (văn) Cầu; ⑫ (văn) Trị (bệnh); ⑬ (văn) Như 僞 (bộ 亻); ⑭ Thành: 變沙漠爲良田 Biến sa mạc thành ruộng tốt; ⑮ Năng lực, tài năng: 青年有爲 Thanh niên có năng lực (có triển vọng); ⑯ Bị, được (thường đi kèm với 所, tạo thành kết cấu bị động 爲…所): 這種藝術形式爲廣大人民所喜愛 Loại hình thức nghệ thuật này được đông đảo nhân dân ưa thích; 有國者不可以不慎，辟則爲天下僇矣 Kẻ có nước không thể không thận trọng, hễ thiên lệch thì bị thiên hạ lên án (Đại học). 【爲…見】vi... kiến (văn) Bị, được: 烈士爲天下見善矣，未足以活身 Kẻ liệt sĩ được thiên hạ khen ngợi, lại không thể bảo toàn được tính mạng (Trang tử: Chí lạc); 【爲…所】vi... sở Bị... (+ động từ): 利權爲人所奪 Quyền lợi bị người ta cướp đoạt; 柳昇爲我軍所攻 Liễu Thăng bị quân ta tấn công (Bình Ngô đại cáo); 【爲…於】vi... ư (văn) Bị... bởi: 胥之父兄爲戮於楚 Cha anh của Tư bị giết bởi Sở (bị Sở giết chết) (Sử kí); ⑰ (văn) Mới, thì mới: 惟助爲有公田 Chỉ có thi hành phép \"trợ\" thì mới có ruộng công (Mạnh tử); ⑱ (văn) Nếu: 王甚喜人之掩口也，爲近王，必掩口 Nhà vua rất thích người ta che miệng. Nếu ở gần nhà vua, thì phải che miệng (Hàn Phi tử); 爲有政如此，則國必亂，主必危矣 Nếu có nền chính trị như thế, thì nước ắt phải loạn, vua ắt phải nguy (Hàn Phi tử); ⑲ Đặt sau động từ làm trợ từ: 被選爲 Được bầu làm...; 分爲 Chia làm; 作爲 Là..., làm...; ⑳ (văn) Trợ từ cuối câu biểu thị ý cảm thán hoặc nghi vấn: 予無所用天下爲！ Ta chẳng có chỗ dùng thiên hạ đâu! (Trang tử); 父有罪，何以召其子爲？ Cha có tội, vì sao lại gọi đến con? (Sử kí); 吾父已死，吾安用生爲？ Cha ta đã chết, ta làm gì sống được? (Tống sử). Xem 爲 . ① Vì..., cho..., để...: 爲人民服務 Vì nhân dân phục vụ, phục vụ (cho) nhân dân; 爲建設祖國而學習 Học tập để xây dựng Tổ quốc; 請爲王殺之 Xin vì nhà vua mà giết chết ông ta (Sử kí); 汝昔何爲而來，今何爲而去？ Ông lúc trước vì sao mà đến, bây giờ vì sao mà bỏ đi? (Nguyên sử); 不足爲外人道也 Chẳng đáng kể với người bên ngoài vậy (Đào Uyên Minh: Đào hoa nguyên kí).【爲此】vị thử Vì vậy, do đó: 爲此，大會作出一項重要決定 Vì vậy, đại hội đã đưa ra một quyết định quan trọng; 【爲何】vị hà Vì sao, tại sao; 【爲了】vị liễu Vì, vì mục đích, để: 爲了和平，我們必須有耐心 Chúng ta cần phải nhẫn nại vì mục đích hoà bình; 【爲着】vị trước Như 爲了; ② (văn) Đương lúc, vào lúc: 爲其來也，臣請縳一人過王而行 Khi nó đến, thần xin trói một người đi qua trước mặt nhà vua (Án tử Xuân thu); ③ (văn) Theo, bằng: 心慮而能爲之重，爲之僞 Lòng nghĩ ngợi mà có thể làm theo lòng, thì gọi là \"nguỵ\" (Tuân tử); 死則爲布囊盛尸，入地七尺 (Ta) chết thì đựng thây bằng túi vải, chôn sâu dưới đất bảy thước (Hán thư: Dương Vương Tôn truyện); ④ Giúp đỡ, bảo vệ: 夫子不爲也 Phu tử chẳng giúp vậy (Luận ngữ). Xem 爲 ."
  ],
  "grade": "10"
}