{
  "id": "甲",
  "kanjialiveData": null,
  "jishoData": {
    "query": "甲",
    "found": true,
    "taughtIn": "junior high",
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "1073",
    "strokeCount": 5,
    "meaning": "armor, high (voice), A grade, first class, former, instep, carapace",
    "kunyomi": [
      "きのえ"
    ],
    "onyomi": [
      "コウ",
      "カン"
    ],
    "onyomiExamples": [
      {
        "example": "甲",
        "reading": "コウ",
        "meaning": "carapace, shell, 1st in rank, grade A, instep, back of hand, the A party (e.g. in a contract), the first party, plaintiff (label in legal documents)"
      },
      {
        "example": "甲状腺",
        "reading": "コウジョウセン",
        "meaning": "thyroid (gland)"
      },
      {
        "example": "装甲",
        "reading": "ソウコウ",
        "meaning": "armoring, armouring, armor, armour"
      },
      {
        "example": "亀甲",
        "reading": "キッコウ",
        "meaning": "tortoiseshell, tortoise shell, tortoiseshell pattern, honeycomb pattern, hexagonal pattern, tortoiseshell bracket (punctuation mark)"
      },
      {
        "example": "甲",
        "reading": "カン",
        "meaning": "treble range (in Japanese music), high note"
      },
      {
        "example": "甲板",
        "reading": "カンパン",
        "meaning": "deck (of a ship)"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "甲",
        "reading": "きのえ",
        "meaning": "first sign of the Chinese calendar"
      },
      {
        "example": "甲戌",
        "reading": "きのえいぬ",
        "meaning": "Wood Dog (11th term of the sexagenary cycle, e.g. 1934, 1994, 2054)"
      }
    ],
    "radical": {
      "symbol": "田",
      "meaning": "field"
    },
    "parts": [
      "日",
      "田",
      "｜"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/30002_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/07532.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/7532.gif",
    "uri": "https://jisho.org/search/%E7%94%B2%23kanji"
  },
  "hanviet": [
    "giáp"
  ],
  "vietnameseMeaning": [
    "① Can Giáp, một can đầu trong mười can. Ngày xưa lấy mười can kể lần lượt, cho nên cái gì hơn hết cả đều gọi là giáp, như phú giáp nhất hương 富甲一鄉 giầu nhất một làng. ② Dùng làm chữ nói thay ngôi (đại từ). Như anh giáp, anh ất, phần giáp, phần ất. Phàm không biết rõ là ai thì mượn chữ ấy làm cái tên mà gọi thay cho có chỗ mà so sánh. ③ Ðời khoa cử, thi tiến sĩ lấy nhất giáp 一甲, nhị giáp 二甲, tam giáp 三甲 để chia hơn kém. Cho nên bảng tiến sĩ gọi là giáp bảng 甲榜. Nhất giáp chỉ có ba bực: (1) Trạng nguyên 狀元, (2) Bảng nhãn 榜眼, Thám hoa 探花 gọi là đỉnh giáp 鼎甲. ④ Áo giáp (áo dày). ⑤ Mai, như quy giáp 龜甲 mai rùa. ⑥ Bảo giáp 保甲 kê tra các nhà các nhân xuất để cho cùng dò xét nhau mà phòng bị các quân gian phi ẩn núp. Mười nhà gọi là một giáp. ① Can Giáp (can thứ nhất trong 10 thiên can, tương đương với ngôi thứ nhất hoặc “A”); ② Nhất, chiếm hàng đầu, đứng đầu: 河仙山水甲天下 Phong cảnh Hà Tiên đẹp nhất thiên hạ; ③ Mai, vỏ: 龜甲 Mai rùa; ④ Móng: 指甲 Móng tay; ⑤ Áo giáp; ⑥ Bọc sắt: 鐵甲車 Xe bọc sắt; ⑦ (văn) Quân lính, quân đội (mặc áo giáp): 水軍精甲萬人 Một vạn quân lính thuỷ (Tư trị thông giám: Hán kỉ, Hiến đế Kiến An thập tam niên); ⑧ (văn) Vũ khí: 得甲庫取器械 Tìm được kho vũ khí, lấy được một số khí giới (Tư trị thông giám: Đường kỉ, Hiến Tông Nguyên Hoà thập nhị niên); ⑨ Chòm xóm, liên gia, giáp (thời xưa 10 nhà là một giáp): 保甲制度 Chế độ liên gia; ⑩ (văn) Bả vai (dùng như 胛, bộ 肉); ⑪ (văn) Thân gần (dùng như 狎, bộ 犬): 能不我甲 Lại chẳng muốn thân gần ta (Thi Kinh: Vệ phong, Hoàn lan); ⑫ (Họ) Giáp."
  ],
  "jlpt": "1",
  "frequency": "1073",
  "grade": "8"
}