{
  "id": "竟",
  "kanjialiveData": null,
  "jishoData": {
    "query": "竟",
    "found": true,
    "strokeCount": 11,
    "meaning": "end, finally",
    "kunyomi": [
      "おわ.る",
      "ついに",
      "わた.る"
    ],
    "onyomi": [
      "キョウ",
      "ケイ"
    ],
    "onyomiExamples": [
      {
        "example": "究竟",
        "reading": "クッキョウ",
        "meaning": "after all, in the end, finally, excellent, superb, handy, appropriate, ideal, robust, brawny, muscular, strong, sturdy"
      },
      {
        "example": "究竟",
        "reading": "クキョウ",
        "meaning": "culmination, conclusion"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "終わる",
        "reading": "おわる",
        "meaning": "to end, to come to an end, to finish, to close, to be over, to finish, to complete, to conclude, to finish doing, to be past its (one's) prime, to be awful, to be terrible, to suck, to be hopeless"
      },
      {
        "example": "遂に",
        "reading": "ついに",
        "meaning": "finally, in the end, at last, in the end, after all, never (happened)"
      }
    ],
    "radical": {
      "symbol": "立",
      "meaning": "stand, erect"
    },
    "parts": [
      "儿",
      "日",
      "立",
      "音"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/31455_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/07adf.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/7adf.gif",
    "uri": "https://jisho.org/search/%E7%AB%9F%23kanji"
  },
  "hanviet": [
    "cánh"
  ],
  "vietnameseMeaning": [
    "① Trọn, như cánh nhật 竟日 trọn ngày, hữu chí cánh thành 有志竟成 có chí trọn nên, v.v. ② Hết, như trường tài vị cánh 長才未竟 chưa thả hết tài. ③ Xong, như độc cánh 讀竟 đọc sách xong. ④ Dùng làm trợ từ, như tất cánh 畢竟, cứu cánh 究竟 xét hết, kết cùng, xét đến cùng tột. ① Xong: 整理旣竟 Xếp đặt đã xong; 看書旣竟 Xem sách đã xong (Tấn thư); ② Suốt, trọn: 竟日 Suốt ngày, trọn ngày; 竟世 Trọn đời; ③ (văn) Hết: 未竟 Chưa hết; ④ Cuối cùng, ắt: 越走越遠，竟到桂林 Càng đi càng xa, cuối cùng đã đến Quế Lâm; 有志者，事竟成 Có chí ắt làm nên; 道竟何爲邪？ Đạo cuối cùng để làm gì? (Lưu Vũ Tích: Thiên luận thượng); ⑤ (văn) Truy cứu: 此縣官重太後，故不竟也 Đó là nhà vua tôn trọng thái hậu, nên không truy cứu vậy (Hán thư); ⑥ (văn) Biên giới, biên cảnh (dùng như 境, bộ 土); ⑦ (pht) Mà, lại: 多年不見，沒想到竟在公共汽車上相遇 Lâu năm không gặp, không ngờ lại gặp nhau trên xe đò; 這部片子這麼好而他竟不去看 Bộ phim này hay thế mà anh ấy lại không đi xem.【竟然】cánh nhiên (pht) Mà, lại: 這麼複雜的事情，他竟然兩天就幹完了 Công việc phức tạp như vậy mà anh ấy chỉ mất có hai ngày đã làm xong."
  ]
}