{
  "id": "經",
  "kanjialiveData": null,
  "jishoData": {
    "query": "經",
    "found": true,
    "strokeCount": 13,
    "meaning": "classic works, pass through",
    "kunyomi": [
      "へ.る",
      "た.つ",
      "たていと",
      "はか.る",
      "のり"
    ],
    "onyomi": [
      "ケイ",
      "キョウ"
    ],
    "onyomiExamples": [
      {
        "example": "経文",
        "reading": "キョウモン",
        "meaning": "scriptural text, scriptures, sutras"
      },
      {
        "example": "道徳経",
        "reading": "ドウトクキョウ",
        "meaning": "Tao Te Ching (classic Chinese text by Lao Tzu), Daodejing"
      },
      {
        "example": "仁王般若波羅蜜経",
        "reading": "ニンノウハンニャハラミツキョウ",
        "meaning": "Humane King Sutra"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "糸",
      "forms": [
        "糹"
      ],
      "meaning": "silk"
    },
    "parts": [
      "小",
      "巛",
      "工",
      "幺",
      "糸"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/32147_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/07d93.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/7d93.gif",
    "uri": "https://jisho.org/search/%E7%B6%93%23kanji"
  },
  "hanviet": [
    "kinh"
  ],
  "vietnameseMeaning": [
    "① Thường, đạo đức pháp luật đã định không thể đổi được gọi là kinh, như thiên kinh địa nghĩa 天經地義 nói cái đạo thường như trời đất không thể di dịch được. ② Kinh sách, như Kinh Thi 詩經, Kinh Thư 書經, Hiếu Kinh 孝經, v.v. Sách của các tôn giáo cũng gọi là kinh, như kinh Phật có các kinh: Lăng Nghiêm 楞嚴經, Lăng Già 楞伽經, Bát Nhã 般若經, v.v. Các sách về các khoa lặt vặt cũng gọi là kinh, như ngưu kinh 牛經 sách xem tướng trâu và chữa trâu, mã kinh 馬經 sách xem tướng ngựa và chữa ngựa, v.v. ③ Ðường dọc, sợi thẳng. ④ Sửa, như kinh lí 經理 sửa trị, kinh doanh 經營 sửa sang, v.v. ⑤ Qua, kinh lịch 經歷 trải qua, kinh thủ 經手 qua tay, v.v. ⑥ Thắt cổ, như tự kinh 自經 tự tử, tự thắt cổ chết. ⑦ Kinh nguyệt 經月, đàn bà mỗi tháng máu giàn ra một kì, đúng kì không sai nên gọi là kinh. ⑨ Chia vạch địa giới. ⑩ Kinh mạch, sách thuốc chia 12 kinh phân phối với các tạng phủ. ⑪ Về đường sá thì phía nam bắc gọi là kinh 經, phía đông tây gọi là vĩ 緯. ⑫ Về khoảng trời không và quả đất thì lấy con đường nam bắc cực chính giao với xích đạo là kinh. Như kinh tuyến 經線 theo hướng nam bắc, vĩ tuyến 緯線 theo hướng đông tây. ① Dọc, đường dọc, sợi thẳng: 經紗 Sợi dọc; ② (y) Mạch máu, kinh mạch: 經脈 Mạch máu; ③ (địa) Kinh độ, kinh tuyến: 東經110度 110 độ kinh (tuyến) đông; ④ Sửa, sửa sang, phụ trách, làm, quản lí: 經管行政事務 Phụ trách công việc hành chính; 經理 Sửa trị; 經營 Sửa sang; ⑤ Thường: 經常 Thường xuyên; ⑥ (Sách) kinh: 聖經 Kinh thánh; 念經 Tụng kinh; ⑦ Kinh nguyệt: 行經 Hành kinh; ⑧ Qua, trải qua: 經年累月 Năm này qua năm khác; ⑨ Chịu, chịu đựng: 經 不起 Không chịu nổi; 經得起考驗 Đã chịu đựng được thử thách; ⑩ (văn) Thắt cổ: 自經 Tự thắt cổ chết; ⑪ (văn) Chia vạch địa giới; ⑫ (văn) Hướng nam bắc (đối với vĩ là hướng đông tây); ⑬ (Họ) Kinh."
  ]
}