{
  "id": "縱",
  "kanjialiveData": null,
  "jishoData": {
    "query": "縱",
    "found": true,
    "strokeCount": 17,
    "meaning": "indulge in, give free reign to",
    "kunyomi": [
      "たて"
    ],
    "onyomi": [
      "ジュウ"
    ],
    "onyomiExamples": [],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "糸",
      "forms": [
        "糹"
      ],
      "meaning": "silk"
    },
    "parts": [
      "人",
      "化",
      "土",
      "小",
      "幺",
      "彳",
      "糸",
      "走"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/32305_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/07e31.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/7e31.gif",
    "uri": "https://jisho.org/search/%E7%B8%B1%23kanji"
  },
  "hanviet": [
    "tung"
  ],
  "vietnameseMeaning": [
    "① Buông tha, thả ra, như túng tù 縱囚 tha tù ra, thao túng 操縱 buông thả. ② Túng tứ. ③ Phiếm, như túng đàm 縱談 bàn phiếm. ④ Túng sử, dùng làm tiếng trợ ngữ. ⑤ Tên bắn ra. ⑥ Một âm là tổng. Như: tổng tổng 縱縱 Vội vã, hấp tấp. ⑦ Lại một âm là tung. Ðường dọc, bề dọc từ nam đến bắc. ⑧ Ðời Chiến quốc 戰國 (403-221 trước T.L.) có một phái học về lối tung hoành. Hợp các nước ở phía nam phía bắc lại gọi là tung 縱, kết liên các nước đông tây lại gọi là hoành 橫. Tung hoành có khi viết là 從衡. ① Bề dọc, đường dọc, hàng dọc, dọc, thẳng, bề dài: 排成縱隊 Xếp thành hàng dọc; 縱橫十里 Ngang dọc mười dặm; ② (văn) Tung tích (như 踪, bộ 足): 言變事縱跡安起 Nói ra tung tích của việc biến đổi vì sao mà phát sinh (Sử kí: Trương Thang truyện). ① Thả: 縱虎歸山Thả cọp về rừng; ② Phóng ra, bắn ra: 縱矢 Bắn tên; ③ Tha hồ, thoả sức, để mặc, phiếm, lung tung: 放縱 Phóng túng; 不能縱着他們胡鬧 Không thể để mặc cho họ làm càn; ④ Vươn lên, nhảy lên: 一縱身上了房頂 Vươn người nhảy phắt một cái lên tới mái nhà; ⑤ (văn) Tuy, dù, dù rằng, dầu cho: 縱江東父老憐而王我，我何面目見之？ Dù các bậc phụ lão ở đất Giang Đông có thương mà lập ta làm vua, ta còn mặt mũi nào để trông thấy họ? (Sử kí). 【縱令】 túng lịnh (văn) Như 縱 nghĩa ⑤; 【縱然】túng nhiên Dù rằng, mặc dù, dù cho: 縱然今天下大雨，我們 也要到工地去 Mặc dù hôm nay mưa to, chúng ta vẫn phải đến công trường;【縱使】túng sử Dù cho, dù rằng, mặc cho, mặc dù, tuy...: 縱使得 仙，終當有死 Cho dù có đắc đạo tiên, cuối dùng rồi cũng chết (Nhan thị gia huấn); ⑥ (đph) Nhàu, nhăn nheo: 這張紙都縱了 Tờ giấy này nhàu rồi."
  ],
  "grade": "10"
}