{
  "id": "總",
  "kanjialiveData": null,
  "jishoData": {
    "query": "總",
    "found": true,
    "strokeCount": 17,
    "meaning": "collect, overall, altogether",
    "kunyomi": [
      "す.べて",
      "すべ.て",
      "ふさ"
    ],
    "onyomi": [
      "ソウ"
    ],
    "onyomiExamples": [
      {
        "example": "総督",
        "reading": "ソウトク",
        "meaning": "governor-general, governor, viceroy"
      },
      {
        "example": "総領",
        "reading": "ソウリョウ",
        "meaning": "eldest child, oldest child, first-born child, child who carries on the family name, pre-ritsuryō official established in key provinces, responsible for administration of his home and surrounding provinces, head of a warrior clan (Kamakura period)"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "糸",
      "forms": [
        "糹"
      ],
      "meaning": "silk"
    },
    "parts": [
      "囗",
      "夂",
      "小",
      "幺",
      "心",
      "糸"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/32317_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/07e3d.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/7e3d.gif",
    "uri": "https://jisho.org/search/%E7%B8%BD%23kanji"
  },
  "hanviet": [
    "tổng"
  ],
  "vietnameseMeaning": [
    "① Góp, họp, tóm. Như tổng luận 總論 bàn tóm lại. ② Tết, như tổng giác 總角 tết trái đào, lúc còn bé kết tóc làm trái đào, nên lúc bé gọi là tổng giác. ③ Ðứng đầu, cầm đầu. Như tổng thống 總統 chức tổng thống cầm đầu cả việc nước. ④ Tổng, họp mấy làng lại làm một tổng. ⑤ Bó dạ. ⑥ Hết đều. ⑦ Cái trang sức xe, ngựa. ① Dồn lại, gộp lại, cộng lại: 總在一起算 Tính dồn lại (gộp tất cả lại). 【總而言之】tổng nhi ngôn chi Nói chung, nói tóm lại: 大的、小的、方的、圓的，總而言之，各種形狀都有 To có nhỏ có, vuông có tròn có, nói chung, mọi hình dạng đều có cả; 【總共】tổng cộng Cả thảy, tất cả, tổng cộng: 總共有二百二十家工廠 Tất cả (cả thảy) có 220 nhà máy; 總共約五千人 Tổng cộng độ 5.000 người; 【總 歸】tổng quy Chung quy, rốt cuộc: 事實總歸是事實 Sự thực chung quy vẫn là sự thực; 【總算】tổng toán Nói chung thì cũng...: 總算有成績 Nói chung thì cũng có thành tích; 【總之】tổng chi Nói chung, tóm lại; ② Chung: 總任務 Nhiệm vụ chung; 總路線 Đường lối chung; ③ Luôn luôn, cứ, mãi: 總是 站在頭等 Luôn luôn đứng đầu; 爲什麼總是遲到 Tại sao cứ đến muộn?; 天總不放晴 Trời mãi không nắng; ④ Thế nào cũng: 總有一天 Thế nào cũng có ngày; 明天他總該回來了 Thế nào mai anh ấy cũng về; ⑤ (văn) Tết lại: 總角 Tết trái đào, (Ngr) lúc ấu thơ; ⑥ (văn) Bó dạ; ⑦ (văn) Vật trang sức xe ngựa; ⑧ Tổng (đơn vị hành chánh gồm nhiều làng thời xưa)."
  ]
}