{
  "id": "而",
  "kanjialiveData": null,
  "jishoData": {
    "query": "而",
    "found": true,
    "strokeCount": 6,
    "meaning": "and yet, and then, but, however, nevertheless",
    "kunyomi": [
      "しこ.うして",
      "しか.して",
      "しか.も",
      "しか.れども",
      "すなわち",
      "なんじ",
      "しかるに"
    ],
    "onyomi": [
      "ジ",
      "ニ"
    ],
    "onyomiExamples": [
      {
        "example": "自今",
        "reading": "ジコン",
        "meaning": "from now on, hereafter"
      },
      {
        "example": "而今而後",
        "reading": "ジコンジゴ",
        "meaning": "in the future, from now on, henceforth, hereafter"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "而して",
        "reading": "そして",
        "meaning": "and, and then, thus, and now, and finally"
      },
      {
        "example": "然も",
        "reading": "しかも",
        "meaning": "moreover, furthermore, nevertheless, and yet"
      },
      {
        "example": "然るに",
        "reading": "しかるに",
        "meaning": "however, nevertheless, but, and yet, whereas, while, on the other hand"
      }
    ],
    "radical": {
      "symbol": "而",
      "meaning": "beard"
    },
    "parts": [
      "而"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/32780_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/0800c.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/800c.gif",
    "uri": "https://jisho.org/search/%E8%80%8C%23kanji"
  },
  "vietnameseMeaning": [
    "① Mày, như nhi ông 而翁 cha mày. ② Mà, vậy, dùng làm trợ ngữ như nhi kim an tại 而今安在, dĩ nhi 已而 đã mà. ③ Bèn, lời nói chuyển xuống, như nhi mưu động can qua ư bang nội 而謀動干戈於邦內 bèn mưu khởi sự đánh nhau ở trong nước. ④ Lông má. (lt) ① Và: 偉大而艱巨的任務 Nhiệm vụ vĩ đại và gian khổ; ② Mà, mà còn: 不約而同 Không hẹn mà nên; 無益而有害 Không lợi mà còn có hại nữa; 有其名而無其實 Có tiếng mà không có miếng.【而今】nhi kim Hiện nay, ngày nay;【而況】nhi huống Huống chi, huống hồ: 天地四時猶有消，而況人乎？ Trời đất bốn mùa còn có thăng trầm, huống chi là con người! (Thế thuyết tân ngữ); 【而況 乎】nhi huống hồ (văn) Xem 而況;【而況于】nhi huống vu (văn) Như 而況乎; 【而且】nhi thả Mà còn, vả lại, hơn nữa: 這些地 區的群衆不但戰勝了各種災害，而且獲得了豐收 Bà con vùng này không những đã chiến thắng mọi thiên tai, mà còn được mùa nữa; 【而已】nhi dĩ ... mà thôi, ... thế thôi: 不過如此而已 Chẳng qua chỉ có thế mà thôi; 利害之相 似者，唯智者知之而已 Chỗ hơi giống nhau giữa lợi và hại, chỉ có kẻ trí biết được mà thôi (Chiến quốc sách);【而已耳】nhi dĩ nhĩ (văn) Mà thôi; 【而已乎】nhi dĩ hồ (văn) Mà thôi ư ?; 【而已也】nhi dĩ dã (văn) Mà thôi vậy; 【而已哉】 nhi dĩ tai (văn) Mà thôi ư?; 【而已矣】nhi dĩ hĩ (văn) Mà thôi vậy; ③ Rồi ...: 捆而殺之 Trói lại rồi giết chết. 【而 後】nhi hậu Sau này, sau đây, rồi thì; ④ (Vì...) mà: 我爲你而擔心 Tôi vì anh mà lo lắng (tôi lo cho anh); ⑤ ... đến...: 由秋而冬 Từ thu đến đông; 從小而大 Từ nhỏ đến lớn; ⑥ Nếu mà: 諸君無意則已，諸君而有意，瞻予馬首可也 Các anh không có ý (bảo vệ quê nhà) thì thôi, nếu có ý, thì xin hãy xem đầu ngựa của tôi hướng về đâu sẽ rõ (Thanh bại loại sao); ⑦ Nhưng (dùng như 然, bộ 火): 千里馬常有，而伯樂不常有 Ngựa thiên lí thì có luôn, nhưng Bá Nhạc thì không phải lúc nào cũng có (Hàn Dũ: Mã thuyết); ⑧ Như, giống như: 軍驚而壞都舍 Tiếng kêu kinh hãi của quân lính giống như nhà cửa lớn sụp đổ (Lã thị Xuân thu: Sát kim); ⑨ Mày, ông, ngươi: 而翁 Ông của mày; 汝知而心乎？ Ngươi có biết lòng ngươi không? (Sử kí); ⑩ Trợ từ để kết thúc ý câu: 豈不爾思，室是遠而 Chả lẽ không nghĩ đến anh, chỉ vì đường xa quá thôi (Luận ngữ: Tử hãn); ⑪ Trợ từ cuối câu biểu thị sự cảm thán: 俟我于著乎而！ Chờ ta ở chỗ bình phong trước cửa a! (Thi Kinh); ⑫ Trợ từ cuối câu nghi vấn hoặc phản vấn (thường dùng kèm với 其, bộ 八): 鬼猶求食，若敖氏之鬼，不其餒而？ Quỷ còn muốn được ăn, thì quỷ Nhược Ngao lẽ nào chẳng đói ư? (Tả truyện: Tuyên công tứ niên); Trợ từ dùng trong câu cầu khiến (biểu thị sự thúc giục hoặc ngăn cản): 已而！ 已而！今之從政者殆而！ Thôi đi! Thôi đi! Những kẻ cầm quyền ngày nay thật nguy! (Luận ngữ: Vi tử); Trợ từ làm ngữ vĩ cho hình dung từ hoặc phó từ: 頎而長兮 Thân mình dài cao hề (Thi Kinh: Tề phong, Y ta); Lông má. (văn) Tài năng (dùng như 能, bộ 肉): 德合一君，而徵一國 Đức hợp với ý muốn của vua một nước, tài năng (năng lực) tỏ được sự tin cậy cho người của một nước (Trang tử: Tiêu dao du)."
  ],
  "hanviet": [
    "nhi"
  ],
  "grade": "9"
}