{
  "id": "聽",
  "kanjialiveData": null,
  "jishoData": {
    "query": "聽",
    "found": true,
    "strokeCount": 22,
    "meaning": "careful enquiry, headstrong",
    "kunyomi": [
      "き.く",
      "ゆる.す"
    ],
    "onyomi": [
      "チョウ"
    ],
    "onyomiExamples": [],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "耳",
      "meaning": "ear"
    },
    "parts": [
      "十",
      "心",
      "王",
      "耳",
      "買"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/32893_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/0807d.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/807d.gif",
    "uri": "https://jisho.org/search/%E8%81%BD%23kanji"
  },
  "hanviet": [
    "thính"
  ],
  "vietnameseMeaning": [
    "① Nghe, dùng tai để nghe gọi là chữ thính, như thính thư 聽書 nghe sách, thám thính 探聽 dò la. ② Thuận theo, như thính giáo 聽教 vâng nghe lời dạy bảo. ③ Xử đoán, như thính tụng 聽訟 xử kiện. ④ Mặc, mặc kệ. Như thính kì sở chi 聽其所之 mặc kệ đi đâu thì đi. ⑤ Ðợi chờ. ⑥ Một âm là thinh. Toà giữa gọi là thinh sự 聽事 tức là nơi toà xét xử việc kiện cáo vậy. Như 聽. ① Nghe: 你聽聽外面有什麼響聲 Anh nghe xem ở ngoài có tiếng động gì; ② Nghe theo, thuận theo, vâng theo, tiếp thụ ý kiến: 不聽話 Không nghe lời; 我告訴他了，他不聽 Tôi đã bảo anh ấy rồi, nhưng anh ấy không nghe; 聽教 Vâng theo lời dạy bảo; 言聽計從 Đều thuận theo lời nói và kế sách (của họ) (Nguỵ thư: Thôi Hạo liệt truyện); ③ Mặc, mặc kệ, để mặc cho: 聽其自然 Mặc cho tự nhiên, tùy; 聽憑人家擺布 Mặc người ta muốn làm sao thì làm; 聽 其所之 Mặc cho đi đâu thì đi; 這個也只要在其人，說不得聽天由命 Việc này cũng tùy ở người đó quyết định, không thể nói là để mặc cho trời (Thẩm Mục Phổ: Vọng giang đình); ④ (đph) Hộp: 三聽豬肉罐頭 Ba hộp thịt lợn; ⑤ (văn) Tai mắt: 且仁人之用十里之國，則將有百里之聽 Người nhân cai trị một nước vuông mười dặm thì sẽ có con mắt đạt thấu tới trăm dặm (Tuân tử); ⑥ (văn) Sảnh, sảnh đường (dùng như 廳, bộ 广); ⑦ (văn) Xử đoán, xét xử: 聽訟，吾猶人也 Xử kiện thì ta cũng làm giống như người khác được vậy (Luận ngữ); ⑧ (văn) Xử lí, xử trí: 兼聽萬事 Xử lí cùng lúc nhiều việc (Sử kí)."
  ],
  "grade": "10"
}