{
  "id": "胡",
  "kanjialiveData": null,
  "jishoData": {
    "query": "胡",
    "found": true,
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "1995",
    "strokeCount": 9,
    "meaning": "barbarian, foreign",
    "kunyomi": [
      "なんぞ"
    ],
    "onyomi": [
      "ウ",
      "コ",
      "ゴ"
    ],
    "onyomiExamples": [
      {
        "example": "胡散",
        "reading": "ウサン",
        "meaning": "suspicious"
      },
      {
        "example": "胡散臭い",
        "reading": "ウサンクサイ",
        "meaning": "suspicious-looking, shady, questionable, dubious, fishy"
      },
      {
        "example": "胡",
        "reading": "コ",
        "meaning": "barbarian tribes surrounding ancient China"
      },
      {
        "example": "胡椒",
        "reading": "コショウ",
        "meaning": "pepper"
      },
      {
        "example": "柴胡",
        "reading": "サイコ",
        "meaning": "Bupleurum root, Radix Bupleuri"
      },
      {
        "example": "京胡",
        "reading": "キョウコ",
        "meaning": "jinghu (2-stringed Chinese instrument played with a bow)"
      },
      {
        "example": "誤魔化す",
        "reading": "ゴマカス",
        "meaning": "to deceive, to cheat, to swindle, to falsify, to misrepresent, to lie about, to tamper with, to fiddle, to doctor, to cook, to evade (a question, taxes, etc.), to dodge, to gloss over (a mistake, fault, etc.), to smooth over, to get one's way out of (a difficult situation), to explain away, to embezzle, to pocket"
      },
      {
        "example": "胡麻",
        "reading": "ゴマ",
        "meaning": "sesame seeds, sesame (Sesamum indicum)"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "肉",
      "forms": [
        "⺼"
      ],
      "meaning": "meat"
    },
    "parts": [
      "十",
      "口",
      "月"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/32993_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/080e1.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/80e1.gif",
    "uri": "https://jisho.org/search/%E8%83%A1%23kanji"
  },
  "vietnameseMeaning": [
    "hồ ① Yếm cổ, dưới cổ có mảng thịt sa xuống gọi là hồ. Râu mọc ở đấy gọi là hồ tu 胡鬚. Tục viết là 鬍. ② Cổ họng, nói năng không được rành mạch gọi là hàm hồ 含胡. Cũng viết là 含糊. Nói quàng gọi là hồ thuyết 胡說, làm càn gọi là hồ vi 胡爲 hay hồ náo 胡鬧 đều noi cái ý ấy cả. ③ Sao vậy? dùng làm trợ từ, như hồ bất 胡不 sao chẳng?, hồ khả 胡可 sao khá?, sao được?, v.v. ④ Rợ Hồ. ⑤ Bát hồ, một đồ dùng về việc lễ. ⑥ Một thứ đồ binh hình cong có lưỡi đâm ngang. ⑦ Xa xôi. ① Hồ (thời cổ Trung Quốc gọi các dân tộc thiểu số ở miền bắc và miền tây là Hồ, đồng thời cũng có ý chỉ nước ngoài, ngoại tộc): 胡人 Người Hồ, dân tộc Hồ; 胡兵伺便 Quân Hồ thừa cơ quấy nhiễu (Lí Hoa: Điếu cổ chiến trường văn); ② Ẩu, bừa bãi, càn bậy, tầm bậy: 胡說 Nói ẩu, nói tầm bậy; ③ (văn) Sao, cớ sao, vì sao, gì, cái gì: 胡不歸？ Cớ sao chẳng về? (Đào Uyên Minh: Quy khứ lai từ); 胡爲乎來哉！ Vì sao mà đến vậy! (Lí Bạch: Thục đạo nan); 胡可得而法？ Làm sao có thể bắt chước theo được? (Lã thị Xuân thu); 國胡以饋之？ Quốc gia lấy gì phát cấp lương hướng cho họ? (Giả Nghị: Luận tích trữ sớ). 【胡爲】hồ vị (văn) Vì sao, cớ sao, tại sao?: 胡爲至今而不朝也？ Vì sao đến nay chưa được tặng phong để vào chầu? (Chiến quốc sách); 譆！汝非盜耶？胡爲而食我？ Ôi chao! ông không phải là kẻ trộm ư? Vì sao mà cho ta thức ăn? (Lã thị Xuân thu); ④ (văn) Mảng thịt dưới cổ, yếm cổ; ⑤ (văn) Đen: 或謔張飛胡，或笑鄧艾吃 Đứa thì ngạo Trương Phi đen, đứa thì cười Đặng Ngãi láu ăn (Lí Thương Ẩn: Kiêu nhi); ⑥ (văn) Dài lâu: 永受胡福 Mãi mãi hưởng phúc lâu dài (Nghi lễ); ⑦ (văn) Một loại đồ tế thời cổ; ⑧ (văn) Một loại binh khí thời cổ (hình cong, có lưỡi đâm ngang); ⑨ Nước Hồ (thời cổ, thuộc tỉnh An Huy ngày nay, bị Sở diệt năm 495 trước Công nguyên); ⑩ (Họ) Hồ. Như 鬍"
  ],
  "hanviet": [
    "hồ"
  ],
  "jlpt": "1",
  "frequency": "1995",
  "grade": "9"
}