{
  "id": "致",
  "kanjialiveData": null,
  "jishoData": {
    "query": "致",
    "found": true,
    "taughtIn": "junior high",
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "870",
    "strokeCount": 10,
    "meaning": "doth, do, send, forward, cause, exert, incur, engage",
    "kunyomi": [
      "いた.す"
    ],
    "onyomi": [
      "チ"
    ],
    "onyomiExamples": [
      {
        "example": "致命傷",
        "reading": "チメイショウ",
        "meaning": "fatal wound"
      },
      {
        "example": "致死",
        "reading": "チシ",
        "meaning": "lethal, fatal"
      },
      {
        "example": "招致",
        "reading": "ショウチ",
        "meaning": "invitation, summons, bidding (e.g. to host the Olympics), calling"
      },
      {
        "example": "誘致",
        "reading": "ユウチ",
        "meaning": "attraction, lure, invitation"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "致す",
        "reading": "いたす",
        "meaning": "to do"
      }
    ],
    "radical": {
      "symbol": "至",
      "meaning": "arrive"
    },
    "parts": [
      "乞",
      "厶",
      "土",
      "攵",
      "至"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/33268_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/081f4.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/81f4.gif",
    "uri": "https://jisho.org/search/%E8%87%B4%23kanji"
  },
  "hanviet": [
    "trí",
    "nhí"
  ],
  "vietnameseMeaning": [
    "trí ① Suy cùng. Như cách trí 格致 suy cùng lẽ vật. Nghiên cứu cho biết hết thảy các vật có hình, vô hình trong khoảng trời đất, nó sinh, nó diệt, nó hợp, nó li thế nào gọi là cách trí 格致. ② Hết, hết bổn phận mình với người, với vật gọi là trí. Như trí lực 致力 hết sức, trí thân 致身 đem cả thân cho người, v.v. Ðỗ Phủ 杜甫: Trường An khanh tướng đa thiếu niên, Phú quý ưng tu trí thân tảo 長安卿相多少年，富貴應須致身早 Tại Trường An, các khanh tướng phần nhiều ít tuổi, Cần phải sớm được giàu sang, sớm được dốc lòng phụng sự. ③ Dùng kế lừa cho người đến chỗ chết gọi là trí chi tử địa 致之死地 lừa vào chỗ chết. Dùng phép luật cố buộc người vào tội gọi là văn trí 文致. ④ Trao, đưa. Như trí thư 致書 đưa thư. ⑤ Trả lại cũng gọi là trí. Như trí chánh 致政 trao trả chánh quyền về hưu. ⑥ Lấy ý mình đạt cho người biết cũng gọi là trí. Như trí ý 致思 gửi ý. Vì gián tiếp mới đạt tới gọi là truyền trí 傳致 hay chuyển trí 轉致, v.v. ⑦ Ðặt để. Như trí quân Nghiêu Thuấn 致君堯舜 làm cho vua tới bực giỏi như vua Nghiêu vua Thuấn, trí thân thanh vân 致身青雲 làm cho mình tới bậc cao xa. Cứ theo một cái mục đích mình đã định mà làm cho được đều gọi là trí. ⑧ Phàm làm cái gì, hoặc vì trực tiếp hoặc vì gián tiếp, mà chịu được cái ảnh hưởng của nó đều gọi là trí. Như dĩ thương trí phú 以商致富 lấy nghề buôn mà đến giàu, trực ngôn trí hoạ 直言致禍 vì nói thẳng mà mắc hoạ. Không khó nhọc gì mà được hưởng quyền lợi gọi là toạ trí 坐致. Trong chốc lát mà liệu biện được đủ ngay gọi là lập trí 立致. ⑨ Vời lại, vời cho đến với mình gọi là trí. Như la trí 羅致 vẹt tới, săn tới, chiêu trí 招致 vời tới. Chiếu trí nhân tài 招致人才 nghĩa là vời người hiền tài đến. ⑩ Vật ngoài nó thừa cơ mà xâm vào cũng gọi là trí. Như nhân phong hàn trí bệnh 因風寒致病 nhân gió rét thừa hư nó vào mà đến ốm bệnh. Vì thế nên bị ngoại vật nó bức bách không thể không theo thế được cũng gọi là trí. Như tình trí 情致 chỗ tình nó đến, hứng trí 興致 chỗ hứng đến, v.v. ⑪ Thái độ. Như nhã nhân thâm trí 雅人深致 người có thái độ nhã lạ. Tả cái tình trạng vật gọi là cảnh trí 景致, mộc mạc gọi là chuyết trí 拙致, khác với mọi người gọi là biệt trí 別致, v.v. đều là noi cái nghĩa ấy cả. ⑫ Ðường lối. Như ngôn văn nhất trí 言文一致 lời nói lời văn cùng một lối, nói đại khái gọi là đại trí 大致 cũng do một nghĩa ấy cả. ⑬ Cùng nghĩa với chữ chí 至. ⑭ Cùng nghĩa với chữ trí 緻. ① Gởi, kính gởi, gởi tới, đưa đến, đưa, trao, tỏ ý, đọc (với ý kính trọng): 致電慰問 Gởi điện thăm hỏi; 此致敬禮 Gởi lời chào, kính chào; 致歡迎詞 Đọc lời chào mừng. (Ngr) Tận sức, hết sức: 致力于任務 Tận lực vì nhiệm vụ; ② Dẫn đến, vời đến, đem lại, gây nên: 致病 Gây nên ốm đau; 學以致用 Học để mà vận dụng; ③ Hứng thú: 興P Hứng thú, thú vị. 【致使】trí sử Khiến, làm cho: 致使蒙受損失 Làm cho bị tổn thất; ④ Tinh tế, tỉ mỉ: 細致 Tỉ mỉ; 精致 Tinh tế; ⑤ (văn) Hết, dốc hết, đem hết: 致力 Hết sức; 致身 Đem cả thân mình (để làm gì cho người khác); ⑥ (văn) Thủ đắc, có được; ⑦ (văn) Cực, tận, hết sức; ⑧ (văn) Đến (như 至, bộ 至); ⑨ (văn) Như 緻 (bộ 糸). Như 緻"
  ],
  "jlpt": "1",
  "frequency": "870",
  "grade": "8"
}