{
  "id": "與",
  "kanjialiveData": null,
  "jishoData": {
    "query": "與",
    "found": true,
    "strokeCount": 13,
    "meaning": "participate in, give, award, impart, provide, cause",
    "kunyomi": [
      "あた.える",
      "あずか.る",
      "くみ.する",
      "ともに"
    ],
    "onyomi": [
      "ヨ"
    ],
    "onyomiExamples": [
      {
        "example": "与太者",
        "reading": "ヨタモノ",
        "meaning": "hooligan, layabout, good-for-nothing, gangster"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "臼",
      "meaning": "mortar"
    },
    "parts": [
      "ハ",
      "一",
      "臼"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/33287_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/08207.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/8207.gif",
    "uri": "https://jisho.org/search/%E8%88%87%23kanji"
  },
  "hanviet": [
    "dữ"
  ],
  "vietnameseMeaning": [
    "dữ dự ① Kịp, cùng. Như phú dữ quý 富與貴 giàu cùng sang. ② Ðều. Như khả dữ ngôn thiện 可與言善 khá đều nói việc thiện. ③ Chơi thân. Như tương dữ 相與 cùng chơi, dữ quốc 國與 nước đồng minh, đảng dữ 黨與 cùng đảng, v.v. ④ Hứa cho, giúp cho. Như bất vi thời luận sở dữ 不爲時論所與 không được dư luận người đời bằng lòng. ⑤ Cấp cho. Như phó dữ 付與 giao cho, thí dữ 施與 giúp cho, v.v. ⑥ Dữ kì 與其 ví thử, dùng làm ngữ từ. Như lễ, dữ kì xa dã, ninh kiệm 禮，與其奢也，寧儉 (Luận ngữ 論語) ví thử lễ mà xa xỉ, thà tằn tiện còn hơn. ⑦ Dong dữ 容與 nhàn nhã. ⑧ Một âm là dự. Tham dự vào. Như dự văn kì sự 與聞其事 dự nghe việc đó, nói trong khi xảy ra sự việc ấy, mình cũng nghe thấy, cũng dự vào đấy. ⑨ Lại một âm là rư. Dùng làm ngữ từ, nghĩa là vậy vay! Lại dùng làm lời nói còn ngờ, nghĩa là vậy rư? thế ru? Nay thông dụng chữ dư 歟. (văn) Vậy ư?, thế ru? (trợ từ cuối câu để biểu thị sự cảm thán hoặc để hỏi, dùng như 歟, bộ 欠): 孝弟者，其爲仁之本與！ Hiếu, đễ là gốc của nhân ư! (Luận ngữ); 可不勉與？ Có thể không cố gắng ư? (Sử kí); 南方之強與？ Đó có phải là sức mạnh của phương nam không? (Trung dung). ① Với, cùng với: 與衆不同 Khác với mọi người, khác thường; 吾與子言人事 Tôi với ông nói chuyện về việc người (nhân sự) (Quốc ngữ); 古之人與民偕樂 Người xưa cùng vui với dân (Mạnh tử); 我與子異 Tôi với ông khác nhau (tôi khác với ông) (Mặc tử); ② Cho (để nêu lên đối tượng được thụ hưởng, dùng như 爲 , bộ 爪): 後若有事，吾與子圖之 Sau nếu có việc gì, tôi sẽ tính cho ông (Quốc ngữ); 陳涉少時，嘗與人擁耕 Trần Thiệp lúc thiếu thời đã từng đi cày ruộng cho người (Sử kí); 與人方便 Tiện cho mọi người; ③ (văn) Ở, tại: 坐與上風 Ngồi ở thượng phong; ④ (văn) Để cho, bị: 遂與勾踐擒，死於干隧 Bèn bị Câu Tiễn bắt, chết ở Can Toại (Chiến quốc sách); ⑤ (lt) Và: 工業與農業 Công nghiệp và nông nghiệp; 夫子之言性與天道，不可得而聞也 Phu tử nói về tính và đạo trời thì không được nghe (Luận ngữ); ⑥ (văn) Hay, hay là (biểu thị mối quan hệ chọn lựa, được nêu lên trong hai từ hoặc nhóm từ chứa đựng hai nội dung tương phản nhau): 三十年春，晉人侵鄭 ，以觀其可攻與否！ Mùa xuân năm thứ ba mươi, nước Tấn xâm lấn nước Trịnh, để quan sát xem có thể đánh được nước Trịnh hay không (Tả truyện); 不知有功德與無也 Chẳng biết có công đức hay không (Thế thuyết tân ngữ). 【與否】 dữ phủ Hay không: 設想正確與否，有待實踐檢驗 Thiết tưởng có chính xác hay không, phải chờ thực tiễn kiểm nghiệm; ⑦ (văn) Nếu: 回與執政，則由，賜焉施其能哉？ Nếu Nhan Hồi mà chấp chính thì Tử Lộ và Tử Cống còn thi thố tài năng vào đâu được? (Hàn Thi ngoại truyện). 【與...不如】 dữ... bất như (văn) Nếu... chẳng bằng: 與使斶爲慕 勢，不如使王爲趨士 Nếu để cho Xúc này mang tiếng hâm mộ thế lực, (thì) không bằng để vua được tiếng là quý chuộng kẻ sĩ (Chiến quốc sách); 與吾得革車千乘，不如聞行人燭過之一言也 Nếu ta được một ngàn cỗ chiến xa, chẳng bằng nghe được một câu nói của người đi đường Chúc Quá (Lã thị Xuân thu); 【與…不若】 dữ... bất nhược (văn) Nếu... chẳng bằng, thà... còn hơn (dùng như 與…不如): 與吾 因子而生，不若 反拘而死 Nếu tôi nhờ ông mà được sống thì thà bị bắt mà chết còn hơn (Tân tự); 【與…寧】 dữ... ninh (văn) Nếu... thì thà... còn hơn: 與爲人妻，寧爲夫子妾者 Nếu làm vợ người, thì thà làm thiếp (nàng hầu, vợ lẽ) cho phu tử còn hơn (Trang tử); 與人刃我，寧自刃 Nếu người giết ta thì ta tự giết mình còn hơn (Sử kí); 【與…豈若】dữ... khởi nhược (văn) Nếu... sao bằng. Như 與其…豈若; 【與其】dữ kì (lt) Thà... (kết hợp với 不如: 與其…不如… nếu... chẳng bằng, thà... còn hơn): 與其坐車，不如坐船 Thà đi tàu còn hơn đi xe; 與其得百里于燕，不如得十里于宋 Nếu lấy được một trăm dặm ở nước Yên thì chẳng bằng lấy được mười dặm ở Tống (Chiến quốc sách);【與其…不如】dữ kì... bất như Nếu... chẳng bằng (không bằng). Xem 與其; 【與其…不若】 dữ kì... bất nhược Nếu... chẳng bằng (không bằng), thà... còn hơn (dùng như 與其…不如): 祭禮，與其敬不足而禮有餘也，不若禮不足而敬有餘也 Trong việc tế lễ, nếu lòng kính không đủ mà lễ có thừa, (thì) chẳng bằng lễ không đủ mà lòng kính có thừa (Lễ kí); 【與其…寧】dữ kì... ninh Nếu... thì thà... còn hơn, thà... còn hơn: 禮，與其奢也，寧儉 Về lễ, nếu xa xí thì thà tiết kiệm còn hơn (thà tiết kiệm còn hơn xa xí) (Luận ngữ); 與其害于民，寧我獨死 Nếu hại dân thì thà ta chịu chết một mình còn hơn (Tả truyện); 【與其…寧其】dữ kì... ninh kì Như 與其…寧;【與其…豈如】dữ kì ... khởi như Nếu... sao bằng (há bằng): 與其閉藏之，豈如弊之身乎？ Nếu đóng nó lại để cất đi thì sao bằng che mình nó lại? (Án tử Xuân thu); 【與其…豈若】dữ kì... khởi nhược Nếu... sao bằng (há bằng) (dùng như 與其…豈如): 且而與其從闢人之士也，豈若從闢世之哉？ Vả lại nếu nhà ngươi theo những kẻ sĩ lánh người thì sao bằng theo kẻ lánh đời (Luận ngữ); ⑧ (văn) Để (nối kết trạng ngữ với vị ngữ): 是以君子擇人與交，農人擇田而田 Cho nên người quân tử chọn người để kết giao, người làm ruộng chọn ruộng mà cày (Thuyết uyển: Tạp ngôn); ⑨ (văn) Đều, hoàn toàn: 天下之君子與謂之不祥者 Các bậc quân tử trong thiên hạ đều cho họ là những kẻ không tốt (Mặc tử); ⑩ Cho, giao cho, trao cho, tán thành, đối phó: 天與不 取，反受其咎 Trời đã cho mà không nhận thì sẽ bị tội (Việt sử lược); 與其進也，不與其退也 Tán thành ông ta tiến lên, không tán thành ông ta lùi bước (Luận ngữ: Thuật nhi); 此所謂一與一，勇者得前耳 Đó gọi là một đối phó với một, người gan dạ dũng cảm tiến tới được vậy (Tam quốc chí); ⑪ (văn) Chờ đợi: 日月逝矣，歲不我與 Thời gian trôi đi mất, năm chẳng chờ đợi ta (Luận ngữ); ⑫ (văn) Viện trợ, Tham dự, dự vào: 老師參與學生們的遊戲 Thầy giáo tham dự trò chơi của các học sinh; 巍巍乎有天下而不與焉！ Cao cả thay, có thiên hạ mà không dự vào! (Luận ngữ)."
  ],
  "grade": "10"
}