{
  "id": "舉",
  "kanjialiveData": null,
  "jishoData": {
    "query": "舉",
    "found": true,
    "strokeCount": 16,
    "meaning": "raise, plan, project, behavior, actions",
    "kunyomi": [
      "あ.げる",
      "あ.がる",
      "こぞ.る"
    ],
    "onyomi": [
      "キョ"
    ],
    "onyomiExamples": [],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "臼",
      "meaning": "mortar"
    },
    "parts": [
      "ハ",
      "一",
      "二",
      "臼",
      "｜"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/33289_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/08209.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/8209.gif",
    "uri": "https://jisho.org/search/%E8%88%89%23kanji"
  },
  "hanviet": [
    "cử"
  ],
  "vietnameseMeaning": [
    "① Cất lên, giơ lên, cất nổi. Như cử thủ 舉手 cất tay, cử túc 舉足 giơ chân, cử bôi 舉杯 cất chén, v.v. ② Cử động. Như cử sự 舉事 nổi lên làm việc, cũng như ta nói khởi sự 起事. Thế cho nên có hành động gì đều gọi là cử cả. Như cử động 舉動, cử chỉ 舉止, v.v. Sự không cần làm nữa mà cứ bới vẽ ra gọi là đa thử nhất cử 多此一舉. ③ Tiến cử. Như suy cử 推舉 suy tôn tiến cử lên, bảo cử 保舉 bảo lĩnh tiến cử lên, v.v. Lệ thi hương ngày xưa ai trúng cách (đỗ) gọi là cử nhân 舉人. ④ Phàm khen ngợi hay ghi chép ai cũng gọi là cử, như xưng cử 稱舉 đề cử lên mà khen, điều cử 條舉 ghi tường từng điều để tiêu biểu lên. ⑤ Sinh đẻ, đẻ con gọi gọi là cử 舉, không sinh đẻ gọi là bất cử 不舉. ⑥ Lấy được, đánh lấy được thành gọi là cử. ⑦ Bay cao, kẻ sĩ trốn đời gọi là cao cử 高舉. Ðời sau gọi những người có kẻ có tài hơn người là hiên hiên hà cử 軒軒霞舉 cũng noi nghĩa ấy. ⑧ Ðều cả. Như cử quốc 舉國 cả nước. ⑨ Ðều. ⑩ Họp. ① Đưa lên, giơ lên, giương lên: 舉手 Giơ tay; 高舉 Giương cao; ② Ngẩng: 舉頭 Ngẩng đầu; ③ Ngước: 舉目 Ngước mắt; ④ Bầu, cử: 舉代表 Cử đại biểu; 大家公舉他當組長 Mọi người bầu anh ấy làm tổ trưởng; ⑤ Nêu ra, đưa ra, cho: 請舉一個例子 Xin cho một thí dụ; ⑥ Việc: 義舉 Việc nghĩa; ⑦ Cử động, hành động: 一舉一動 Mọi hành động; ⑧ Cả, khắp, tất cả đều, mọi, hết thảy mọi người: 舉座 Tất cả những người dự họp; 舉國歡騰 Khắp nước tưng bừng; 村人聞之，舉欣欣然 Nghe thấy thế cả làng đều mừng rỡ; 舉事無所變更 Mọi việc đều không thay đổi (Sử kí); 舉縣 Cả huyện, hết thảy mọi người trong huyện; ⑨ (văn) Đánh hạ, đánh chiếm, chiếm lĩnh: 獻公亡虢，五年而後舉虞 Hiến công mất nước Quắc, năm năm sau lại đánh hạ nước Ngu (Cốc Lương truyện: Hi công nhị niên); 戍卒叫，函谷舉 Tên lính thú (Trần Thiệp) cất tiếng hô lớn, cửa ải Hàm Cốc bị đánh chiếm (Đỗ Mục: A Phòng cung phú); ⑩ (văn) Đi thi, thi đậu, trúng cử: 愈與李賀書，勸賀舉進士 Dũ gởi thơ cho Lí Hạ, khuyên Hạ đi thi tiến sĩ (Hàn Dũ: Vĩ biện); 賀舉進士有名 Lí Hạ đỗ tiến sĩ trở thành người nổi tiếng (Hàn Dũ: Vĩ biện); ⑪ (văn) Tố cáo, tố giác: 吏見知弗舉與同罪 Quan lại phát hiện mà không tố cáo thì sẽ cùng (với người đó) có tội (Luận hoành); ⑫ (văn) Tịch thu; ⑬ (văn) Cúng tế; ⑭ (văn) Nuôi dưỡng."
  ]
}