{
  "id": "莫",
  "kanjialiveData": null,
  "jishoData": {
    "query": "莫",
    "found": true,
    "strokeCount": 10,
    "meaning": "must not, do not, be not",
    "kunyomi": [
      "くれ",
      "なか.れ",
      "なし"
    ],
    "onyomi": [
      "バク",
      "ボ",
      "マク",
      "モ",
      "ナイ"
    ],
    "onyomiExamples": [
      {
        "example": "莫大",
        "reading": "バクダイ",
        "meaning": "vast, huge, immense, enormous, colossal, malva nut (Scaphium affine)"
      },
      {
        "example": "莫逆",
        "reading": "バクギャク",
        "meaning": "cordial relations"
      },
      {
        "example": "寂寞",
        "reading": "セキバク",
        "meaning": "lonely, lonesome, dreary, desolate, deserted, forlorn"
      },
      {
        "example": "索莫",
        "reading": "サクバク",
        "meaning": "dreary, bleak, desolate"
      },
      {
        "example": "寂寞",
        "reading": "ジャクマク",
        "meaning": "lonely, lonesome, dreary, desolate, deserted, forlorn"
      },
      {
        "example": "莫斯科",
        "reading": "モスクワ",
        "meaning": "Moscow (Russia)"
      },
      {
        "example": "莫臥児",
        "reading": "モウル",
        "meaning": "lace, lacing braid, chenille yarn, tinsel, pipe cleaner, fibre, paper, etc. twisted between a pair of wires"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "勿れ",
        "reading": "なかれ",
        "meaning": "must not, do not"
      }
    ],
    "radical": {
      "symbol": "艸",
      "forms": [
        "艹"
      ],
      "meaning": "grass"
    },
    "parts": [
      "大",
      "日",
      "艾"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/33707_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/083ab.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/83ab.gif",
    "uri": "https://jisho.org/search/%E8%8E%AB%23kanji"
  },
  "hanviet": [
    "mạc"
  ],
  "vietnameseMeaning": [
    "mộ ① Tuyệt không, chẳng ai không. Như mạc bất chấn cụ 莫不震懼 chẳng ai là chẳng sợ run. ② Chớ, lời cấm chỉ. Như quân mạc vũ 君莫舞 anh chớ có múa. Lí Bạch: Nhân sinh đắc ý tu tận hoan, Mạc sử kim tôn không đối nguyệt 人生得意須盡歡，莫使金樽空對月 Người ta ở đời khi đắc ý, hãy tận vui hưởng, Chớ để chén vàng trống không trước vầng trăng. ③ Quảng mạc 廣莫 bát ngát. ④ Cùng nghĩa với chữ mạc 羃. ⑤ Yên định. ⑥ Vót. ⑦ To lớn. ⑧ Cùng nghĩa với chữ mạc 瘼. ⑨ Một âm là mộ. Cũng như chữ mộ 暮. ⑩ Lại một âm là mạch. Kì diệp mạch mạch 其葉莫莫 lá nó rậm rạp. ⑪ Một âm nữa là bá. Lặng. Quân phụ bá bá 君婦莫莫 vợ anh tính yên lặng. ⑫ Họ Mạc. ① (văn) Không ai, không có gì: 莫不欣喜 Không ai là không vui mừng; 莫知我哀 Không ai biết nỗi thương đau của ta (Thi Kinh); 天下之水，莫大於海 Nước trong thiên hạ, không gì lớn bằng biển (Trang tử); 圖久遠者，莫如西歸 Muốn tính kế lâu dài, không gì bằng về miền tây (Hàn Dũ: Tế Thập Nhị lang văn); 痛莫痛於以無國之人而談國事 Đau khổ thì không gì đau khổ hơn một người mất nước mà phải bàn luận việc nước (Phan Bội Châu: Việt Nam vong quốc sử). 【莫不】 mạc bất Ai cũng, không ai không, không gì không: 莫不爲之感動 Không ai là không cảm động; 天下莫不知而莫能行 Thiên hạ không ai không biết nhưng không ai làm được; ② Không, chẳng: 莫如 Chẳng thà, chẳng bằng; 一籌莫展 Chẳng biết làm cách nào. 【莫不是】mạc bất thị Như 莫非; 【莫非】 mạc phi Phải chăng, hay là: 莫非我聽錯了 Phải chăng tôi nghe nhầm; 今天她不來，莫非又生了病不成？Hôm nay chị ấy không đến, phải chăng lại bệnh rồi?; 【莫如】mạc như Chẳng thà, chẳng bằng, chi bằng, không gì bằng: 與其你去，莫如他來 Cậu đi, chẳng bằng anh ấy đến còn hơn;【莫若】mạc nhược Chẳng thà, chẳng bằng, chi bằng, không gì bằng: 與其坐在家裡發愁，莫若出去走走 Chẳng thà ra ngoài chơi, còn hơn ngồi cú rũ ở nhà; ③ Đừng, chớ: 莫哭 Đừng khóc; 莫性急 Đừng nóng nảy; 莫愁前路無知己 Đừng buồn trên con đường trước mặt không có người tri kỉ (Cao Thích: Biệt Đổng Đại); ④ (văn) Không (dùng như 不): 莫我肯顧 Không chịu đoái hoài đến ta (Thi Kinh: Nguỵ phong, Thạc thử); ⑤ (văn) Đại để, đại khái, chắc (có lẽ) (biểu thị sự đánh giá, suy trắc): 莫吾猶人也 Có lẽ ta cũng giống như mọi người (Luận ngữ: Thuật nhi); ⑥ (văn) Khích lệ: 其謝之也，猶未之莫與？ Ta trách ngươi, như thế chẳng phải là khích lệ ngươi ư? (Hoài Nam tử: Mậu xưng huấn); ⑦ (văn) Vót: 刀可以莫鐵 Dao có thể vót được sắt (Quản tử: Chế phân); ⑧ (văn) Mưu hoạch, mưu tính (như 謨, bộ 言): 聖人莫之 Thánh nhân mưu tính điều đó (Thi Kinh: Tiểu nhã, Xảo ngôn); ⑨ (văn) Như 瘼 (bộ 疒); ⑩ (văn) Yên định; ⑪ (văn) To lớn, rộng lớn (như 漠, bộ 氵); ⑫ (Họ) Mạc. (văn) ① Buổi chiều, chiều, muộn: 不夙則莫 Chẳng sớm thì chiều (Thi Kinh: Tề phong, Đông phương vị minh); 莫春者，春服既成 Tháng ba xuân muộn, áo mặc mùa xuân đã may xong (Luận ngữ: Tiên tiến); ② Cỏ mộ: 言采其莫 Đi hái cỏ mộ (Thi Kinh: Nguỵ phong, Phần tự như)."
  ],
  "grade": "9"
}