{
  "id": "處",
  "kanjialiveData": null,
  "jishoData": {
    "query": "處",
    "found": true,
    "strokeCount": 11,
    "meaning": "place, locale, department",
    "kunyomi": [
      "ところ",
      "-こ",
      "お.る"
    ],
    "onyomi": [
      "ショ"
    ],
    "onyomiExamples": [
      {
        "example": "他所",
        "reading": "タショ",
        "meaning": "another place, somewhere else, elsewhere, moving (to another place)"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "所",
        "reading": "ところ",
        "meaning": "place, spot, scene, site, address, district, area, locality, one's house, point, aspect, side, facet, passage (in text), part, space, room, thing, matter, whereupon, as a result, about to, on the verge of, was just doing, was in the process of doing, have just done, just finished doing, approximately, around, about"
      }
    ],
    "radical": {
      "symbol": "虍",
      "meaning": "tiger stripes"
    },
    "parts": [
      "几",
      "匕",
      "卜",
      "厂",
      "夂",
      "虍"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/34389_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/08655.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/8655.gif",
    "uri": "https://jisho.org/search/%E8%99%95%23kanji"
  },
  "hanviet": [
    "xử"
  ],
  "vietnameseMeaning": [
    "xứ ① Ở. Như cửu xử 乆處 ở lâu, cùng mọi người ở được vui hoà gọi là tương xử 相處. ② Trái lại với chữ xuất 出 ra. Như xuất xử 出處 ra ở (ra đời hay ở ẩn), xử sĩ 處士 kẻ sĩ chưa ra làm quan, xử tử 處子, xử nữ 處女 con gái chưa chồng. ③ Phân biệt được sự lí cho được phải chăng. Như xử trí 處置, khu xử 區處, v.v. ④ Ðo đắn để cầu cho yên. Như xử tâm tích lự 處心積慮 bận lòng lo nghĩ để cho xứng đáng. ⑤ Xử hình án cũng gọi là xử. Như xử trảm 處斬 xử án chém, xử giảo 處絞 xử án thắt cổ. ⑥ Vị trí, đặt để. ⑦ Về. ⑧ Thường. ⑨ Một âm là xứ. Nơi, chỗ. Như thân thủ dị xứ 身首異處 thân một nơi, đầu một nơi. Lại như trong dinh quan có chỗ tham mưu gọi là tham mưu xứ 參謀處. ⑩ Nơi nào đó. Như đáo xứ 到處 đến nơi nào đó, xứ xứ 處處 chốn chốn, nơi nơi. ① Ở, ở nhà (không ra ngoài đời hoạt động): 昔者，曾子處費 Ngày xưa, Tăng Tử ở đất Phí (Chiến quốc sách); 穴居野處 Ăn lông ở lỗ; 出處 Ra đời hay ở nhà; 處士 Kẻ sĩ chưa ra làm quan; 處子 (hay 處女) Con gái chưa chồng; ② Sống, ăn ở, ứng xử, cư xử: 和平共處 Chung sống hoà bình; 他們相處得很好 Họ cư xử với nhau rất tốt; ③ Xử trí, xử lí, giải quyết: 這事情難處理 Việc ấy khó xử trí; 區處 Khu xử; ④ Đặt vào, ở vào: 設身處地 Ở vào trường hợp... ⑤ (Xử) phạt, xử tội: 處斬 Xử án chém; 處絞 Xử án thắt cổ; 處兩年徒刑 Xử tù hai năm; 處以死刑 Xử tội tử hình. Xem 處 . ① Nơi, chỗ, chốn: 住處 Chỗ ở; 各處 Các nơi, khắp chốn; 何處 Nơi nào, chốn nào; ② Ban, phòng, xứ: 辦事處 Ban trị sự, ban quản trị, cơ quan đại diện; 人事處 Phòng nhân sự; 售票處 Phòng bán vé, chỗ bán vé. Xem 處 ."
  ]
}