{
  "id": "觀",
  "kanjialiveData": null,
  "jishoData": {
    "query": "觀",
    "found": true,
    "strokeCount": 24,
    "meaning": "outlook, look, appearance, condition, view",
    "kunyomi": [
      "み.る",
      "しめ.す"
    ],
    "onyomi": [
      "カン"
    ],
    "onyomiExamples": [
      {
        "example": "観音",
        "reading": "カンノン",
        "meaning": "Avalokiteshvara (Bodhisattva), Avalokitesvara, Kannon, Kwannon, Guanyin, Buddhist deity of compassion"
      },
      {
        "example": "観光",
        "reading": "カンコウ",
        "meaning": "sightseeing, tourism"
      },
      {
        "example": "偉観",
        "reading": "イカン",
        "meaning": "magnificent sight, grand sight, spectacular view, fine spectacle"
      },
      {
        "example": "理觀",
        "reading": "リカン",
        "meaning": "contemplation of principle"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "見",
      "meaning": "see"
    },
    "parts": [
      "十",
      "口",
      "艾",
      "見",
      "隹"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/35264_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/089c0.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/89c0.gif",
    "uri": "https://jisho.org/search/%E8%A7%80%23kanji"
  },
  "hanviet": [
    "quan"
  ],
  "vietnameseMeaning": [
    "① Xem, xem xét, xem ở chỗ rộng lớn gọi là quan. Như quan hải 觀海 xem bể, xem xét thiên văn gọi là quan tượng 觀象, xem xét dân tục gọi là quan phong 觀風, ngần ngừ không quyết gọi là quan vọng 觀望. ② Cái hình tượng đã xem, như trang quan 壯觀 xem ra lộng lẫy lắm, mĩ quan 美觀 xem ra xinh đẹp lắm. ③ Tỏ ra cho người ta biết cũng gọi là quan. Như dung quan 容觀 dáng điệu của mình đã tỏ ra. ④ Ý thức. Gặp sự thương vui không động đến tâm gọi là đạt quan 達觀, nay ta nói lạc quan 樂觀 coi là vui, bi quan 悲觀 coi là thương, chủ quan 主觀 coi là cốt, khách quan 客觀 coi là phụ, đều theo một ý ấy cả. ⑤ So sánh. ⑥ Soi làm gương. ⑦ Chơi. ⑧ Một âm là quán. Xét thấu, nghĩ kĩ thấu tới đạo chính gọi là quán. Như nhất tâm tam quán 一新三觀 một tâm mà mà xét thấu cả ba phép, chỉ quán 止觀 yên định rồi xét thấu chân tâm, như Kinh Dịch 易經 nói quán ngã sinh vô cữu 觀我生無咎 xét thấu cái nghĩa vụ của đời ta mới không mắc vào tội lỗi. Đạo Phật có phép tu dùng tai mà xem xét cõi lòng, trừ tiệt cái mầm ác trở nên bậc Vô thượng, nên gọi là phép quán 觀. Như Quan âm bồ tát 觀音菩薩, vì ngài tu bằng phép này, sáu căn dùng lẫn với nhau được, mắt có thể nghe được, nên gọi là Quán thế âm 觀世音. ⑨ Làm nhà trên cái đài gọi là quán. Như trên núi Thái sơn có cái nhà để xem mặt trời gọi là nhật quán 日觀, trong nhà vua, trong vườn hoa làm cái nhà cao để chơi cũng gọi là quán. ⑩ Các nhà thờ của đạo sĩ cũng gọi là quán. ① Xem: 走馬觀花 Cưỡi ngựa xem hoa; 以觀後效 Chờ xem hiệu quả sau này ra sao; ② Bộ mặt, hiện tượng, diện mạo, cảnh tượng: 外觀 Hiện tượng bên ngoài; 改觀 Thay đổi bộ mặt; ③ Quan niệm, quan điểm, quan; 人生觀 Nhân sinh quan, quan điểm về nhân sinh (đời sống); 世界觀 Thế giới quan. Xem 觀 . ① Nhà cất trên đài cao; ② Đền, miếu của đạo sĩ ở; ③ (Họ) Quán. Xem 觀 ."
  ]
}