{
  "id": "貫",
  "kanjialiveData": null,
  "jishoData": {
    "query": "貫",
    "found": true,
    "taughtIn": "junior high",
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "1156",
    "strokeCount": 11,
    "meaning": "pierce, 8 1/3lbs, penetrate, brace",
    "kunyomi": [
      "つらぬ.く",
      "ぬ.く",
      "ぬき"
    ],
    "onyomi": [
      "カン"
    ],
    "onyomiExamples": [
      {
        "example": "貫",
        "reading": "カン",
        "meaning": "kan (obs. unit of weight, approx. 3.75 kg, 8.3 lb), kan (obs. unit of currency, equiv. to 1000 mon in the Edo period; col. 10 mon in the Meiji period), counter for pieces of sushi, 10 points, 12 points"
      },
      {
        "example": "貫通",
        "reading": "カンツウ",
        "meaning": "passing through (of a tunnel, bullet, etc.), going (right) through, penetrating, piercing, being well versed (in)"
      },
      {
        "example": "終始一貫",
        "reading": "シュウシイッカン",
        "meaning": "consistently, unchangingly, throughout"
      },
      {
        "example": "縦貫",
        "reading": "ジュウカン",
        "meaning": "running through, traversal"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "貫く",
        "reading": "つらぬく",
        "meaning": "to go through, to pierce, to penetrate, to run through (e.g. a river through a city), to pass through, to stick to (opinion, principles, etc.), to carry out, to persist with, to keep (e.g. faith), to maintain (e.g. independence)"
      },
      {
        "example": "貫",
        "reading": "ぬき",
        "meaning": "crosspiece (between pillars, etc.), penetrating tie beam"
      },
      {
        "example": "貫き通す",
        "reading": "つらぬきとおす",
        "meaning": "to go through, to pierce, to penetrate, to stick to (opinion, principles, etc.), to carry out, to persist with, to keep (e.g. faith), to maintain (e.g. independence)"
      },
      {
        "example": "吹き抜き",
        "reading": "ふきぬき",
        "meaning": "stairwell, atrium, streamer, pennant"
      },
      {
        "example": "指貫",
        "reading": "さしぬき",
        "meaning": "type of hakama worn in ancient times"
      }
    ],
    "radical": {
      "symbol": "貝",
      "meaning": "shell"
    },
    "parts": [
      "ハ",
      "毋",
      "母",
      "目",
      "貝"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/36011_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/08cab.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/8cab.gif",
    "uri": "https://jisho.org/search/%E8%B2%AB%23kanji"
  },
  "hanviet": [
    "quán",
    "quan"
  ],
  "vietnameseMeaning": [
    "① Cái dây xâu tiền, cho nên gọi một xâu nghìn đồng tiền là nhất quán 一貫 (một quan), như vạn quán gia tư 萬貫家私 nhà giàu có đến vạn quan. Tính số tham tàng trộm cắp, tích chứa được đủ số bao nhiêu đó gọi là mãn quán 滿貫 nghĩa là như xâu tiền đã đủ quan, cho đến hết cữ vậy, vì thế nên tội ác đến cùng cực gọi là ác quán mãn doanh 惡貫滿盈. ② Suốt thông, xâu qua, như quán châu 貫珠 xâu hạt châu. Phàm đi đâu mà không có gì ngăn trở được đều gọi là quán, như trung quán nhật nguyệt 忠貫日月 lòng trung suốt qua mặt trời mặt trăng, nghĩa quán kim thạch 義貫金石 nghĩa suốt qua cả vàng đá, v.v. Thông hiểu văn nghĩa gọi là yêm quán 淹貫 hay điều quán 條貫 v.v. ③ Liền suốt, như ngư quán nhi tiến 魚貫而進 cứ lần lượt liền nối mà tiến lên. ④ Quê quán. Như hương quán 鄉貫. ⑤ Quen, như ngã bất quán dữ tiểu nhân thặng 我不貫與小人乘 (Mạnh Tử 孟子) tôi không quen cùng kẻ tiểu nhân cưỡi xe. ⑥ Hiểu thông suốt. ⑦ Tin, trúng. ⑧ Sự, như Nhưng cựu quán, như chi hà? Hà cảm cải tác 仍舊貫，如之何？何必改作 (Luận ngữ 論語) vẫn sự cũ, chẳng được sao? cần gì phải sửa đổi. ① Thông, suốt: 融會貫通 Lãnh hội thấu suốt; ② Nối nhau: 魚貫而入 Nối nhau (lần lượt) đi vào; ③ (cũ) Quan tiền; ④ Quê quán: 鄉貫 Quê hương; 本貫 Quê hương bản quán; 籍貫 Quê quán; ⑤ Quen (như 慣, bộ 忄): 我不貫與小人乘 Ta không quen đi cùng xe với kẻ tiểu nhân (Mạnh tử); ⑥ (Họ) Quán."
  ],
  "jlpt": "1",
  "frequency": "1156",
  "grade": "8"
}