{
  "id": "載",
  "kanjialiveData": null,
  "jishoData": {
    "query": "載",
    "found": true,
    "taughtIn": "junior high",
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "825",
    "strokeCount": 13,
    "meaning": "ride, board, get on, place, spread, 10**44, record, publish",
    "kunyomi": [
      "の.せる",
      "の.る"
    ],
    "onyomi": [
      "サイ"
    ],
    "onyomiExamples": [
      {
        "example": "載",
        "reading": "サイ",
        "meaning": "10^44, hundred tredecillion"
      },
      {
        "example": "採録",
        "reading": "サイロク",
        "meaning": "recording, transcription"
      },
      {
        "example": "積載",
        "reading": "セキサイ",
        "meaning": "loading, carrying"
      },
      {
        "example": "登載",
        "reading": "トウサイ",
        "meaning": "running (an article), carrying, printing, publication, registration, record, listing, inclusion (on a list)"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "乗せる",
        "reading": "のせる",
        "meaning": "to place on (something), to give (someone) a ride, to give a lift, to pick up, to help on board, to load (luggage), to carry, to take on board, to send out (on the airwaves, etc.), to deceive, to take for a ride, to (sing) along with (musical accompaniment), to let (someone) take part, to excite (someone), to publish (an article), to run (an ad)"
      },
      {
        "example": "載る",
        "reading": "のる",
        "meaning": "to be placed on, to be set on, to be piled on, to be loaded on, to appear (in print), to be mentioned, to be recorded, to be reported, to be given"
      }
    ],
    "radical": {
      "symbol": "車",
      "meaning": "cart, car"
    },
    "parts": [
      "土",
      "戈",
      "車"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/36617_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/08f09.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/8f09.gif",
    "uri": "https://jisho.org/search/%E8%BC%89%23kanji"
  },
  "hanviet": [
    "tải"
  ],
  "vietnameseMeaning": [
    "tải, tái ① Chở. Nói về người thì gọi là thừa 乘, nói về xe thì gọi là tái 載. Như tái dĩ hậu xa 載以後車 lấy xe sau chở về. Phàm dùng thuyền hay xe để chở đồ đều gọi là tái cả. Như mãn tái nhi quy 滿載而歸 xếp đầy thuyền chở về. ② Nâng. Sức nâng nổi đồ gọi là tái. Như thiên phú địa tái 天覆地載 trời che đất chở (nâng), người nào có vẻ trọng hậu gọi là tái đức chi khí 載德之器. ③ Ðầy rẫy. Như oán thanh tái đạo 怨聲載道 tiếng oán than đầy đường. ④ Trước. Như Mạnh Tử 孟子 nói Thang thuỷ chinh, tự cát tái 湯始征自葛載 vua Thang bắt đầu chinh phạt từ nước Cát trước. ⑤ Thành, nên. Như nãi canh tái ca 乃賡載歌 bèn nối thành bài hát. ⑥ Ghi chép, chép cả các việc các vật vào cả một cuốn như xe chở đủ các đồ. Như kí tái 記載 ghi chép. ⑦ Thời, dùng làm tiếng trợ ngữ. Như tái tập can qua 載戢干戈 thời thu mộc mác. ⑧ Một âm là tại. Các đồ xe thuyền chở tới. Tục thông dụng chữ tải 儎. ⑨ Lại một âm là tải. Năm, nhà Hạ 夏 gọi là tuế 歲. Nhà Thương 商 gọi là tự 祀. Nhà Chu 周 gọi là niên 年. Nhà Ðường 唐, nhà Ngô 吳 gọi là tải 載. ① Năm: 三年五載 Năm ba năm; 千載一時 Nghìn năm có một; ② Ghi, đăng (báo): 歷史記載 Ghi trong sử sách; 登載Đăng (báo). Xem 載 . ① Chở, vận tải, tải: 載貨 Chở hàng; 載重汽車 Xe tải nặng; 天覆地載 Trời che đất chở; ② Đầy, đầy rẫy, ngập: 風雪載途 Gió tuyết ngập trời; 怨聲載道 Tiếng oán than đầy đường; ③ (văn) Trợ từ đầu hoặc giữa câu (giúp cho câu được hài hoà cân xứng): 載歌載舞 Vừa ca vừa múa, múa hát tưng bừng; 乃膽衡宇，載欣載奔 Rồi trông thấy nhà, vui tươi giong ruổi (Đào Uyên Minh: Quy khứ lai từ); ④ (văn) Trước, bắt đầu: 湯始征，自葛載 Vua Thang bắt đầu chinh phạt từ nước Cát trước; 春日載陽 Tháng hai bắt đầu ấm áp (Thi Kinh); ⑤ (văn) Thành: 乃賡載歌 Bèn nối thành bài hát; ⑥ (văn) Đồ vật chở trên xe hoặc thuyền (dùng như 載 bộ 亻); ⑦ (văn) Trang sức: 載以銀鍚 Trang sức bạc và thiếc (Hoài Nam tử); ⑧ (văn) Đội: 載弁俅俅 Nón đội đẹp lộng lẫy (Thi Kinh); ⑨ (văn) Làm, đảm nhiệm: 皆使人載其事而各得其官 Đều khiến người ta làm công việc của mình mà mỗi người đều có được chức quan tương ứng (Tuân tử); ⑩ (văn) (Thì) mới: 三輔告謐，關隴載寧 Xung quanh kinh thành bình yên thì Quan Trung và Lũng Tây mới yên (Nguỵ thư); ⑪ (văn) Lại lần nữa (dùng như 再, bộ 冂): 文王載拜稽首而辭 Văn vương sụp lạy dập đầu lần nữa mà chối từ (Lã thị Xuân thu); ⑫ (văn) Nếu: 或問曰：載使子草律？ Có người hỏi: Nếu để cho ông soạn luật thì sao? (Dương tử Pháp ngôn: Tiên tri); ⑬ (Họ) Tải. Xem 載 ."
  ],
  "jlpt": "1",
  "frequency": "825",
  "grade": "8"
}