{
  "id": "轉",
  "kanjialiveData": null,
  "jishoData": {
    "query": "轉",
    "found": true,
    "strokeCount": 18,
    "meaning": "shift, move, turn",
    "kunyomi": [
      "ころ.がる",
      "ころ.げる",
      "ころ.がす",
      "ころ.ぶ",
      "まろ.ぶ",
      "うたた",
      "うつ.る"
    ],
    "onyomi": [
      "テン"
    ],
    "onyomiExamples": [
      {
        "example": "転送",
        "reading": "テンソウ",
        "meaning": "transfer (of a call, patient, etc.), forwarding (a letter, email, etc.), redirection, transfer (of data), transmission"
      },
      {
        "example": "転任",
        "reading": "テンニン",
        "meaning": "change of post"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "車",
      "meaning": "cart, car"
    },
    "parts": [
      "十",
      "厶",
      "寸",
      "田",
      "虫",
      "車"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/36681_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/08f49.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/8f49.gif",
    "uri": "https://jisho.org/search/%E8%BD%89%23kanji"
  },
  "hanviet": [
    "chuyển"
  ],
  "vietnameseMeaning": [
    "① Quay vòng, đi vòng quanh, vật gì hình tròn mà quay đi quay lại được gọi là chuyển. Như địa cầu công chuyển 地球公轉 quả đất quay chung, địa cầu tự chuyển 地球自轉 quả đất tự quay, v.v. ② Chuyển vận. Như chuyển thâu 轉輸 chuyển vận đi, tải đi. ③ Quay chiều khác, đổi dời. Như chuyển loan 轉彎 quay đi, vòng ra, chuyển cơ 轉機 quay lái xe lại. ④ Sự gì không được thẳng tới ngay gọi là chuyển. Như chuyển chí 轉致 nhờ người đến nói tỏ ý hộ, chuyển thác 轉託 lại nhờ người khác nói hộ, hỏi hộ, v.v. ⑤ Uyển chuyển. ⑥ Một âm là chuyến lấy sức mà chuyển đồ. Ðược thăng lên ngôi quan cao hơn gọi là thiên chuyến 遷轉. Phàm vật gì nó tự quay thì gọi là chuyển, mà lấy sức người hay sức máy móc mà quay động thì gọi là chuyến. ① Quay, xoay, ngoảnh: 向左轉 Quay sang bên trái, bên trái... quay; 車輪 轉得快 Bánh xe quay nhanh; ② Chuyển, chuyển biến, thay đổi, chuyển trở lại: 情況好轉 Tình hình chuyển biến (thay đổi) tốt; 這封信由我轉給他 Lá thư này do tôi chuyển cho anh ấy; 轉敗爲勝 Chuyển bại thành thắng; ③ Uyển chuyển.Xem 轉 . Quay, xoay: 地球繞太陽轉 Trái đất quay quanh mặt trời. Xem 轉 ."
  ],
  "grade": "10"
}