{
  "id": "那",
  "kanjialiveData": null,
  "jishoData": {
    "query": "那",
    "found": true,
    "taughtIn": "junior high",
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "1621",
    "strokeCount": 7,
    "meaning": "what?",
    "kunyomi": [
      "なに",
      "なんぞ",
      "いかん"
    ],
    "onyomi": [
      "ナ",
      "ダ"
    ],
    "onyomiExamples": [
      {
        "example": "那覇",
        "reading": "ナハ",
        "meaning": "Naha (city in Okinawa)"
      },
      {
        "example": "那覇港湾空港工事事務所",
        "reading": "ナハコウワンクウコウコウジジムショ",
        "meaning": "Naha Harbour and Airport Construction Office"
      },
      {
        "example": "刹那",
        "reading": "セツナ",
        "meaning": "moment, instant, kshana, duration of a single mental event (about 1/75 second), shortest possible interval of time"
      },
      {
        "example": "印度支那",
        "reading": "インドシナ",
        "meaning": "Indochina"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "邑",
      "forms": [
        "阝"
      ],
      "meaning": "town (阝 right)"
    },
    "parts": [
      "二",
      "刀",
      "邦"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/37027_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/090a3.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/90a3.gif",
    "uri": "https://jisho.org/search/%E9%82%A3%23kanji"
  },
  "hanviet": [
    "na"
  ],
  "vietnameseMeaning": [
    "na nả na ná ① Nhiều. Như kinh Thi có câu: Thụ phúc bất na 受福不那 chịu phúc chẳng nhiều. ② An nhàn. Như hữu na kì cư 有那其居 chỗ ở an nhàn. ③ Nào, gì. ④ A na 阿那 xinh xắn mềm mại. ⑤ Tiếng Phạn, Chi na 支那 nước Tàu, duy na 維那 kẻ giữ phép trong chùa, đàn na 檀那 kẻ bố thí, cũng gọi là đàn việt 檀越, sát na 剎那 một loáng, nói cái thời gian rất ngắn. ⑥ Một âm là nả. Nào. Như nả xứ 那處 chỗ nào, nả kham 那堪 sao chịu được. Cũng có khi đọc là na. Như 哪 (Họ) Na. Xem 那 , , . Làm sao (như 哪 , bộ 口): 早歲那知世事難 Tuổi trẻ sao biết được đường đời là khó (Lục Du: Thư phẫn); 阿婆不嫁女，那得孫兒抱？ Bà ơi không gả con gái, thì sao có được cháu bồng (Cổ nhạc phủ: Chiết dương liễu chi ca); 仙境那能卻再來？ Cảnh tiên làm sao trở lại được nữa? (Tào Đường: Tiên tử tống Lưu Nguyễn xuất động). ① Ấy, đó, kia: 那個人 Người ấy; 那是我的過錯 Đó là sai sót của tôi; 那是一九五四年的事 Đó là chuyện năm 1954; 那兩棵古樹 Hai cây cổ thụ kia; 那會兒 Khi đó, khi ấy, lúc ấy; 那裡 Chỗ đó, nơi đó, ở đó; 那兒 Chỗ đó, nơi đó, ở đó, lúc đó; 那時 Lúc đó, khi đó, hồi đó, bấy giờ; 那些 Những... ấy, những... đó, những... kia; ② Vậy, vậy thì, thế thì: 你要是跟我們一起走，那就快點 Anh muốn đi cùng chúng tôi, thế thì nhanh lên; 那我就不再等了 Vậy thì tôi không chờ nữa. 【那麼】 na ma a. Thế, như thế, như vậy, thế đấy: 你不該那麼 做 Anh không nên làm như vậy; 問題沒有他想像那麼複雜 Vấn đề không phức tạp như anh ấy tưởng tượng thế đó; b. Khoảng chừng, vào khoảng: 拿 那麼三四十個袋子就夠了 Lấy khoảng chừng ba bốn chục cái túi là đủ; c. Thế thì, vậy thì: 既然這樣不行，那麼你打算怎麼辦呢？ Đã không được, vậy thì anh tính làm thế nào?; 【那麼點兒】 na ma điểm nhi Chừng ấy, thế kia: 那麼點兒事 Chừng ấy việc; 那麼點兒小問題，何必麻煩人家 Vấn đề nhỏ thế kia, việc gì mà phải đi phiền người ta; 【那麼些】na ma ta Ngần ấy: 她一個人·Ó顧那麼些孩子，眞不容易 Một mình chị ta chăm sóc ngần ấy đứa trẻ, thật không phải dễ; 那麼些¸ê料 Ngần ấy tư liệu; 【那麼着】 na ma trước Như thế, như vậy, thế, vậy: 那麼着也許好些 Như vậy có thể tốt hơn; 你老那麼着，人家會發火的 Anh cứ thế mãi, người ta sẽ nổi giận đấy; 【那樣】na dạng Thế, vậy, như thế, như vậy: 那樣也好 Như thế cũng tốt; 他并不是你所想像的那樣 Anh ấy không phải như anh tưởng tượng thế đâu; 沒有那樣的事 Không có chuyện như vậy; 有房子那樣大 To bằng gian nhà vậy; ③ (văn) Nhiều: 受福不那 Chịu phúc chẳng nhiều (Thi Kinh); ④ (văn) An nhàn: 有那其居 Chỗ ở an nhàn; ⑤ Từ dùng để phiên âm tiếng nước ngoài: 支那 Nước Tàu; 檀那 Kẻ bố thí. Xem 那 , , . (khn) Ấy, đó, kia (thường dùng kết hợp dưới dạng 那一). Xem 那 , , ."
  ],
  "jlpt": "1",
  "frequency": "1621",
  "grade": "8"
}