{
  "id": "錯",
  "kanjialiveData": null,
  "jishoData": {
    "query": "錯",
    "found": true,
    "taughtIn": "junior high",
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "1740",
    "strokeCount": 16,
    "meaning": "confused, mix, be in disorder",
    "kunyomi": [],
    "onyomi": [
      "サク",
      "シャク"
    ],
    "onyomiExamples": [
      {
        "example": "錯誤",
        "reading": "サクゴ",
        "meaning": "mistake, error, discrepancy, discrepancy between one's actions and intentions"
      },
      {
        "example": "錯綜",
        "reading": "サクソウ",
        "meaning": "becoming complicated, becoming involved, being intricate, becoming entangled, becoming jumbled, becoming mixed up"
      },
      {
        "example": "交錯",
        "reading": "コウサク",
        "meaning": "mixture, blending, complication, crossing, intersecting, interlacing"
      },
      {
        "example": "性倒錯",
        "reading": "セイトウサク",
        "meaning": "paraphilia, sexual deviancy"
      },
      {
        "example": "介錯",
        "reading": "カイシャク",
        "meaning": "beheading (as the ending to a seppuku), assistance, help"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "金",
      "forms": [
        "釒"
      ],
      "meaning": "metal, gold"
    },
    "parts": [
      "二",
      "廾",
      "日",
      "金"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/37679_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/0932f.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/932f.gif",
    "uri": "https://jisho.org/search/%E9%8C%AF%23kanji"
  },
  "hanviet": [
    "thác",
    "thó"
  ],
  "vietnameseMeaning": [
    "thố, thác ① Hòn đá ráp, đá mài. Kinh Thi 詩經 có câu: Tha sơn chi thạch, khả dĩ vi thác 他山之石可以爲錯 đá ở núi khác có thể lấy làm đá mài, ý nói bè bạn hay khuyên ngăn cứu chính lại lỗi lầm cho mình. ② Thác đao 錯刀 cái giũa. ③ Giao thác 交錯 lần lượt cùng đắp đổi. ④ Lẫn lộn. Các đồ hải vị nó có nhiều thứ lẫn lộn như nhau nên gọi là hải thác 海錯. ⑤ Lầm lẫn. La Thiện Uy đời Ngũ đại nói: Hợp lục châu tứ thập tam huyện thiết bất năng chú thử thác 合六洲四十三縣鐵不能鑄此錯 đem cả sắt trong sáu châu bốn mươi ba huyện không hay đúc hết lỗi lầm ấy. Ý nói lầm to lắm. ⑥ Cùng nghĩa với chữ thố 措. Như thố trí 措置 xếp đặt. Có khi viết là 錯置. ① Sai, lầm, nhầm: 做錯 Làm sai; 聽錯 Nghe nhầm; 你弄錯了 Anh đã nhầm rồi; ② Xấu, kém (thường dùng với chữ 不 ): 不錯 Khá, đúng, phải; ③ Xen kẽ, lẫn lộn: 犬牙交錯的戰爭 Chiến tranh cài răng lược; ④ Rẽ, tách: 錯開 Rẽ ra, tách ra, tránh ra; ⑤ Nghiến (răng): 上下牙錯得嘎吱嘎吱直響 Tiếng nghiến răng kèn kẹt; ⑥ (văn) Đá mài: 他山之石，可以爲錯 Đá ở núi khác có thể dùng làm đá mài dao (Thi Kinh: Tiểu nhã, Hạc minh); ⑦ (văn) Mài (dao, ngọc...): 不琢不錯 Chẳng giũa chẳng mài (Tiềm phu luận: Tán học); ⑧ (văn) Cái giũa: 錯者，所以治鋸 Giũa là đồ dùng để sửa cưa (Liệt nữ truyện: Lỗ Tang Tôn mẫu); ⑨ (văn) Mạ, tô, quét, bôi (vàng, bạc...): 夫剪髮文身，錯臂左衽，甌越之民也 Cắt tóc xăm mình, bôi tay và mặc áo trái vạt, đó là giống dân Âu Việt (Sử kí: Việt thế gia); ⑩ (văn) Không hợp, trái: 與仲舒錯 Không hợp với Trọng Thư (Hán thư: Ngũ hành chí, thượng); ⑪ (văn) Sắp đặt (như 措, bộ 扌)."
  ],
  "jlpt": "1",
  "frequency": "1740",
  "grade": "8"
}