{
  "id": "闕",
  "kanjialiveData": null,
  "jishoData": {
    "query": "闕",
    "found": true,
    "strokeCount": 18,
    "meaning": "lack, gap, fail, imperial palace",
    "kunyomi": [
      "か.ける"
    ],
    "onyomi": [
      "ケツ"
    ],
    "onyomiExamples": [
      {
        "example": "欠員",
        "reading": "ケツイン",
        "meaning": "vacant position, vacancy, opening, unfilled position"
      },
      {
        "example": "欠乏",
        "reading": "ケツボウ",
        "meaning": "deficiency, insufficiency, shortage, lack, want, dearth, scarcity"
      },
      {
        "example": "補欠",
        "reading": "ホケツ",
        "meaning": "filling a vacancy, supplementation, substitute, deputy, alternate, spare"
      },
      {
        "example": "帝闕",
        "reading": "テイケツ",
        "meaning": "imperial palace gate, imperial palace"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "欠ける",
        "reading": "かける",
        "meaning": "to chip, to be chipped, to break (off), to be damaged, to be missing (from a set, team, etc.), to be absent, to become lost, to be lacking (in), to be short (of), to be deficient, to be wanting (in), to wane (of the moon), to go into eclipse"
      }
    ],
    "radical": {
      "symbol": "門",
      "meaning": "gate"
    },
    "parts": [
      "屮",
      "并",
      "欠",
      "門"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/38357_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/095d5.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/95d5.gif",
    "uri": "https://jisho.org/search/%E9%97%95%23kanji"
  },
  "vietnameseMeaning": [
    "① Cái cổng hai từng. Làm hai cái đài ngoài cửa, trên làm cái lầu, ở giữa bỏ trống để làm lối đi gọi là khuyết, cho nên gọi cửa to là khuyết. Cũng có khi gọi là tượng nguỵ 象魏. Ngày xưa hay làm sở ban bố pháp lệnh ở ngoài cửa cung, cho nên gọi cửa cung là khuyết. Như phục khuyết thướng thư 伏闕上書 sụp ở ngoài cửa cung mà dâng thư. ② Lầm lỗi. Nhà Đường 唐 có đặt ra hai chức quan tả thập di 左拾遺 và hữu bổ khuyết 右補闕 chuyên về việc khuyên can các điều lầm lỗi của vua. ③ Còn thiếu, còn trống. Cùng nghĩa với chữ khuyết 缺. Phàm cái gì chưa được hoàn toàn còn phải bù thêm mới đủ thì đều gọi là khuyết. Như khuyết văn 闕文 văn còn thiếu mất, còn sót chưa đủ. ① Lầm lỗi: 闕失 Sai trái; ② Còn khuyết, còn trống (dùng như 缺 , bộ 缶): 闕文 Bài văn còn thiếu mất; ③ (Họ) Khuyết. Xem 闕 . (cũ) Lầu gác trước cung, cửa khuyết. (Ngr) Cung khuyết, cung điện. Xem 闕 ."
  ],
  "hanviet": [
    "khuyết"
  ]
}