{
  "id": "關",
  "kanjialiveData": null,
  "jishoData": {
    "query": "關",
    "found": true,
    "strokeCount": 19,
    "meaning": "connection, barrier, gateway, involve, concerning",
    "kunyomi": [
      "せき",
      "かか.わる",
      "からくり",
      "かんぬき"
    ],
    "onyomi": [
      "カン"
    ],
    "onyomiExamples": [
      {
        "example": "関東軍",
        "reading": "カントウグン",
        "meaning": "Kwantung Army (Japanese armed forces in Manchukuo)"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "門",
      "meaning": "gate"
    },
    "parts": [
      "幺",
      "門"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/38364_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/095dc.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/95dc.gif",
    "uri": "https://jisho.org/search/%E9%97%9C%23kanji"
  },
  "hanviet": [
    "quan"
  ],
  "vietnameseMeaning": [
    "① Đóng. Như môn tuy thiết nhi thường quan 門雖設而常關 (Ðào Uyên Minh 陶淵明) tuy có làm cửa đấy nhưng vẫn đóng luôn. ② Cái dõi cửa, dùng một cái trục gỗ cài ngang cửa lại gọi là quan. Cho nên then chốt trên cửa gọi là quan kiện 關鍵. Nói rộng ra thì các máy móc trong các đồ đều gọi là cơ quan 機關. Phàm các cái cốt yếu của sự vật gì hay chỗ tổng cục phân phát đi đều gọi là quan kiện hay là cơ quan. Như ta nói cơ quan truyền bá, cơ quan phát hành, v.v. ③ Cửa ải. Như biên quan 邊關 cửa ải ngoài biên, chỗ nước này giáp với nước khác. ④ Cửa ô. Đặt ở các nơi ách yếu để tra xét hành khách và hàng hoá gọi là quan. Ngày xưa đặt cửa ô chỉ để tra xét hành khách, đời sau mới đánh thuế. Như sách Mạnh Tử 孟子 nói quan cơ nhi bất chinh 關譏而不征 cửa ô chỉ để tra xét hành khách mà không đánh thuế. ⑤ Giới hạn. Như thánh vực hiền quan 聖域賢關 cõi thánh bực hiền. Nay gọi cuối năm là niên quan tại nhĩ 年關在邇 cũng bởi nghĩa đó (cái hạn năm nó đã gần hết cũ sang mới). ⑥ Quan hệ. Hai bên cùng có liên thuộc với nhau gọi là quan. Nay gọi sự để lòng thắc mắc nhớ luôn là quan tâm 關心 hay quan hoài 關懷 cũng bởi nghĩa đó. Nguyễn Du 阮攸: Quan tâm nhất dạ khổ vô thuỵ 關心一夜苦無睡 (Thăng Long 升龍) nghĩ ngợi thâu đêm khổ tâm không ngủ được. ⑦ Cách bức. Như quan thuyết 關說 lời nói cách bức, do một người khác nhắc lại, chứ không phải lời nói trước mặt. ⑧ Các văn bằng để đi lãnh lương gọi là quan hưởng 關餉. Hai bên cùng đính ước với nhau gọi là quan thư 關書. ⑨ Quan quan 關關 tiếng con chim thư cưu kêu. ⑩ Mạch quan. Nhà làm thuốc chia ba bộ mạch, cứ nơi cổ tay, lấy cái xương chồi đằng sau làm cữ, giữa gọi là mạch quan. ⑪ Tên đất. Một âm là loan. Dương. Như Việt nhân loan cung nhi xạ chi 越人關弓而射之 người Việt dương cung mà bắn đấy. ① Đóng, khép, tắt, đậy kín, bịt kín: 關窗戶 Đóng cửa sổ; 關燈 Tắt đèn; 把門關上 Khép cửa lại; 門雖設而常關 Cửa tuy có nhưng thường khép luôn (Đào Uyên Minh: Quy khứ lai từ); ② Giam, bỏ tù: 把這個流氓分子關起來 Giam tên lưu manh này lại; ③ Cửa ải, cửa biên giới, quan: 過關 Vượt qua cửa ải; ④ Cửa ô (ngày xưa), hải quan, hàng rào hải quan (thời nay): 關機而不征 Cửa ô chỉ tra xét hành khách mà không đánh thuế (Mạnh tử); ⑤ Dính dáng, liên quan, quan hệ: 責任由我負，不關你們的事 Tôi chịu trách nhiệm, không liên quan đến các anh. 【關于】quan vu Về: 關于工業化問題 Về vấn đề công nghiệp hoá; ⑥ Dàn xếp, làm môi giới; ⑦ Lãnh (lương, tiền...): 關餉 Lãnh lương; ⑧ (văn) Dõi cửa; ⑨ (văn) Điểm then chốt, bước quyết định; ⑩ (y) Mạch quan; ⑪ 【關關】 quan quan (thanh) Quan quan (tiếng chim kêu): 關關睢鳩，在河之州 Quan quan cái con thư cưu, con sống con mái cùng nhau bãi ngoài (Thi Kinh); ⑫ Tên đất: 關中 Quan Trung; ⑬ (Họ) Quan."
  ]
}