{
  "id": "陰",
  "kanjialiveData": null,
  "jishoData": {
    "query": "陰",
    "found": true,
    "taughtIn": "junior high",
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "1393",
    "strokeCount": 11,
    "meaning": "shade, yin, negative, sex organs, secret, shadow",
    "kunyomi": [
      "かげ",
      "かげ.る"
    ],
    "onyomi": [
      "イン"
    ],
    "onyomiExamples": [
      {
        "example": "陰",
        "reading": "イン",
        "meaning": "(the) negative (e.g. pole), yin (in Chinese divination), hidden place, unseen part, private location"
      },
      {
        "example": "陰謀",
        "reading": "インボウ",
        "meaning": "plot, intrigue, scheme, conspiracy, agreement between two or more people to commit an unlawful act"
      },
      {
        "example": "山陰",
        "reading": "ヤマカゲ",
        "meaning": "place in the shade of a mountain, shelter of the mountains, mountain recess"
      },
      {
        "example": "外陰",
        "reading": "ガイイン",
        "meaning": "vulva, pudenda"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "陰",
        "reading": "かげ",
        "meaning": "shade, shadow, behind (something), other side, back, the background, behind the scenes, behind someone's back, gloom (in someone's expression, nature, etc.), darkness"
      },
      {
        "example": "陰口",
        "reading": "かげぐち",
        "meaning": "malicious gossip, backbiting, speaking ill behind someone's back"
      },
      {
        "example": "山陰",
        "reading": "やまかげ",
        "meaning": "place in the shade of a mountain, shelter of the mountains, mountain recess"
      },
      {
        "example": "物陰",
        "reading": "ものかげ",
        "meaning": "place hidden from view, cover, shelter, hiding place"
      },
      {
        "example": "陰る",
        "reading": "かげる",
        "meaning": "to become clouded, to darken, to get dark, to become hidden (behind clouds), to darken (of a face), to worsen, to deteriorate, to become gloomy"
      }
    ],
    "radical": {
      "symbol": "阜",
      "forms": [
        "阝"
      ],
      "meaning": "mound, dam (阝 left)"
    },
    "parts": [
      "一",
      "个",
      "二",
      "厶",
      "阡"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/38512_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/09670.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/9670.gif",
    "uri": "https://jisho.org/search/%E9%99%B0%23kanji"
  },
  "hanviet": [
    "âm"
  ],
  "vietnameseMeaning": [
    "ấm ① Số âm, phần âm, trái lại với chữ dương 陽. Phàm sự vật gì có thể đối đãi lại, người xưa thường dùng hai chữ âm dương 陰陽 mà chia ra. Như trời đất, mặt trời mặt trăng, rét nóng, ngày đêm, trai gái, trong ngoài, cứng mềm, động tĩnh, v.v. đều chia phần này là dương, phần kia là âm. Vì các phần đó nó cùng thêm bớt thay đổi nhau, cho nên lại dùng để xem tốt xấu nữa. Từ đời nhà Hán 漢 trở lên thì những nhà xem thuật số đều gọi là âm dương gia 陰陽家. ② Dầm dìa. Như âm vũ 陰雨 mưa dầm. ③ Mặt núi về phía bắc gọi là âm. Như sơn âm 山陰 phía bắc quả núi. ④ Chiều sông phía nam gọi là âm. Như giang âm 江陰 chiều sông phía nam, hoài âm 淮陰 phía nam sông Hoài, v.v. ⑤ Bóng mặt trời. Như ông Đào Khản 陶侃 thường nói Đại Vũ tích thốn âm, ngô bối đương tích phân âm 大禹惜寸陰，吾輩 當惜分陰 vua Đại Vũ tiếc từng tấc bóng mặt trời, chúng ta nên tiếc từng phân bóng mặt trời. ⑥ Chỗ rợp, chỗ nào không có bóng mặt trời soi tới gọi là âm. Như tường âm 牆陰 chỗ tường rợp. ⑦ Mặt trái, mặt sau. Như bi âm 碑陰 mặt sau bia. ⑧ Ngầm, phàm làm sự gì bí mật không cho người biết đều gọi là âm. Như âm mưu 陰謀 mưu ngầm, âm đức 陰德 cái phúc đức ngầm không ai biết tới. ⑨ Nơi u minh. Như âm khiển 陰譴 sự trách phạt dưới âm ty (phạt ngầm). Vì thế nên mồ mả gọi là âm trạch 陰宅. ① Âm u, đen tối: 陰暗 Đen tối; ② Râm: 天陰 Trời râm; ③ Âm (trái với dương): 陰陽 Âm và dương; ④ Tính âm, (thuộc) giống cái; ⑤ Mặt trăng: 月陰 Mặt trăng; ⑥ Bờ nam sông: 淮陰 Bờ nam sông Hoài; ⑦ Phía bắc núi: 華陰 Phía bắc núi Hoa Sơn; ⑧ Ngầm, bí mật: 齊使者如梁，孫臏以刑徒陰見 Sứ giả của Tề đi qua nước Lương, Tôn Tẫn lấy tư cách là tù nhân bí mật đến gặp sứ giả (Sử kí: Tôn Tử Ngô Khởi liệt truyện).【陰溝】âm câu Cống ngầm; ⑨ Lõm: Xem 陰文; ⑩ Cõi âm, âm ti, âm phủ: 陰司 Âm ti; ⑪ Chỗ rợp, bóng rợp, bóng mát: 樹陰 Bóng mát, bóng cây; ⑫ (văn) Bóng mặt trời: 大禹惜寸陰，吾輩當惜分陰 Vua Đại Vũ tiếc từng tấc bóng mặt trời, còn chúng ta nên tiếc từng phân bóng mặt trời (Đào Khản); ⑬ (văn) Mặt trái, mặt sau: 碑陰 Mặt sau tấm bia; ⑭ Thâm độc, nham hiểm; ⑮ Bộ sinh dục (có khi chỉ riêng bộ sinh dục nữ giới); ⑯ (Họ) Âm. Như 蔭 (bộ 艹) và 陰 nghĩa ⑪."
  ],
  "jlpt": "1",
  "frequency": "1393",
  "grade": "8"
}