{
  "id": "隨",
  "kanjialiveData": null,
  "jishoData": {
    "query": "隨",
    "found": true,
    "strokeCount": 16,
    "meaning": "at the mercy of (the waves)",
    "kunyomi": [
      "まにまに",
      "したが.う"
    ],
    "onyomi": [
      "ズイ"
    ],
    "onyomiExamples": [
      {
        "example": "随筆",
        "reading": "ズイヒツ",
        "meaning": "essays, miscellaneous writings, literary jottings"
      },
      {
        "example": "随分",
        "reading": "ズイブン",
        "meaning": "very, extremely, surprisingly, fairly, quite, considerably, awfully, terribly, terrible, horrid, contemptible, reprehensible, remarkable, extraordinary"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "従う",
        "reading": "したがう",
        "meaning": "to obey (an order, law, etc.), to abide by (a rule, custom, etc.), to follow, to observe, to conform to, to yield to, to follow (a person), to accompany, to go with, to go alongside (e.g. a river), to follow (e.g. a sign), to serve (as), to engage in (work)"
      }
    ],
    "radical": {
      "symbol": "阜",
      "forms": [
        "阝"
      ],
      "meaning": "mound, dam (阝 left)"
    },
    "parts": [
      "ノ",
      "一",
      "工",
      "月",
      "込",
      "阡"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/38568_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/096a8.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/96a8.gif",
    "uri": "https://jisho.org/search/%E9%9A%A8%23kanji"
  },
  "hanviet": [
    "tuỳ"
  ],
  "vietnameseMeaning": [
    "① Theo sau. Cứ đi theo sau chân người, đi nghỉ chóng chầy đều tùy người gọi là tùy. ② Xướng tùy 倡隨 đạo vợ chồng, gióng lên trước là xướng, thuận theo sau là tùy. Phu xướng phụ tùy 夫倡婦隨, lời ông Quan Duẫn Tử 關尹子 nói, ý nói chồng hay lấy ý đốc suất người, vợ hay thuận theo lời chồng chỉ bảo vậy. ③ Thuận. Như tùy khẩu 隨口 thuận miệng, tùy thủ 隨手 thuận tay, v.v. ④ Tùy cơ mà ứng ngay. Như tùy thời 隨時 tùy thời mà xử, tùy xứ 隨處 tùy nơi mà định, v.v. ⑤ Ngón chân. ⑥ Tùy hỉ 隨喜 tiếng nhà Phật, nói nghĩa hẹp là tùy ý mình thích mà làm như bố thí, cúng dâng, v.v. Nói nghĩa rộng thì đi thăm cảnh chùa cũng gọi là tùy hỉ, người ta làm việc thiện mình không làm chỉ thêm vào cũng gọi là tùy hỉ, không ứng theo người hành động gì cũng gọi là tùy hỉ. ① Đi theo: 我 隨着大家一起去 Tôi sẽ đi theo mọi người; ② Vừa... vừa...: 隨說隨記 Vừa nói vừa ghi; ③ Bất kì, lúc nào cũng: 隨時注意 Lúc nào cũng chú ý; ④ Tùy theo, tuân theo, phục tùng: 隨他的便 Tùy (theo) anh ấy; 隨意 Tùy ý; 隨便 Tùy ý, tùy tiện, tùy thích, tự do, cẩu thả, xuê xoa; 隨後 Sau đó, sau, tiếp theo; 隨即 Lập tức, tức khắc, ngay, bèn. 【隨時】tùy thời a. Sẵn sàng: 隨時准備殲滅對方 Sẵn sàng tiêu diệt đối phương; b. Bất cứ lúc nào: 隨時糾正錯誤 Sửa chữa sai lầm bất cứ lúc nào; 【隨着】tùy trước Theo đà, theo: 隨着時間 的推移 Theo thời gian trôi qua; 隨着工業的發展 Theo đà phát triển của công nghiệp; ⑤ Tiện, thuận: 隨手關門 Tiện tay đóng cửa lại; 隨口 Thuận miệng; ⑥ Giống, như: 他長得隨他父親 Anh ấy giống cha; ⑦ (văn) Ngón chân."
  ]
}