{
  "id": "隱",
  "kanjialiveData": null,
  "jishoData": {
    "query": "隱",
    "found": true,
    "strokeCount": 17,
    "meaning": "hide, conceal, cover",
    "kunyomi": [
      "かく.す",
      "かく.れる",
      "よ.る"
    ],
    "onyomi": [
      "イン",
      "オン"
    ],
    "onyomiExamples": [
      {
        "example": "隠語",
        "reading": "インゴ",
        "meaning": "secret language, jargon, cant, argot, slang"
      },
      {
        "example": "隠忍",
        "reading": "インニン",
        "meaning": "patience, endurance, undercover ninja, embedded ninja"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "隠す",
        "reading": "かくす",
        "meaning": "to hide, to conceal"
      }
    ],
    "radical": {
      "symbol": "阜",
      "forms": [
        "阝"
      ],
      "meaning": "mound, dam (阝 left)"
    },
    "parts": [
      "ヨ",
      "工",
      "心",
      "爪",
      "阡"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/38577_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/096b1.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/96b1.gif",
    "uri": "https://jisho.org/search/%E9%9A%B1%23kanji"
  },
  "hanviet": [
    "ẩn"
  ],
  "vietnameseMeaning": [
    "ẩn ① Ẩn nấp, không hiện rõ ra. Như cơ vạ loạn còn ẩn nấp chưa phát ra gọi là ẩn hoạn 隱患, mối tình không thể bộc bạch cho ai nấy đều biết được gọi là ẩn tình 隱情, v.v. ② Ẩn trốn. Học trò không cần ra làm quan mà lánh đời ở ẩn một chỗ gọi là ẩn luân 隱淪 hay ẩn dật 隱逸. ② Ẩn nấp. Dùng cái đồ gì che kín mình khiến cho người không trông thấy được gọi là ẩn. Như ẩn ư bình hậu 隱於屏後 nấp ở sau bình phong. ③ Giấu. Sự gì biết rõ mà giấu kín không nói cho ai biết gọi là ẩn. Như tử vị phụ ẩn 子爲父隱 con giấu cho cha. ④ Giấu giếm, biết mà không nói, nói không hết ý gọi là ẩn. Như sách Luận ngữ 論語 nói Nhị tam tử dĩ ngã vi ẩn hồ, ngô vô ẩn hồ nhĩ 二三子以我爲隱乎，吾無隱乎爾 (Thuật nhi 述而) hai ba anh cho ta là giấu giếm gì chăng, ta không có giấu giếm gì cả. ⑤ Khốn khổ. Những điều dân lấy làm lo làm khổ gọi là dân ẩn 民隱. ⑥ Xót, nghĩ. Như Mạnh tử 孟子 nói Vương nhược ẩn kì vô tội nhi tựu tử địa 王若隱其無罪而就死地 nhà vua nếu xót nghĩ đến kẻ không có tội mà tới chỗ chết. ⑦ Sự gì chưa rõ ràng mà đã hơi có ý lộ ra gọi là ẩn. Như ẩn ẩn 隱隱 lờ mờ, ẩn nhiên 隱然 hơi ro rõ vậy, ẩn ước 隱約 lấp ló, v.v. ⑧ Lời nói đố. ⑨ Tường thấp. ⑩ Một âm là ấn. Tựa. Như ấn kỉ nhi ngoạ 隱几而臥 tựa ghế mà nằm, ẩn nang 隱囊 tựa gối. Tục viết là 隠. Xem 隱. ① Giấu, ẩn giấu, ẩn nấp, ẩn trốn, kín đáo, ngấm ngầm: 隱瞞 Giấu giếm, che đậy; 隱患 Tai hoạ ngầm; 隱逸 Ẩn dật, lánh đời; 隱於屏後 Nấp sau tấm bình phong; 子爲父隱 Con giấu cho cha; 二三子以我爲隱乎？ Hai ba anh cho ta là có giấu giếm gì chăng? (Luận ngữ); ② (văn) Đau lòng, thương xót, trắc ẩn: 王若隱其無罪而就死地 Nhà vua nếu xót thương cho con vật không có tội mà phải đi tới chỗ chết (Mạnh tử); ③ (văn) Không rõ ràng, mơ hồ, lờ mờ: 隱隱 Lờ mờ; 隱約 Lập lờ; ④ (văn) Điều bí ẩn, điều khó hiểu; ⑤ (văn) Thiếu thốn, nghèo túng, khốn khổ: 民隱 Nỗi khốn khổ của dân; ⑥ (văn) Xem xét; ⑦ (văn) Tường thấp; ⑧ (văn) Lời nói dối; ⑨ (văn) Tựa, dựa: 隱几而臥 Tựa ghế mà nằm; 隱囊 Tựa gối; ⑩ (Họ) Ẩn."
  ]
}