{
  "id": "雖",
  "kanjialiveData": null,
  "jishoData": {
    "query": "雖",
    "found": true,
    "strokeCount": 17,
    "meaning": "although, however",
    "kunyomi": [
      "いえど.も",
      "これ"
    ],
    "onyomi": [
      "スイ"
    ],
    "onyomiExamples": [],
    "kunyomiExamples": [
      {
        "example": "雖も",
        "reading": "いえども",
        "meaning": "even though, despite, notwithstanding"
      }
    ],
    "radical": {
      "symbol": "隹",
      "meaning": "small bird"
    },
    "parts": [
      "口",
      "虫",
      "隹"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/38614_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/096d6.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/96d6.gif",
    "uri": "https://jisho.org/search/%E9%9B%96%23kanji"
  },
  "hanviet": [
    "tuy"
  ],
  "vietnameseMeaning": [
    "① Dầu, dù. Dùng làm lời suy xét tưởng tượng. Như tuy nhiên 雖然 dầu thế, song le, tuy nhiên, v.v. ② Con tuy, một giống thú như con lợn, mũi hếch lên, đuôi dài rẽ làm đôi. ③ Cùng nghĩa với chữ thôi 推 hay duy 惟. ① Dù, mặc dù, dù rằng, dù có, cho dù (đi nữa), tuy, tuy rằng: 工作雖忙，可是學習決不能放鬆 Công việc tuy bận, nhưng quyết không nên lơ là học tập; 果能此道矣，雖愚必明，雖柔必強 Nếu làm được đạo đó, thì dù ngu ắt cũng sáng ra, dù yếu ắt cũng mạnh lên (Trung dung). 【雖復】 tuy phục (văn) Cho dù, mặc dù, dù rằng: 雖復千年一聖，終是百世同宗 Cho dù một ngàn năm mới có một bậc thánh, thì cuối cùng trăm đời về trước vẫn là đồng tộc (Dữu Tử Sơn tập); 【雖然】 tuy nhiên Tuy, tuy rằng, tuy vậy, cho dù như thế, dù thế: 諸侯之禮，吾未之學也，雖然，吾嘗聞之矣 Lễ nghi của chư hầu ta chưa học, tuy vậy ta đã từng nghe nói (Mạnh tử); 【雖說】tuy thuyết (khn) Tuy nhiên, tuy vậy, thế nhưng; 【雖則】tuy tắc Như 雖然; ② Con tuy (loài bò sát giống như con thằn lằn); ③ (văn) Xô, đẩy (dùng như 推, bộ 扌); ④ (văn) Chỉ (dùng như 惟, bộ 忄): 女雖湛樂從 Ngươi chỉ biết có vui chơi phóng túng (Thi Kinh: Đại nhã, Ức); ⑤ (văn) Há (dùng như 豈, bộ 豆, biểu thị sự phản vấn): 雖無予之，路車疾馬？ Há chẳng cho ngươi xe loại chư hầu đi và xe tứ mã? (Thi Kinh)."
  ]
}