{
  "id": "雜",
  "kanjialiveData": null,
  "jishoData": {
    "query": "雜",
    "found": true,
    "strokeCount": 18,
    "meaning": "mixed, blended, mix, mingle",
    "kunyomi": [
      "まじ.える",
      "まじ.る"
    ],
    "onyomi": [
      "ザツ",
      "ゾウ"
    ],
    "onyomiExamples": [],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "隹",
      "meaning": "small bird"
    },
    "parts": [
      "亠",
      "人",
      "木",
      "隹"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/38620_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/096dc.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/96dc.gif",
    "uri": "https://jisho.org/search/%E9%9B%9C%23kanji"
  },
  "hanviet": [
    "tạp"
  ],
  "vietnameseMeaning": [
    "① Lẫn lộn. Các loài khác nhau họp lẫn ở một nơi gọi là tạp. Như chỗ người trong nước và người nước ngoài ở lẫn với nhau gọi là tạp cư địa 雜居地. ② Tạp nhạp. Không thể đứng phân biệt hẳn ra một loài gọi là tạp. Như trong các môn học có môn học cả các môn tạp nhảm gọi là tạp gia 雜家. Trong các đồ hàng có đồ lặt vặt gọi là tạp hoá 雜貨, v.v. ③ Trừ hạng chính ngạch ra, ngoài ra đều gọi là tạp cả. Như trong quan lại, các chức tá, chức phó đều gọi là tạp chức 雜職. Trong các giống thóc lúa trừ lúa tẻ lúa nếp ra, ngoài ra đều gọi là tạp lương 雜糧, v.v. ① Tạp (nhạp), nhiều thứ nhiều loại, các thứ, lặt vặt, linh tinh: 雜色 Tạp sắc; 雜事 Việc vặt, việc linh tinh; 雜貨 Hàng hoá các loại, tạp hoá; 雜花 Đủ các loại hoa, hoa các loại; ② Lẫn lộn, táp nham: 夾雜 Lẫn lộn; ③ (văn) Pha trộn (phối hợp) các màu sắc: 畫繢之事雜五色 Việc hội hoạ phối hợp năm màu (Khảo công kí: Hoạ hội); ④ (văn) Hỗn hợp, trộn lẫn lại: 故先王以土與金，木，水，火雜，以成百物 Cho nên các bậc tiên vương lấy thổ và kim, mộc, thuỷ, hoả trộn lại, để thành ra trăm vật (Quốc ngữ: Trịnh ngữ); ⑤ Vai trong kịch để sai vặt làm đủ thứ việc; ⑥ (văn) Đều, cùng, chung: 雜曰... Đều nói...; 雜處 Ở chung; 其事是以不成，雜受其刑 Việc đó vì thế không thành, đều chịu hình phạt của ông ta (Quốc ngữ).【雜然】tạp nhiên (văn) Đều, cùng."
  ],
  "grade": "10"
}