{
  "id": "靈",
  "kanjialiveData": null,
  "jishoData": {
    "query": "靈",
    "found": true,
    "strokeCount": 24,
    "meaning": "soul, spirit",
    "kunyomi": [
      "たま"
    ],
    "onyomi": [
      "レイ",
      "リョウ"
    ],
    "onyomiExamples": [],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "雨",
      "meaning": "rain"
    },
    "parts": [
      "人",
      "口",
      "工",
      "雨"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/38728_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/09748.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/9748.gif",
    "uri": "https://jisho.org/search/%E9%9D%88%23kanji"
  },
  "hanviet": [
    "linh"
  ],
  "vietnameseMeaning": [
    "① Thần linh. Khí tinh anh của khí dương gọi là thần 神, khí tinh anh của khí âm gọi là linh 靈, ý nói vật gì được khí tinh anh đúc lại hơn cả trong các vật cùng loài với nó vậy. Như người là giống linh hơn cả muôn vật, con kì lân, con phượng hoàng, con rùa, con rồng gọi là tứ linh 四靈 bốn giống linh trong loài vật. ② Thần. Như bách thần 百神 gọi là bách linh 百靈, thần núi gọi là sơn linh 山靈, v.v. ③ Người chết gọi là linh, ý nói hình chất tuy nát, tinh thần thường còn vậy. Ðặt bài vị thờ kẻ chết gọi là thiết linh 設靈. ④ Uy phúc không hiện rõ gọi là linh. Như thanh linh 聲靈 cảm đến là ta thấy thấu ngay, hình như có cái gì soi xét bênh vực cho không cần phải dùng đến thực lực vậy. ⑤ Ứng nghiệm. Như bói toán thuốc thang mà thấy hiệu nghiệm ngay đều gọi là linh. ⑥ Linh hoạt, lanh lẹ, không ngu ngốc xuẩn trệ. ① Nhanh nhẹn, linh hoạt, lanh lẹ, tinh, thính: 心靈手巧 Khéo tay nhanh trí; 耳朵很靈 Tai rất thính; ② Tâm thần, linh hồn: 心靈 Tâm thần; 英靈 Anh linh; ③ (cũ) Linh thiêng, thiêng liêng: 神靈 Thần linh; 靈怪 Thiêng quái; ④ Kì diệu, thần kì; ⑤ Thần linh, thần, yêu tinh: 山靈 Các thần (trong núi); ⑥ Hiệu nghiệm, ứng nghiệm, kết quả: 靈藥 Thuốc hiệu nghiệm; 這個法子很靈 Làm theo cách này rất có kết quả; ⑦ Linh cữu, quan tài: 守靈 Túc trực bên linh cữu; 移靈 Dời linh cữu; 靈前擺滿了花圈 Vòng hoa đặt đầy trước linh cữu; ⑧ (Họ) Linh."
  ]
}