{
  "id": "體",
  "kanjialiveData": null,
  "jishoData": {
    "query": "體",
    "found": true,
    "strokeCount": 23,
    "meaning": "the body, substance, object, reality",
    "kunyomi": [
      "からだ",
      "かたち"
    ],
    "onyomi": [
      "タイ",
      "テイ"
    ],
    "onyomiExamples": [
      {
        "example": "体術",
        "reading": "タイジュツ",
        "meaning": "classical form of martial art"
      },
      {
        "example": "身体",
        "reading": "シンタイ",
        "meaning": "body, physical system, (the) person"
      },
      {
        "example": "旧字体",
        "reading": "キュウジタイ",
        "meaning": "old character form, kyūjitai, traditional form of kanji used in Japan before 1946"
      },
      {
        "example": "身体",
        "reading": "シンタイ",
        "meaning": "body, physical system, (the) person"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "体",
        "reading": "からだ",
        "meaning": "body, torso, trunk, build, physique, frame, figure, health, constitution"
      }
    ],
    "radical": {
      "symbol": "骨",
      "meaning": "bone"
    },
    "parts": [
      "冂",
      "冖",
      "口",
      "并",
      "日",
      "月",
      "豆",
      "骨",
      "｜"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/39636_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/09ad4.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/9ad4.gif",
    "uri": "https://jisho.org/search/%E9%AB%94%23kanji"
  },
  "hanviet": [
    "thể"
  ],
  "vietnameseMeaning": [
    "thể ① Thân thể. Nói tất cả một bộ phận gọi là toàn thể 全體. Nói riêng về một bộ phận gọi là nhất thể 一體. Bốn chân tay gọi là tứ thể 四體. ② Hình thể. vật gì đủ các chiều dài chiều rộng chiều cao gọi là thể. ③ Sự gì có quy mô cách thức nhất định đều gọi là thể. Như văn thể 文體 thể văn, tự thể 字體 thể chữ, chính thể 政體, quốc thể 國體, v.v. Lại nói như thể chế 體制 cách thức văn từ, thể tài 體裁 thể cách văn từ, đều do nghĩa ấy cả. ④ Ðặt mình vào đấy. Như thể sát 體察 đặt mình vào đấy mà xét, thể tuất 體恤 đặt mình vào đấy mà xót thương, v.v. ⑤ Cùng một bực. Như nhất khái, nhất thể 一體 suốt lượt thế cả. ⑥ Một tiếng trái lại với chữ dụng 用 dùng. Còn cái nguyên lí nó bao hàm ở trong thì gọi là thể 體. Như nói về lễ, thì sự kính là thể, mà sự hoà là dụng vậy. 【體己】thể kỉ ① Của riêng. Cg. 梯己 ; ② Thân cận: 體己人 Người thân cận. Xem 體 . ① Thân thể: 身體 Thân thể; ② Thể, hình thể, chất: 物體 Vật thể; 全體 Toàn thể; 液體 Chất lỏng; 個體 Cá thể; ③ Thể, lối: 字體 Thể chữ, lối chữ; 文 體 Thể văn; ④ Lĩnh hội, thể hội, thể nghiệm, đặt mình vào đấy: 體驗 Thể nghiệm, nghiệm thấy; 體察 Đặt mình vào đấy để xét; 體恤 Đặt mình vào đấy mà thương xót; ⑤ Thể (bản chất bao hàm bên trong, trái với dụng 用), bản thể, bản chất; ⑥ Lí thuyết (trái với thực hành) Xem 體 ."
  ]
}