{
  "id": "點",
  "kanjialiveData": null,
  "jishoData": {
    "query": "點",
    "found": true,
    "strokeCount": 17,
    "meaning": "point, mark, speck, decimal pt",
    "kunyomi": [
      "つ.ける",
      "つ.く",
      "た.てる",
      "さ.す",
      "とぼ.す",
      "とも.す",
      "ぼち"
    ],
    "onyomi": [
      "テン"
    ],
    "onyomiExamples": [
      {
        "example": "点穴",
        "reading": "テンケツ",
        "meaning": "pressure points (e.g. for application of moxa), vulnerable body cavities"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "黑",
      "meaning": "black"
    },
    "parts": [
      "卜",
      "口",
      "杰",
      "里",
      "黒"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/40670_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/09ede.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/9ede.gif",
    "uri": "https://jisho.org/search/%E9%BB%9E%23kanji"
  },
  "hanviet": [
    "điểm"
  ],
  "vietnameseMeaning": [
    "① Cái vật bé tí. Tục nói cái gì bé tí gọi là là nhất điểm 一點. Cái gì tế toái vụn vặt gọi là điểm điểm 點點. ② Nét chấm. Nói rộng ra phàm cái gì dính líu vào một tí liền buông ra ngay đều gọi là điểm. ③ Dấu chấm câu. ④ Chỗ xoá hay chỗ chữa trong bài văn cũng gọi là điểm. Như văn bất gia điểm 文不加點 ý nói tài tứ nhanh nhẹn, làm văn xong không phải chữa nữa. ⑤ Giờ. Như thập điểm 十點 mười giờ. ⑥ Xét nét. Như kiểm điểm 檢點, tra điểm 查點. ⑦ Chỉ định cho, chỉ điểm cho. ⑧ Ăn lót dạ. Như điểm tâm 點心. ⑨ Trong phép tính (môn hình học), cho phần chỉ có vị trí mà không có lớn bé, dài ngắn, dày mỏng gọi là điểm. Như lưỡng tuyến đích giao điểm 兩線的交點 điểm gặp nhau của hai đường chéo. ⑩ Nhơ bẩn. ⑪ Giọt nước rớt vào. ⑫ Hơ nóng. ① Hạt, giọt: 雨點 Hạt mưa; ② Chấm, vết: 墨點 Vết mực; 污點 Vết bẩn; ③ Nét chữ (trong chữ Hán “丶”); ④ (toán) Điểm: 兩線的交點 Điểm giao nhau của hai đường chéo; 基準點 Điểm mốc; ⑤ Chấm, nét chấm, dấu chấm, điểm: 句點 Dấu chấm; ⑥ Chút ít, một ít, một tí: 吃一點點心 Ăn một ít bánh điểm tâm; ⑦ Điểm, điều, việc: 有兩點建議 Đề nghị hai điểm; 這一點，我們是不同意的 Chúng tôi không đồng ý điều đó; ⑧ Nơi, chỗ, điểm: 起點 Khởi điểm, chỗ bắt đầu; 沸點 Điểm sôi; ⑨ Phần, điểm, nét: 特點 Đặc điểm, nét riêng biệt; ⑩ Chấm, điểm: 點句 Chấm câu; 點一個點兒 Chấm một điểm nhỏ; ⑪ Gật (đầu): 他點了點頭 Anh ta gật gật đầu; ⑫ Nhỏ, tra: 點眼藥 Nhỏ thuốc đau mắt; ⑬ Trồng, tra: 點花生 Trồng lạc, trồng đậu phộng; 點玉米 Tra ngô; ⑭ Kiểm soát, xét, kiểm, đếm, điểm, gọi: 把錢點一點 Kiểm tiền, đếm tiền; 點名 Điểm danh, gọi tên; ⑮ Chọn ra, gọi, kêu: 點菜 Chọn thức ăn, gọi món ăn; ⑯ Bảo, dạy bảo: 他是聰明的人，一點就明白了 Anh ta là người sáng dạ, bảo một tí là hiểu ngay; ⑰ Châm, đốt, thắp, nhóm: 點燈 Thắp đèn, 點火 Nhóm lửa; ⑱ Giờ: 上午十點鐘 Mười giờ sáng; 現在幾點了？ Bây giờ đã mấy giờ rồi?; ⑲ Lúc, giờ: 到點了，開始吧 Đến giờ rồi, bắt đầu đi!; ⑳ (Bánh) điểm tâm, (bánh) ăn lót dạ: 糕點 Bánh điểm tâm; 早點 Bánh ăn lót dạ buổi sáng; ㉑ (in) Cỡ chữ in; ㉒ Nhằm vào, nói đến."
  ]
}