{
  "id": "齊",
  "kanjialiveData": null,
  "jishoData": {
    "query": "齊",
    "found": true,
    "strokeCount": 14,
    "meaning": "alike, equal, similar, Saito",
    "kunyomi": [
      "そろ.う",
      "ひと.しい",
      "ひと.しく",
      "あたる",
      "はやい"
    ],
    "onyomi": [
      "セイ",
      "サイ"
    ],
    "onyomiExamples": [
      {
        "example": "斉",
        "reading": "セイ",
        "meaning": "Qi (kingdom in China during the Spring and Autumn Period and the Period of the Warring States), Ch'i"
      }
    ],
    "kunyomiExamples": [],
    "radical": {
      "symbol": "齊",
      "meaning": "even, uniformly"
    },
    "parts": [
      "亠",
      "刀",
      "廾",
      "氏",
      "齊"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/40778_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/09f4a.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/9f4a.gif",
    "uri": "https://jisho.org/search/%E9%BD%8A%23kanji"
  },
  "hanviet": [
    "tễ",
    "tư",
    "tế",
    "tề",
    "trai",
    "tê",
    "tày"
  ],
  "vietnameseMeaning": [
    "① Chỉnh tề, không có so le lẫn lộn gọi là tề. ② Ðều. Cái trình độ tiến hành đều ngang nhau gọi là tịnh giá tề khu 並駕齊驅. ③ Tuẫn tề 徇齊 nhanh chóng, mẫn tiệp, thông tuệ. ④ Nước Tề, thuộc tỉnh Sơn Ðông 山東 bây giờ. Vì thế có khi gọi tỉnh Sơn Ðông là tỉnh Tề. ⑤ Nhà Tề 齊. Tề Cao Ðế 齊高帝 là Tiêu Ðạo Thành 蕭道成 được nhà Tống 宋 trao ngôi cho làm vua gọi là nhà Nam Tề 南齊 (409-502). Cao Dương 高洋 được nhà Ðông Nguỵ 東魏 trao ngôi cho làm vua gọi là nhà Bắc Tề 北齊 (550-577). ⑥ Tục gọi sự gì được đủ cả gọi là tề. ⑦ Cùng khởi lên làm trong một lúc cũng gọi là tề. ⑧ Một âm là tư. Cái gấu áo. Áo tang vén gấu gọi là tư thôi 齊衰. ⑨ Lại một âm nữa là trai. Cùng nghĩa với chữ trai 齋. Như 躋 (bộ 足): 地氣上齊，天氣下降 Khí đất bay lên, khí trời giáng xuống (Lễ kí). Bào chế thuốc (như 劑, bộ 刂): 醫者齊藥也 Thầy thuốc là người bào chế thuốc (Hàn Phi tử). ① Đều nhau, chỉnh tề, tề chỉnh: 步伐很齊 Bước đi rất đều; ② Đủ: 來齊了 Đến đủ rồi; ③ Ngang, bằng, mấp mé: 河水齊腰深 Nước sông sâu ngang lưng; 水漲得齊岸 Nước lên mấp mé bờ sông; 並駕齊驅 Tiến đều ngang nhau; ④ Như nhau, cùng một: 齊心 Cùng một lòng, đồng lòng; ⑤ Cùng (một lúc): 百花齊放 Trăm hoa (cùng) đua nở; 落霞與孤騖齊飛 Ráng chiều sa xuống, cùng cánh cò đơn chiếc đều bay (Vương Bột: Đằng vương các tự). Xem 一齊 ; ⑥ Sát: 齊着根剪斷 Cắt sát tận gốc; ⑦ (văn) Đầy đủ; ⑧ (văn) Nhanh nhẹn: 徇齊 Nhanh chóng; 齊疾而均，速若飄風 Nhanh chóng mà chỉnh tề, mau như gió thổi (Thương Quân thư: Nhược dân); ⑨ (văn) Cái rốn (như 臍, bộ 肉); ⑩ Nước Tề (đời Chu, Trung Quốc); ⑪ (Họ) Tề. (văn) Như 齋 nghĩa ③."
  ],
  "grade": "10"
}