{
  "id": "齒",
  "kanjialiveData": null,
  "jishoData": {
    "query": "齒",
    "found": true,
    "strokeCount": 15,
    "meaning": "tooth, cog",
    "kunyomi": [
      "よわい",
      "は",
      "よわ.い",
      "よわい.する"
    ],
    "onyomi": [
      "シ"
    ],
    "onyomiExamples": [],
    "kunyomiExamples": [
      {
        "example": "歯",
        "reading": "は",
        "meaning": "tooth, teeth, tooth (of a comb, saw, etc.), cog, support (of a geta)"
      },
      {
        "example": "歯医者",
        "reading": "はいしゃ",
        "meaning": "dentist"
      }
    ],
    "radical": {
      "symbol": "齒",
      "meaning": "tooth, molar"
    },
    "parts": [
      "人",
      "凵",
      "止",
      "歯",
      "米"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/40786_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/09f52.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/9f52.gif",
    "uri": "https://jisho.org/search/%E9%BD%92%23kanji"
  },
  "hanviet": [
    "xỉ"
  ],
  "vietnameseMeaning": [
    "① Răng. Mọc lúc nhỏ gọi là nhũ xỉ 乳齒 răng sữa, mọc lúc lớn gọi là vĩnh cửu xỉ 永乆齒 răng già. ② Tuổi. ③ Kể tuổi mà định trên dưới gọi là tự xỉ 序齒. ④ Kể. Kể làm người cùng bọn với mình gọi là xỉ 齒, không kể làm bọn với mình gọi là bất xỉ 不齒. ⑤ Vật gì xếp bày như hàm răng đều gọi là xỉ. Như cứ xỉ 鋸齒 răng cưa. ⑥ Lượng số tuổi ngựa cũng gọi là xỉ. ① Răng (hoặc vật có hình răng): 長齒 Mọc răng; 拔齒 Nhổ răng; 乳齒 Răng sữa; 鋸齒兒 Răng cưa; ② (cũ) Tuổi, tuổi tác: 齒德 Tuổi tác và đức hạnh; 序齒 Kể tuổi (để định trên dưới); 退而甘食其土之有，以盡吾齒 (Tôi) trở về được ăn những món ngon của miền này cho đến hết tuổi đời (Liễu Tôn Nguyên: Bổ xà giả thuyết); ③ (văn) Kể, kể đến, nói tới, coi trọng, kể là cùng một loại người, đặt ngang hàng (dùng 不齒 với ý phủ định, tỏ ý khinh bỉ): 行動惡劣，人所不齒 Hành động xấu xa, ai cũng thấy không còn là người nữa; 不足掛齒 Không đáng kể; 巫醫樂師百工之人，君子不齒 Thầy cúng, thầy thuốc, nhạc sư và những người làm thợ các nghề, bậc quân tử không kể họ là cùng một loại (không xếp ngang hàng với mình) (Hàn Dũ: Sư thuyết); 不爲其家所齒 Không được nhà mình coi trọng (Tư trị thông giám: Lương kỉ); ④ (văn) Tính số tuổi ngựa; ⑤ (văn) Đụng, chạm: 腐肉之齒利劍 Thịt nát chạm phải gươm bén (Mai Thừa: Thượng thư trùng gián Ngô vương); ⑥ (văn) Con xúc xắc."
  ]
}